{"name": "A Crown of Madness", "information": "prerequisites = *&3A Crown of Majesty&r\n*&3Winds of War&r\n*&3Halls Of Wind And Blood NPC: Antoine King's Valleytown = Sierhavenstarting_npc_coordinates = -767, 107, 132starting_npc_coordinates = -767, 107, 132 King's Valleytown = Sierhavenstarting_npc_coordinates = -767, 107, 132town = Sierhavenstarting_npc_coordinates = -767, 107, 132", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Antoine AlignDefault \n  Color|orange|[Antoine]}} \n I'm quite busy so ... OH IT'S YOU!  \n  Color|purple|[Me? Do you know me?]}} \n  Color|purple|[Of course it's me!]}}  \n  Color|orange|[Antoine]}} \n I've read of you in Bhairavi's notes to Vargos! You helped uncover that Spirit curse near Nyr.  \n  Color|purple|[Nope that was someone else.]}}  \n  &6[Antoine]}} \n Oh, sorry then. I'm far too busy to deal with you in that case. \n  &5[Ah yes, that was me]}}  \n  Color|orange|[Antoine]}} \n Welcome to the Official Center of Curse Research and Prevention for King's Valley! Thanks to your work with Bhairavi, the King has funded research into uncovering other curses that could still threaten the empire.  \n  Color|purple|[That's neat! Find any curses lately?]}}  \n  Color|orange|[Antoine]}} \n Well... no. It turns out we've been pretty good at containing and removing them in the past. There was a large ban on dark magic trinkets during the war like hex stones and onyxes.  \n  Color|purple|[Onyxes were banned?]}}  \n  Color|orange|[Antoine]}} \n Yes. Didn't you know? They are extremely susceptible to the dark magics the Tlaxans would make their curses out of. They are quite dangerous.  \n  Color|purple|[I may have retrieved an onyx for Aimee, the local jeweler.]}}  \n  Color|orange|[Antoine]}} \n Say what now? Where did you even find one? You need to go check on your Jeweler friend; she could be in danger! \n  Color|purple|[Well keep up the good work!]}}  \n  &6[Antoine]}} \n Thank you. Have a good day. \n  Color|purple|[Booooooooooring.]}}  \n  &6[Antoine]}} \n Hmph! Maybe you're not the wise adventurer that aided   Link   Bhairavi Bhairavi wikilink after all.  \n&o  Check on Aimee the Jeweler to see if the onyx you brought her was cursed. [-760, 106, 20] Table  AlignDefault ColWidthDefault AlignDefault \n Aimee AlignDefault \n  Color|orange|[Aimee]}} \n The night is dark and full of stars... dark as onyx, gleaming like gems... SoftBreak RawInline  Color|purple|[Aimee are you okay?]}} \n  Color|orange|[Aimee]}} \n The onyx, ___?! I can see the universe within that precious stone you gathered just for me. \n  Color|purple|[I thought that was for the King's Crown?]}} \n  Color|orange|[Aimee]}} \n So precious... So beautiful. \n  Color|purple|[It's too late. I need to tell Antoine you've been cursed.]}} \n  Color|orange|[Aimee]}} \n I am one with the soul of the jungle...  \n&o  Report back to Antoine in the Academy about Aimee's condition Table  AlignDefault ColWidthDefault AlignDefault \n Antoine AlignDefault \n  Color|orange|[Antoine]}} \n How was the Jeweler? Is she okay?  \n  Color|purple|[I don't think so... she seems to have gone mad.]}}  \n  Color|orange|[Antoine]}} \n Hopefully it doesn't spread... Well now it's up to you to fix this. I need you to go retrieve an opal to help her.  \n  Color|purple|[Why an opal?]}}  \n  Color|orange|[Antoine] \n Opals are the opposite of onyxes. Instead of fueling and amplifying a curse, the opal will negate one.  \n  &5[Sounds easy enough.]}} \n  Color|purple|[Sounds easy enough.]}}  \n  Color|orange|[Antoine]}} \n You would think, but opals have been out of style for decades. After onyxes were rounded up and destroyed, merchants stopped selling 'protective amulets' and other junk and soon the demand died down completely. Last I checked, the opal mines were closed completely.  \n  Color|purple|[Where was the mine?]}}  \n  Color|orange|[Antoine]}} \n What do I look like? An atlas? I don't know! You should go ask the Royal Cartographer about the opal mine. He would know better than I. You can find him at the top of the alchemy building. Now go, and go quickly!  \n&o  Speak with the Royal Cartographer on the roof of the alchemy building at -795 122 -40 Table  AlignDefault ColWidthDefault AlignDefault \n Royal Cartographer AlignDefault \n  Color|orange|[Royal Cartographer]}} \n Salutations citizen! It is rare I find myself with company! How can I be of service? SoftBreak RawInline  Color|purple|[I'm looking for the old opal mine.]}} \n  Color|PURPLE|[Do you have any maps of the Valley I can see?]}} \n  Color|orange|[Royal Cartographer]}} \n An old opal mine eh? I think I know just the spot. It was closed in the aftermath of the war but... oh dear. Yes. That mine collapsed partially. A number of miners were killed in the collapse and their spirits are said to roam the dark shafts still. They call it the Haunted Mine now. The shaft down to the Opal Mine can be found at the end of a path of red and white-spotted mushrooms. Be careful and watch out for spirits!  \n&o  Head to the Haunted Mine at -650 120 535. Follow the red mushrooms until you reach a gravel wall. Mine through the wall to reach an elevator. Inside, complete the minecart puzzle to collect the Opal. Head back to Antoine. Table  AlignDefault ColWidthDefault AlignDefault \n Antoine AlignDefault \n  Color|orange|[Antoine]}} \n It feels like you've been gone for ages! Now we need to make a crown out of this gem, but since our local jeweler is out of commission we're going to use the next best thing, the blacksmith. Find Orson at the forge and get him to make us an opal crown.  \n&o  Meet Orson the blacksmith in his shop at -720 108 23 Table  AlignDefault ColWidthDefault AlignDefault \n Orson AlignDefault \n  Color|ORANGE|[Orson]}} \n A true master of the forge knows the ancient patterns by heart. SoftBreak RawInline  Color|Purple|[I need a crown made with this opal.]}} \n  Color|purple|[I want to learn to make something!]}} \n  Color|ORANGE|[Orson]}} \n That is a strange request. Don't we have a local Jeweler to do fine delicates work like that? \n  Color|purple|[She's cursed right now! This is urgent!]}} \n  Color|ORANGE|[Orson]}} \n Well that does sound like a good reason. Alright, I'll see what I can do. \n&o  Orson snatches up the opal and chisels it down, then adds it to a fresh-out-of-the-furnace helmet. He lobs off the top of the helmet, and you receive an Ugly Opal Crown.  \n&o  Speak with Aimee Table  AlignDefault ColWidthDefault AlignDefault \n Aimee AlignDefault \n  Color|orange|[Aimee]}} \n The skies are dark. It is too quiet... It's gone. My crown is gone! SoftBreak RawInline  Color|purple|[Aimee put this crown on.]}} \n  Color|orange|[Aimee]}} \n That's not it! Not it! Not it! \n  Color|purple|[This crown will bring back the one you lost!]}} \n  Color|orange|[Aimee]}} \n Give it here! Help me find it! \n&o  Aimee scrambles to get the Ugly Opal Crown on and is almost instantly noticeably cured. \n  Color|orange|[Aimee]}} \n ___? Why are you here? Everything feels like a blur... \n  Color|purple|[The crown you made with the Onyx cursed you. Where is it now?]}} \n  Color|orange|[Aimee]}} \n I... I think someone came in and took it from me... He said something... something about being a Crown bear? No that's not right... the Crown BEARER! He was the one who commissioned the crown originally. He told me this was all according to plan, and took it! \n  Color|purple|[We need to get that crown back!]}} \n  Color|orange|[Aimee]}} \n Yes we do! Hurry to the King, ___! He has to have been heading there.  \n&o  Head to the throne room at -720 123 -105 and defeat the Crown Bearer Table  AlignDefault ColWidthDefault AlignDefault \n Royal Translator AlignDefault \n  Color|orange|[Royal Translator]}} \n What in good heavens was that? SoftBreak RawInline  Color|purple|[That was me saving the day.]}} \n  Color|purple|[That was an assassination attempt on the King.]}} \n&o  The King mumbles a few words. \n  Color|orange|[Royal Translator]}} \n The King agrees with you there. Thank you for your services to the empire!  \n  Color|purple|[Aren't you going to reward me?]}}  Plain &o  The King mumbles a few more words. \n  Color|orange|[Royal Translator]}} \n Well that's not really in the budget you see. You would best look for a reward elsewhere. \n  Color|purple|[I'd best report back to Aimee.]}}  Plain &o  The King mumbles a few more words. \n  Color|Orange|[Royal Translator]}} \n We do not know what the jeweler has to do with any of this but if that's where you need to be then safe travels.  \n&o  Let Aimee know what happened at the Castle Table  AlignDefault ColWidthDefault AlignDefault \n Aimee AlignDefault \n  Color|orange|[Aimee]}} \n ___ I can't thank you enough for saving me. SoftBreak RawInline  Color|purple|[I'm just glad you're okay.]}} \n  Color|orange|[Aimee]}} \n Well I think you're well due a reward so I've fixed up this opal crown for you. Thank you again. You should also talk to the King again, he will most likely want to speak with you. They probably managed to find room in the budget to reward you.  \n A CROWN OF MADNESS COMPLETE! Awarded 32 CXP, and an   Link   Opal Crown Opal_Crown wikilink ", "reward": "rewards = *Opal Crown\n*32 CXP"}