{"name": "A Beast of a Book", "information": "prerequisites = Completed the &3Vernal NightmareYellow dungeon&r\n NPC: Erwen Coords: 600, 99, 115\n King's Valley Farr\nrelated_poi=&3Aphelion Isle&r<br> &3Weeping Wormwood&r<br> &3Altar of Evocation&r<br>\n", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Erwen \n  Coordinates: [600, 99, 115] \n   &6[Erwen] \n Hail, adventurer. I'm Erwen, the Animal Hunter. Have you come to prove yourself and earn the Bestiary? \n  &5[The Bestiary?] \n  &6[Erwen] \n Yes! The culmination of my life's work hunting the various beasts and monsters of this world. With my time hunting finished, I seek to help others become possibly even greater than I, and what better way to do so than to share my knowledge with the world? \n  &5[What's the catch?] \n  &6[Erwen] \n Is it not clear? I can't share this with simply just anyone, no! Only those who can prove their prowess of the hunt are worthy to receive this gift. Do you wish to prove yourself? \n  &5[I'm in.] \n  &6[Erwen] \n Good. Let me know when you're ready and we will being the first hunt.  Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n Your first hunt is the deadly Star Spitter. It lurks on the shores of a blighted island, south of the Oceangate. They are fragile, but getting hooked by them can prove deadly. Its ink is necessary for its special properties; I task you with killing 5 of these beasts. Return when you are successful. Oh, and don't worry about harvesting the bodies or bringing them back- I need you only to prove you can kill them in the first place. I will use my own supply of materials.  \n&o  Hunt down 5 Star Spitters in the waters around   Link   Aphelion Isle Aphelion_Isle wikilink  . Then return to Erwen in Farr. Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n Have you killed five Star Spitters? \n  &5[Yes, I have killed 5 Star Spitters.] \n  &6[Erwen] \n Excellent. Take a rest, and return when you are ready to being the second hunt.  Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n I presume you are ready? Your second hunt will take you into the depths of the demon summoner's grove, to the great   Link   Weeping Wormwood Weeping_Wormwood wikilink tree. You must slay 5 Weeping Barklings, for they will serve as the paper due to their latent magical properties.  \n&o  Hunt down 5 Weeping Barklings at the   Link   Weeping Wormwood Weeping_Wormwood wikilink in   Link   Azacor’s Grove Azacor’s_Grove wikilink  . Then return to Erwen in Farr. Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n Have you killed five Weeping Barklings? \n  &5[Yes, I have killed 5 Weeping Barklings.] \n  &6[Erwen] \n Good, good. Already you've made it farther than most who think they can become a hunter like me. Rest, and return again.  Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n For your third hunt, a feather for a quill is required. Only the finest will do, yet the finest was hunted to extinction. But it can be brought back. Seek out an altar hidden in the jungle, a dark pool of red. Slay 3 of the hateful demons that are evocated there, and their bodies can be fashioned into what we need.  \n&o  Hunt down 3 Hate Knights in   Link   Altar of Evocation Altar_of_Evocation wikilink  . Then return to Erwen in Farr. Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n Have the Hate Knights been eradicated? \n  &5[The demons have been slain.] \n  &6[Erwen] \n I am impressed, young adventurer. Now with their remains, I can form a memory of what once was. A feather from the once elusive, now extinct, Chromatic Crane. You've certainly earned your rest this time. Take it, for the final hunt is the most difficult yet.  Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n The final hunt. You will need Soulleather, which is made from the flesh of the legendary Questing Beast, to bind the Bestiary with. This is a special beast- to put it frankly, I don't think you can kill it. \n  &5[I have heard that one before; they were proven wrong.] \n  &6[Erwen] \n I do not mean to insult your skill. I meant it literally, it has powerful regenerative properties. It'll heal from a wound faster than you can make another. All you need is a cut of its flesh for the soulleather, which makes the real hunt actually locating the damn thing in the first place. \n  &5[Any idea where I should start looking?] \n  &6[Erwen] \n Luckily for you, I've already handled most of that. I last tracked it to somewhere in Sierhaven, which is odd now that I think about it. It rarely even steps into the swamp at all. It's gotta be hiding somewhere, but Sierhaven is a big city. The Polling Place in Sierhaven would be a good place to start. It used to be a stable you know, and I'd reckon there's some old unused space that would make a good hiding spot, due to the likely leftover water and animal feed.  \n&o  Search for the Questing Beast at the Polling Place in Sierhaven. \n When you find the Questing Beast: \n  &5You smell it before you see it... it seems like there's something living down there. \n After defeating the Questing Beast: \n  &6[Donkey Attendant] \n What's going on down here? Oh my god, Hubert, did this person hurt you? You! Get out, right now! Table  AlignDefault ColWidthDefault AlignDefault \n Donkey Attendant AlignDefault \n  &6[Donkey Attendant] \n What do you think you were doing? Breaking and entering, attacking my poor Hubert! \n  &5[Hubert? That's the Questing Beast!] \n  &6[Donkey Attendant] \n You think I don't know that? I captured him and took him down here to take care of him! He's happy here, not having to get slaughtered out in the wild for people to make clothes with his flesh! I treat him like royalty and in exchange, he lets me take trimmings from his horn. \n  &5[What do you need the horn trimmings for?] \n  &6[Donkey Attendant] \n Do you really not know?! Quest compasses have to come from somewhere, and Hubert's horn trimmings make excellent needles and put the \"Quest\" in quest compass! Now off with you! I don't want to see you back here again, you can go mail in your vote or something if you need to vote...  \n&o  Return to Erwen. Table  AlignDefault ColWidthDefault AlignDefault \n Erwen AlignDefault \n  &6[Erwen] \n You return, hunter. Is the deed done? \n  &5[Well...] \n&o  You explain how the Questing Beast was already captured and likely content not having to die repeatedly. \n  &6[Erwen] \n Ah, can't say I'm upset to hear that. Much better than getting slaughtered over and over, I imagine. Still, did you get some flesh for the Soulleather? \n  &5[I did.] \n  &6[Erwen] \n You have done an outstanding job. I was starting to fear that maybe there really was no one worthy of receiving my gift, yet here you are. I am proud. Here is your very own Bestiary, handcrafted by me with the spoils of your hunts. May it treat you well.  \n A BEAST OF A BOOK COMPLETE! Awarded   Link   The Bestiary The_Bestiary wikilink  ! ", "reward": "rewards =\n* &3The Bestiary&r\n"}