{"name": "A Charming Proposition", "information": "prerequisites = * None\n NPC: Miroku Coords: -482 38 -816\n Architect's Ring Port Manteau\nDifficulty = Easy\nLength = Short\n", "dialogue": "}} \n&o  Get a charm from Miroku, and then conquer   Link   Vibrant Hollow Vibrant_Hollow wikilink  . \n&o  C: You feel a strange power emanating from the docks of Port Manteau... Table  AlignDefault ColWidthDefault AlignDefault \n Miroku \n  Coordinates: [-482 38 -816] \n   &6[Miroku] \n I am not familiar with your ship. Is this your first time visiting these lands?  \n  &5[It is.]  \n  &6[Miroku] \n I will not trouble you for why you are here, but are you aware of charms? \n  &5[I have been here before.]  \n  &6[Miroku] \n Interesting. Are you already familiar with our charms? \n Next Choice:  \n  &5[Yes, I know about charms.]  Plain  (Missing) \n  &5[Which type of charm are you referring to?]  \n  &6[Miroku] \n I suppose a lot of things are called charms...but I'm referring to Charms, a type of item fairly common around these parts that can be used to strengthen you. Shall I tell you more? \n  &5[Maybe later.]  \n  &6[Miroku] \n I understand. I do hope that you return. \n  &5[Please do.] \n  &6[Miroku] \n Charms are a powerful type of item commonly found in the Architect Ring. They require between one and five charm slots to equip. Typically stronger charms require more slots, but a \"weaker\" charm might be better for your build, so there is a lot of room for customization. \n  &6[Miroku] \n A trained adventurer like yourself would probably be able to use about 9 charm slots. You will gain the ability to use more as you progress through our lands. \n  &6[Miroku] \n Charms can be generic, but most of them revolve around a certain class or specialization. \n  &6[Miroku] \n Charms tend to be combat oriented, although non-combatants have at times had ones custom made to help around the house. \n  &6[Miroku] \n You can manage your currently equipped charms with a trinket. Just about everyone around here has one. We pretty much just give them away.  \n  &5[So what do you want me to do?]  \n  &6[Miroku] \n I didn't intend for you to do anything, but I suppose I could come up with something if you are interested. \n  &5[Thank you for the information.]  \n  &6[Miroku] \n I do have a proposal for you, if you are interested. \n Next Choice:  \n  &5[I want to look around more first.]  \n  &6[Miroku] \n Hopefully you will return shortly. I will give you a charm just for accepting my request. \n  &5[What do I need to do?] \n  &6[Miroku] \n I want to give you a charm, and the trinket to use it. In return, I ask that you conquer Vibrant Hollow. Obviously, if you do conquer it, I will have another reward for you.  \n  &5[That sounds like too much work.]  \n  &6[Miroku] \n Perhaps, but you could take the charm and just ignore the rest of the quest. I wouldn't get mad or anything. \n  &5[I accept] \n  &6[Miroku] \n Speak with me again when you are ready to select your charm.  \n&o  C: Get a Charm from Miroku. Table  AlignDefault ColWidthDefault AlignDefault \n Miroku \n  Coordinates: [-482 38 -816] \n   &6[Miroku] \n The time has come for you to make a choice. This isn't a tricky choice so don't worry too much. All I need to know is which class you intend to conquer the Vibrant Hollow with. I will be more than happy to sell any of them to you once the Vibrant Hollow are dealt with. \n  &5[Mage] \n  &5[Warrior] \n  &5[Cleric] \n  &5[Rogue] \n  &5[Alchemist] \n  &5[Scout] \n  &5[Warlock.] \n Whichever class you pick: \n  &6[Miroku] \n (Class)? Are you sure?  \n  &5[I would rather pick a different class.]  Plain  (Just re-asks what class) \n  &5[I am.]  \n  &6[Miroku] \n (Class) it is then. Here is a trinket and a charm to use with it.  \n Receive a Charms Trinket and a charm depending on the class you pick. \n  Warrior -   Link   Bronze Spikes Bronze_Spikes wikilink \n &o  C: Conquer   Link   Vibrant Hollow Vibrant_Hollow wikilink by defeating the Mushroom Archmage, then return to Miroku. \n How to reach Mushroom Archmage: \n  Clear enough of the PoI to get a message of the miniboss being spawned. \n&o  You feel mana flowing from the Village's Fortress. Whatever cursed this place - it's still here. \n Then go to [-575 10 -640] in the PoI. (Basement of the large house.) \n  After beating the miniboss: \n&o  C: Return to Miroku and claim your reward. Table  AlignDefault ColWidthDefault AlignDefault \n Miroku \n  Coordinates: [-482 38 -816] \n   &6[Miroku] \n You return victorious! Wonderful job. As promised I have a reward for you.  \n  color|teal|'''A CHARMING PROPOSITION COMPLETE!'''}} \n  color|teal|Awarded 16 Archos Rings}} ", "reward": "rewards =\n* 16 Archos Rings\n"}