{"name": "A Crew to Remember", "information": "prerequisites = none \n NPC: Captain Indigo Coords: 683, 73, 491\n King's Valley Sierhaven\nrelated_poi=&3Grand Maw&r, &3Murky Maze&r\n", "dialogue": "}} \n  WorkInProgress|Levyn dialogue choice, Chief Editor Sumona dialogue choices, now starts at Levyn in Sierhaven}} Table  AlignDefault ColWidthDefault AlignDefault \n Captain Indigo \n  Coordinates: [683, 73, 491] \n   &6[Captain Indigo] \n I'm looking for pirates, are you a pirate? \n  &5[Arrgh?] \n  &6[Captain Indigo] \n Clearly not, at least not yet. Well do you happen to know any pirates? \n  &5[Arrgh! There be one lad I know in a pub in Sierhaven who plunders.] \n  &6[Captain Indigo] \n Please don't try to speak like a pirate every again. You're awful at it. But any pirate would be better than you so maybe you can help me! I'm trying to put together a crew for my ship here, could you go speak to your friend about joining it?  \n  &5[I'll go speak with my pirate friend.]  \n  &6[Captain Indigo] \n Wonderful! \n  &5[I am insulted and will not help you. ARRGH!]  \n  &6[Captain Indigo] \n Goodbye then.  \n&o  Speak to a pirate in a Sierhaven pub. Table  AlignDefault ColWidthDefault AlignDefault \n Levyn \n  Coordinates: [-809, 101, 82] \n   &6[Levyn] \n Ahoy [Player]! To what do I owe my favorite matey today? \n  &5[I've got a pirate job offer for you.] \n  &6[Levyn] \n Shiver me timbers and call me a bosun, just tell me where to report to! \n  &5[Captain Indigo has a ship docked in Lowtide, you should go speak with her.] \n  &6[Levyn] \n Aye I will! I expect I'll be seeing you over there as well?  \n  &5[Sure I'll come visit.]  \n  &6[Levyn] \n (Missing) \n  &5[Of course, I need to claim my reward.]  \n  &6[Levyn] \n What's a pirate without their treasure!  \n If you talk to Indigo: SoftBreak RawInline  &6[Captain Indigo] You've done good, I think. Levyn is quite the character, but he seems very comfortable below deck. We're going to need more crew, but for now Levyn has a request of you. \n&o  Go below deck and speak to Levyn. Table  AlignDefault ColWidthDefault AlignDefault \n Levyn (Below Deck) AlignDefault \n  &6[Levyn] \n This be quite the fine vessel. I can't wait to set sail. \n  &5[Indigo said you had a task for me?] \n  &6[Levyn] \n Aye! I appear to have landed the position of Lookout. Likely cuz of my arrr-mazing eye. But in order to do the job right I'll be needing the perfect spyglass, matey. \n  &5[Where can I find you a spyglass?] \n  &6[Levyn] \n Not just any spyglass, friend. I need the famed spyglass of Captain Bijou! Even my parrot doesn't know where to find it though. I saw a book house or whatever they're called on my way into this piratey town though! Maybe they know where Bijou's voyage ended!  \n&o  Speak to Chief Editor Sumona. Table  AlignDefault ColWidthDefault AlignDefault \n Chief Editor Sumona \n  Coordinates: [691, 76, 539] \n   &6[Chief Editor Sumona] \n Hi, welcome to the Library. I'm Sumona, the head of editing and curation here. Is there anything specific you're looking for?  \n  &5[No, I'm just browsing.]  \n  &6[Chief Editor Sumona] \n Ah, well I hope you find something interesting. There's plenty here, from historical primers, to Walthan's exploration logs. Between you and I though, he's got a bit of an ego, so don't take him too seriously in person. Brilliant researcher though. \n  &5[I'm on a mission to find the spyglass of Captain Bijou.] \n  &6[Chief Editor Sumona] \n Ah, now that's quite the story. Bijou was a pirate captain based out of Sierhaven who sailed under the Narsen banner.  \n  &5[Narsen banner? But he was a pirate.]  \n  &6[Chief Editor Sumona] \n He may have been a pirate, but for a share of his plunder the Crown would leave him be.  \n  &5[That sounds wrong.] \n  &5[That's a great deal.]  \n  &6[Chief Editor Sumona] \n I, well, um. I suppose so from one perspective. \n  &5[Ah, so he was a privateer.] \n  &6[Chief Editor Sumona] \n Anyways, some other pirates weren't too happy about the deal Bijou had with the Crown, so one night they made their way to where his ship was tied down and cut it loose. Before anyone could flee, it went over the waterfall by Nyr and the wreckage floated down the river!  \n  &5[That's Tragic!]  \n  &6[Chief Editor Sumona] \n Perhaps. But you were looking for his spyglass. If I were to bet I'd say it washed down the river all the way into the Grand Maw. \n  &5[He got what was coming to him.] \n  &5[Thank you. I'll go check that out.] \n  &6[Chief Editor Sumona] \n Good luck!  \n&o  Look for Captain Bijou's spyglass in the   Link   Grand Maw Grand_Maw wikilink  . \n After collecting the Spyglass: \n&o  Once you have Captain Bijou's spyglass take it to Levyn. Table  AlignDefault ColWidthDefault AlignDefault \n Levyn (Below Deck) AlignDefault \n  &6[Levyn] \n You've found Bijou's Spyglass! I'll be the most swashbuckling Lookout of all time with this! The captain told me we're looking for a Navigator though. I may know just where ya can find one! Arrr! \n  &6[Levyn] \n Whoever wrote this message seems to have a grasp of traversing the sea, so go help them out!  \n  &5[You haven't acted on this message for weeks?!]  \n  &6[Levyn] \n I thought it was pretty cool just having a Message in a Bottle. \n  &5[How do you suppose I'll be able to understand this?]  \n  &6[Levyn] \n It looks like coordinates! I've heard of a cartographer back in Sierhaven who has a place above the Alchemists. Maybe he'll know more for ye.  \n&o  Take the Message From A Bottle to the Royal Cartographer in Sierhaven. Table  AlignDefault ColWidthDefault AlignDefault \n Royal Cartographer \n  Coordinates: [-797, 122, -43] \n   &6[Royal Cartographer] \n Salutations citizen! \n  &5[I need help deciphering the coordinates in this message. They were written by a pirate.] \n  &6[Royal Cartographer] \n Ooh a pirate! How thrilling, well if I had to take a guess then... \n  &6[Royal Cartographer] \n Ahh yes these coordinates are nautical, you see .1 seaports is a block west and .1 seabows is a block north. It looks like the message is referring to the banner behind the Apartments, so you should set sail from there!  \n&o  Follow the coordinates in the message to the stranded Navigator. Be ready for anything. \n  Start at the Sierhaven Flag and then go 270 blocks west and 90 blocks north. \n  Izzy \n  Coordinates: [-1306, 91, -12] \n   &6[Izzy] \n Help! Get me out of here! Since we wrecked the ship Billam has gone mad. He has been eating all the crew and I'm next! \n  &5[How are you still alive if there hasn't been any food left?] \n  &6[Izzy] \n I have my ways. Look, are you going to save me or not?  \n After you kill the Starved pirate: \n&o RawInline  color|teal|After the pirate falls in battle, you find a tiny key on his body and take it. It's so small it takes up no room in your inventory. \n&o  Speak to Izzy Table  AlignDefault ColWidthDefault AlignDefault \n Izzy AlignDefault \n  &6[Izzy] \n Oh thank the heavens you've found me. I've been trapped for weeks and was almost the next meal. Is there any way I can repay you? \n  &5[I'm looking for a Navigator for a pirate crew, would you be willing?] \n  &6[Izzy] \n Well my last crew is long gone, so I suppose I am in need of a new ship to call home. I'll do it. \n  &5[Great, meet with Captain Indigo in Lowtide and I'll see you there.] \n  &6[Izzy] \n Thank you again!  \n&o  Go below deck and speak to Izzy. Table  AlignDefault ColWidthDefault AlignDefault \n Izzy (Below Deck) AlignDefault \n  &6[Izzy] \n The captain let me know we still need a Quartermaster, I've had some dealings with a smuggler named Samwell based out of Nyr; best in the business. If you can get him on board then I think this ship will be in great shape. \n  &5[Where should I start looking for him?] \n  &6[Izzy] \n Rummage around Scarface Ed's ware in Nyr, I've heard his guide to smuggling is quite enlightening.  \n&o  Speak with Scarface Ed by speaking his language and buying the Beginner's Guide to Smuggling. \n After buying the book: \n&o  The book is the key, the lock is the well. \n After getting into the tunnels: \n  color|Teal|The bottom of the well opens up and you are pulled into a secret tunnel. Your Beginner's Guide to Smuggling has taken some water damage. \n&o  Navigate your way through the sewers until you find someone. Remember, the book is the key. \n At the Shady Bouncer: \n&o  Get inside and talk to Samwell. Remember, the book is the key. Table  AlignDefault ColWidthDefault AlignDefault \n Samwell AlignDefault \n  &6[Samwell] \n If you have no business here then beat it. \n  &5[I'm looking for a Quartermaster for a pirate ship, would you be interested?] \n  &6[Samwell] \n A pirate ship eh? Can't say I've ever considered going legit. \n  &5[Legit? They're literal pirates.] \n  &6[Samwell] \n And who do you think double-crosses the pirates? Look I'm interested but not sold, if I'm going to do this then I'm going to need one last shipment to carry me over 'til we start plundering on the high seas or however they put it. \n  &5[One last shipment? I don't know if I like the sound of that.] \n  &6[Samwell] \n Look it's simple, the local guards are on high alert and know some of the familiar shifty faces, but they don't know you to have a bad reputation. Will you make the delivery?  \n  &5[I suppose I have to.]  \n  &6[Samwell] \n Good now you need to go to the bottom of the waterfall outside Nyr and find a place called the   Link   Murky Maze Murky_Maze wikilink  . In there you'll se a veil of water, our drop-off point is behind it. Make sure you place the goods and only the goods in the chest. Now take this and scram. \n  &5[I'll think about it.]  \n  &6[Samwell] \n Thinking doesn't get you anywhere, acting does.  \n&o  Enter the   Link   Murky Maze Murky_Maze wikilink  . \n After entering   Link   Murky Maze Murky_Maze wikilink  : \n&o  Make your way to the drop-off point and put the goods, and only the goods, in the chest. \n After dropping the goods in: \n&o RawInline  color|teal|Looks like the goods are in place, I should return to Samwell. \n&o  Return to Samwell. Remember, the book is the key, the lock is the well Table  AlignDefault ColWidthDefault AlignDefault \n Samwell AlignDefault \n  &6[Samwell] \n I've gotten word that the goods were in the drop-off point in time. I'm ready to give this pirating stuff a go. \n  &5[Captain Indigo is waiting for you in Lowtide.] \n  &6[Samwell] \n I'll see you there.  \n&o  Return to Captain Indigo. Table  AlignDefault ColWidthDefault AlignDefault \n Captain Indigo AlignDefault \n  &6[Captain Indigo] \n You did it! The crew is assembled thanks to you. I've been working on a deal with the Crown to get us permission to leave the Valley. Once we can you're more than welcome to join us on our expeditions. Until then I have a reward for you!  \n A CREW TO REMEMBER COMPLETE! Awarded:   Link   Sea Legs Sea_Legs wikilink  , Honorary Pirate Status, and 16 Concentrated Experience. ", "reward": "rewards =\n* &3Sea Legs&r\n* Honorary Pirate Status\n* 16 Concentrated Experience\n"}