{"name": "A Dish to Die For", "information": "prerequisites = None\n NPC: Claude Coords: 734, 74, 459\n King's Valley Lowtide\nrelated_poi=&3Abandoned Tunnels&r\n", "dialogue": "  WorkInProgress|Other Dialogue option at the end. Table\n Claude\n  Coordinates: [734, 74, 459]\n   &6[Claude]\n Bonsoir, are you a customer? I apologize, the restaurant is currently closed.\n  &6[Claude]\n I 'ave been trying to create the perfect signature dish, but my mind, it is blocked! Are you of the... culinary persuasion? If\nso, could you assist me?\n  &5[I'm sorry, I'm not much of a chef.]\n  &6[Claude]\n I should 'ave known. Your eyes do not 'ave the spark of culinary genius.\n  &5[Of course! How can I help?]\n  &6[Claude]\n Marvelous! Fantastique! I 'ave some ideas, but we shall need the most exotic of ingredients.\n  &6[Claude]\n I 'ave 'eard of an old Tlaxan farm, where the lava imparts the most wonderful flavor to the wheat there. Let us start by\ngathering that, and see what pairs with it, no?\n  &5[I've got something else to do first, but I'll be back!]\n  &6[Claude]\n Very well, please return soon!\n  &5[I'm on it!]\n  &6[Claude]\n Merci!\n&o  Harvest some Flame-Spiced Wheat for Claude.\n Head to   Link   Abandoned Tunnels Abandoned_Tunnels wikilink  .\n&o  Bring back the Flame-Spiced Wheat to Claude. Table\n Claude\n  &6[Claude]\n I 'ave prepared the mirepoix. 'ave you gotten any flame-spiced wheat for me?\n  &5[Yep! Here.]\n&o  You hand Claude the wheat. He expertly grinds it and whips up a small pastry dish.\n  &6[Claude]\n Mmm! The wheat is as wonderful as I 'ave been told, but we need more than just grains and vegetables.\n  &6[Claude]\n Lowtide is known for its fish, but I think some beef of the 'ighest quality will pair better. The Korbaran beef of the Korbar\n'ighlands' cows is said to be fantastique, think you can 'unt one for the dish?\n  &5[Of course I can!]\n  &6[Claude]\n Such spirit! Such zeal! I can only 'ope my dish will be as inspired as your confidence!\n&o  Hunt the Eastern Pass Cows to get some delicious High Quality Beef.\n Kill some of the cows above   Link   Eastern Pass Eastern_Pass wikilink  . (Note: you do not actually need to enter the PoI.)\n&o  Bring back the High Quality Beef to Claude. Table\n Claude\n  &6[Claude]\n My palate cannot endure much more waiting... Do you 'ave any of the delicious beef for me?\n  &5[It was a long hunt, but I've got the Korbaran beef.]\n&o  You hand Claude the beef. He quickly sears it and bites into the barely rare steak.\n  &6[Claude]\n Hm. For a normal dish, this would satisfy. 'owever, we are not making just any dish, but my chef's specialty. My masterpiece! I\nthink we will need something even more esoteric.\n  &6[Claude]\n I 'eard tales of a dangerous cave within the 'ighlands' lake, perhaps there will be some meat in there we can use.\n  &5[Fine, I shall investiage.]\n  &6[Claude]\n Marvelous! Every time I see your vigor I am more and more inspired!\n  &6[Claude]\n While you are out searching the cave, I might go 'unting for some game of my own. Be careful though, I also 'eard rumors of\nawful and 'orrid things occurring within.\n&o  According to Claude, some meat can be found in the   Link   Cave of Bones Cave_of_Bones wikilink near Highwatch, go get\nsome.\n After getting from ange Meat from   Link   Cave of Bones Cave_of_Bones wikilink  .\n&o  Bring this strange type of meat to Claude. Table\n Claude\n  &6[Claude]\n You return! Did you manage to find some usable meat?\n  &5[I... think so. This is what I could find.]\n&o  Claude bites directly into the raw meat you hand him. As he chews, a forlorn look comes across his face.\n  &6[Claude]\n Alas, this meat is too old. Shame, I would 'ave loved it fresh.\n  &6[Claude]\n It is okay though. While you were out, I... acquired some new meat. I would like you to do the 'onors of butchering it though,\nI think you will be pleasantly surprised. Please, 'ead upstairs.\n&o  Go to Claude's attic, and meet his new meatloaf. Table\n Terry\n  &6[Terry]\n Who's there?! Who are you?! Please, let me go! I have a family! That madman told me he needed a taste-tester, and that's the\nlast I remember before I woke up in this room! Please, let me go...\n  &5[Sorry, but we need meat.]\n  &6[Terry]\n Wait, wait! No don- ARGH!.. Plain &o  You take a nice slice out of Terry. He looks inconvenienced by this and will soon die.\n  &5[Don't worry, I'll set you free and stop Claude.]\n If you choose to free:\n&o  Confront Claude. Table\n Terry\n  &6[Terry]\n Thank you so much! I'd be dead without you! You go downstairs first, I'll escape while Claude is distracted.  Table\n Claude\n  &6[Claude]\n Welcome back, mon ami. I 'eard screaming. Do you 'ave it? Do you 'ave the meat?!\n&o\n  &5[No. You're a monster!]\n  &6[Claude]\n You... 'ow could you. You 'ad no problem with the meat from the cave. This is no different! I won't be denied! I must try it\nfresh!\n ''Claude grabs a long, serrated knife and leaps over the counter towards you!\n If you choose to cut some meat:\n&o  Bring Terry's meat back to Claude. Table\n Claude\n  &6[Claude]\n Welcome back, mon ami. I 'eard screaming. Do you 'ave it? Do you 'ave the meat?!\n&o\n  &5[Here it is.]\n&o  Claude greedily grabs the meat and bites into it raw, blood trickling from his mouth as he tears into it.\n  &6[Claude]\n Ooohhh. It's... divine. It's so... fresh. Fantastique! But Terry, 'e was a weakling. I can only imagine what you can taste\nlike. Although... I don't need to imagine, now do I?\n&o  Suddenly, Claude grabs a long, serrated knife and leaps over the counter towards you!\n After you beat Claude:\n&o  After your last hit, Claude staggers back behind the counter, wounded and in no condition to fight. Table\n Claude\n  &6[Claude]\n Ah! I may 'ave bitten off more than I could chew there. I 'ope you bear me no ill will, I was merely... overcome with passion.\n  &6[Claude]\n 'enceforth, my palate shall be 'uman-free. 'ere take these as thanks for knocking some sense back into me. I trust we can keep\nwhat 'appened 'ere our little secret, no?\n A DISH TO DIE FOR COMPLETE! Awarded the   Link   Chef's Knife Chef's_Knife wikilink and 16 CXP!\n", "reward": "rewards =\n* &3Chef's Knife&r\n* 16 Concentrated Experience\n"}