{"name": "A Lich in the System", "information": "prerequisites = \n* &3Fred's Bizarre Adventure&r\n* &3The Gem of Ishnir&r\n* &3Echoes of Oblivion&r completion.\n* &3City of Shifting Waters&r completion.\n NPC: Ancev Coords: -740 4 -177\n Celsian Isles Breachpoint\nDifficulty = Very Hard\nLength = Medium-Long\n", "dialogue": "}} \n  WorkInProgress|Missing two dialogue branches}} \n&o  Go speak to Fred at his mobile research station in   Link   Breachpoint Breachpoint wikilink  . Table  AlignDefault ColWidthDefault AlignDefault \n Ancev \n  Coordinates: [-740, 4, -177] \n   Color|Orange|[Ancev]}} \n Hello. Have you come to test the Doorway? \n  Color|Purple|[Do what now?]}}  \n  Color|Orange|[Ancev]}} \n Test the Doorway of course. Whatever this space before us is saps the light around it. It even steals your night vision if you use Sight-O-Tron over there! Something is... moving beyond this Doorway you see. I don't like it. \n  Color|Purple|[Not right now, no.]}}  \n  Color|Orange|[Ancev]}} \n That's a shame. Something is moving in there and we need more bodies to investigate. \n  Color|Purple|[What's that item next to you?]}}  \n  Color|Orange|[Ancev]}} \n I'm not really sure. It came from deep below the Breachpoints, and I've only just begun trying to use it. I'm not even sure how it was taken out of the Depths, honestly. \n  Color|Purple|[You know about Doorways?]}} \n  Color|Orange|[Ancev]}} \n Of course, I'm a researcher of Steelmeld. I also know you, [Player]. Would you be available to help me out here? SoftBreak RawInline  Color|Purple|[What do you need me to do?]}} \n  Color|Orange|[Ancev]}} \n I've been working closely with an associate of yours. His name is Fred. I've been investigating this weird, blocked off Doorway here, while Fred has been examining the Veil itself. We believe something has been travelling through the Veil, and we fear that recent events are allowing whatever it is to emerge. Will you help us investigate? \n  Color|Purple|[I'm in.]}} \n  Color|Purple|[Sorry, I'm not available right now.]}}  \n  Color|Orange|[Ancev]}} \n When you are, we're going to need you, I fear. \n  Color|Orange|[Ancev]}} \n Excellent. Fred has a small mobile research station set up upstairs, to the right. Go speak to him through it and he'll tell you more.  \n&o  Speak to Fred at his mobile research station in   Link   Breachpoint Breachpoint wikilink  . Table  AlignDefault ColWidthDefault AlignDefault \n Fred \n  Coordinates: [-717, 9, -169] \n   Color|Grey|As you approach, the fish shivers weirdly, then lets out a... puff of steam?}} \n  Color|Orange|[Fred]}} \n ...llo! Hello! Can you hear me [Player]? \n  Color|Purple|[Uh, yes? Fred? Is that you?]}} \n  Color|Orange|[Fred]}} \n Yeah! I turned myself into a fish, [Player]! I'm Fishy Fred! \n  Color|Purple|[WHAT?!]}} \n  Color|Orange|[Fred]}} \n I'm just joking! This is my mobile research station! This fish isn't real! I can communicate with the Breachpoint scientists remotely and continue working in my own labs. It's great! \n  Color|Purple|[Sounds like it.]}} \n  Color|Orange|[Fred]}} \n So anyway, I hear you've spoken to Ancev and you're willing to help with our project. SoftBreak RawInline  Color|Purple|[That I am.]}} \n  Color|Orange|[Fred]}} \n So let me run you through what I've been up to. After you found the Doorway inside the City of Shifting Waters, I began working intensely on studying the crystals inside. My research led me to discover other Doorways - breaches into the Veil itself - including one here at Breachpoint, where it turns out scientists were already studying! \n  Color|Purple|[That's convenient!]}} \n  Color|Orange|[Fred]}} \n Not really - they have a whole other set of problems you might be able to help them with honestly. What I've seen though is that the Veil is immensely weak right now. It's like a shell around the world, and it seems to be falling apart, see. Something must have triggered this. \n  Color|Purple|[I have a few thoughts on the matter.]}} \n  Color|Orange|[Fred]}} \n We'll chat later about those then, okay? Like I was saying, with the Veil starting to part, I noticed a weird resonance inside it, actively moving around through it. It's not quite like anything else I was getting readings on. More interestingly, it seemed to have originated FROM the City! \n  Color|Purple|[Oh no...]}} \n  Color|Orange|[Fred]}} \n The Shifting Crystals you found definitely seem to be able to manipulate the movement of the Veil around the City of Shifting Waters. I think with the right tweaks, we might be able to adjust the movement of whatever is travelling around the Veil as well. \n  Color|Purple|[This sounds so dangerous Fred. We don't even know what it is!]}} \n  Color|Orange|[Fred]}} \n Ah, that's where you're wrong, [Player]. I think I know exactly what's moving around in there. It's not what the other scientists are studying down at the Breachpoint source either. I think it's Hekawt, the former Vizier of Al Malakut. \n  Color|Purple|[Excuse me?]}} \n  Color|Orange|[Fred]}} \n We've both seen the pages he left behind. The Vaults? He went somewhere, [Player], but there's no way someone that powerful died. He's a Lich, a powerful undead sorcerer. Where better to continue your search for power than the very fabric of the Veil? SoftBreak RawInline  Color|Purple|[You're not wrong. I just don't know what you expect me to do should we find him.]}} \n  Color|Orange|[Fred]}} \n Kill him. Hopefully. If the Veil is breaking, he'll be free soon enough. We might as well take matters into our own hands. SoftBreak RawInline  Color|Purple|[This conversation is way less light-hearted than it was at the start.]}} \n  Color|Orange|[Fred]}} \n I know, I know. It's a very heavy topic. The world is not okay right now though. I've got a contact for you to meet up with. You know him already I think; Sierhaven Smith? He'll meet you over in the Twilight Ruins. He thinks Hekawt might have left something important there. \n  Color|Purple|[I'll head right over.]}} \n  Color|Orange|[Fred]}} \n Splendid.  \n&o  Meet up with Fred's contact, Sierhaven Smith, in the   Link   Twilight Ruins Twilight_Ruins wikilink  . Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith \n  Coordinates: [553, 72, -107] \n   Color|Orange|[Sierhaven Smith]}} \n Oh, hello [Player]! Fancy running into you here. \n  Color|Purple|[Not particularly, I was sent here to find you.]}} \n  Color|Orange|[Sierhaven Smith]}} \n Oh ho! That makes more sense. I found this place after a recent earthquake. I was worried you were working with some geologist or something! I take it you've been in contact with Fred then. \n  Color|Purple|[Indeed.]}} \n  Color|Orange|[Sierhaven Smith]}} \n Well, I'm sure you're wondering why I left Al Malakut. It's simple really. During my time investigating I found evidence that led me to believe that the Grand Vizier, Hekawt, did not perish in the fall of the city, and instead stole power from the artifact held within to become a Lich. \n  Color|Purple|[Yeah, Fred and I found his journals in the City of Shifting Waters.]}} \n  Color|Orange|[Sierhaven Smith]}} \n Indeed. Fred and I believe he is the presence moving through the Veil now. I've tracked power here, to where I believe Hekawt left his \"Phylactery\", a power source of magic that helps keep Hekawt alive. If I'm correct, it's in the room below, but it seems to be locked away. \n  Color|Purple|[Any idea how it's locked?]}} \n  Color|Orange|[Sierhaven Smith]}} \n I'm not entirely sure. I fear it has something to do with the Gray Wool and its power over death. \n  Color|Purple|[I'm gonna go touch it.]}}  \n  Color|Orange|[Sierhaven Smith]}} \n Wait what? No! You can't just rush in there. \n  Color|Purple|[I've held the Gray Wool like Hekawt has. I'm going to go try it.]}}  \n  Color|Orange|[Sierhaven Smith]}} \n ...okay. \n  Color|Purple|[What should I do?]}}  \n  Color|Orange|[Sierhaven Smith]}} \n Well, it didn't kill me when I approached, but I didn't touch the glowing part... \n  Color|Purple|[Maybe I'll try approaching. I've held the Gray Wool like Hekawt has. Perhaps it will let me in.]}} \n  Color|Orange|[Sierhaven Smith]}} \n (MISSING)  \n&o  Investigate the Phylactery in   Link   Twilight Ruins Twilight_Ruins wikilink  . \n  Color|Grey|As you touch the glowing mass, a shimmering ripple spreads out, and it feels as if you've been transported somewhere else entirely...}} \n  Color|Orange|[Sierhaven Smith]}} \n What did you do, [Player]? Wait, watch out, portals have opened in the floor around you! You're gonna have to hold off the creatures coming out while I try and figure a way out of here! \n  Color|Purple|\nWHO DARES THREATEN MY PHYLACTERY? MY LIFE? SUCH INSOLENCE...<br>\nCURIOUS... YOU ARE THE ONE WHO LET ME MOVE BEYOND THE CONFINES OF THE CITY. BEYOND THE CONFINES OF REALITY.<br>\nREGARDLESS, I CANNOT ALLOW YOU TO THREATEN MY SEARCH. I WILL BE RECLAIMING MY PHYLACTERY.<br>\nThe phylactery sinks into the darkness and disappears.<br>\nDO NOT INTERRUPT ME AGAIN, OR THERE WILL BE CONSQUENCES.<br>\nAs Hekawt sinks into the darkness as well, the room returns to normal.<br>}} \n  Color|Orange|[Sierhaven Smith]}} \n Are you okay? It was so dark, I couldn't see much of what happened. Come up here and tell me! Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith \n  Coordinates: [553, 72, -107] \n   Color|Orange|[Sierhaven Smith]}} \n Are you okay? It was so dark, I couldn't see much of what happened. Come up here and tell me! \n  Color|Orange|[Sierhaven Smith]}} \n Hey! You're back and not dead! ...Right? \n  Color|Purple|[Wooooo! I'm a ghost and I'm here to haunt you!]}} \n * RawInline  Color|Orange|[Sierhaven Smith]}} AHHHHHH  \n&o  Return to Fred at his mobile research station in Breachpoint. Table  AlignDefault ColWidthDefault AlignDefault \n Fred \n  Coordinates: [-717, 9, -169] \n   Color|Orange|[Fred]}} \n ...a yes, welcome back [Player]. I got a message from Siery that you were on your way back. So it's time to burn the Lich then, yes? \n  Color|Purple|[Sounds like it. I found his Phylactery, but he showed up and took it.]}} \n  Color|Orange|[Fred]}} \n Horrible. Well, I think it's time to request a meeting with the Pharaohs of Alnera. We need to find a place of significance to Hekawt to force him out of the Veil using our crystals. Perhaps they'll know the best place? \n  Color|Purple|[Sounds like a plan. Hopefully they'll still listen to me.]}}  \n  Color|Orange|[Fred]}} \n I'm sure they will! You're very convincing. Head on over and request a meeting. \n  Color|Purple|[So bear with me. Why is it so important that we take out Hekawt?]}}  \n  Color|Orange|[Fred]}} \n I'm not sure if you've read all of the journals we found inside the City, but I think it's a pretty simple prospect. He spent all that time searching for a wool. The Black Wool. He wants it to be able to reshape himself and the world around him in his image. That doesn't seem very reasonable, does it? \n  Color|Purple|[I think I get it. He's not exactly an ally against Calder then.]}} \n  Color|Orange|[Fred]}} \n (MISSING dialogue if it exists at all) \n  Color|Orange|[Fred]}} \n Head over to Alnera and meet with the Pharaohs. It's time to kill Hekawt.  \n&o  Talk to the Pharaoh's Guards to request a meeting. Table  AlignDefault ColWidthDefault AlignDefault \n Pharaoh's Guard \n  Coordinates: [398, 7, 871] \n   Color|Orange|[Pharaoh's Guard]}} \n Keep moving. The room must be cleared before the Pharaoh's return. \n  Color|Purple|[I need to meet with one of the Pharaohs. It's important.]}} \n  Color|Orange|[Pharaoh's Guard]}} \n Wait here, War Ender. If the Pharaoh will speak with you, we will let you know. \n  Color|Grey|You nod and wait for an answer...}} \n  Color|Orange|[Pharaoh's Guard]}} \n Pharaoh Tyro Syl will meet you, [Player]. But not here. Above the palace is a quiet balcony. You might find him there.  \n&o  Go up to the balcony and meet with Pharaoh Tyro Syl. Table  AlignDefault ColWidthDefault AlignDefault \n Pharaoh Taro Syl \n  Coordinates: [399, 35, 831] \n   Color|Orange|[Pharaoh Tyro Syl]}} \n I hear you come with dark tidings on the wind [Player]. A stirring in the shadows is never fortuitous. \n  Color|Purple|[Hekawt, the former vizier of Al Malakut stirs. He lives still, as a Lich.]}} \n  Color|Orange|[Pharaoh Tyro Syl]}} \n A disgusting, vile beast. No wonder he has remained hidden for so long, doomed to the bowels of history. Still, this answers many questions my ancestors have wondered about the fall of Al Malakut. \n  Color|Grey|Tyro Syl spits onto the ground.}} \n  Color|Purple|[I am glad. I also need your help - we're trying to kill him and need a place connected to his mortal life to summon him from the Veil.]}} \n  Color|Orange|[Pharaoh Tyro Syl]}} \n The Moltan Treasure Vault would do it. It was recently rediscovered where it had thought to be lost, but a bitter blight hangs over it. Hekawt used to oversee its operations back during the days of Al Malakut. Considering its current state, it may be the perfect place for you to call him forth. \n  Color|Purple|[Where can I find it?]}} \n  Color|Orange|[Pharaoh Tyro Syl]}} \n Travel to the mining town of Molta and look for a passage through the mountains from within the town. It will lead you to its ruins. \n  Color|Purple|[Thank you.]}} \n  Color|Orange|[Pharaoh Tyro Syl]}} \n May the blessings of Mauta be upon you.  \n&o  Travel to the Moltan Treasure Vault, purchase a warped emblem from Ancev outside the Vault, slay Hekawt, then return to Ancev outside the vault. \n After slaying   Link   Hekawt Hekawt wikilink  : Table  AlignDefault ColWidthDefault AlignDefault \n Ancev \n  Coordinates: [399, 35, 831] \n   Color|Orange|[Ancev]}} \n You... you did it! Hekawt has been destroyed! I can't wait to see what this has done to the doorway! The Pharaohs will surely want to hear about this!  \n&o  Return to Pharaoh Tyro Syl on the balcony in Alnera and give them the news of your success. Table  AlignDefault ColWidthDefault AlignDefault \n Pharaoh Taro Syl \n  Coordinates: [399, 35, 831] \n   Color|Orange|[Pharaoh Tyro Syl]}} \n You return. Triumphant, I hope? \n  Color|Purple|[Triumphant. Hekawt is no more.]}} \n  Color|Orange|[Pharaoh Tyro Syl]}} \n Then Ishnir is in your debt yet again [Player]. A nasty stain on our past has fallen for good.  \n  Color|Cyan|'''A GLICH IN THE SYSTEM COMPLETE'''<br>\nAwarded access to the trades Pharaoh Tyro Syl provides and the ability for him to embalm your items!}} ", "reward": "rewards =\n* Access to &3Ire of the Gods&r trade.\n"}