{"name": "A Little Spark", "information": "prerequisites = None\n NPC: &3Cinevra&r Coords: -759, 126, 75\n &3King's Valley&r &3Sierhaven&r\n", "dialogue": "&o  Get an arc-crystal for Cinevra from Vinny at the Apartments. Table\n Cinevra\n  Coordinates: [-759, 126, 75]\n   &6[Cinevra]\n Well hello there. Welcome to my office. Who are you?\n  &5[I'm [Player].]\n  &6[Cinevra]\n Nice to meet you, [Player]! I'm Arcmage Cinevra. I'm a member of the Mage Council here in   Link   Sierhaven Sierhaven wikilink\nand was the creator of the teleporters found all across the Valley.\n  &5[Wow! How does it all work then?]\n  &6[Cinevra]\n Ah, lovely! You really want to know? Well, it's pretty simple. Basically, you use an object's thaumic signature to transmute it\nthrough elemental phases, via the application of an arc-crystal. With a specific endpoint in mind, you encode that information\nin runes onto specific faces of the now-shaped object-crystal meld, and then...   &o  Your mind beings to wander...\n  &5[...Oh! Wow, yeah, that sounds so cool.]\n  &6[Cinevra]\n Thanks, I'm glad you think so! I wasn't done yet, however. I have so much more I can tell you!\n  &5[Hehe.. Maybe some other time.]\n  &6[Cinevra]\n Okay! Come back soon!\n  &5[I thought Vargos was the Archmage?]\n  &6[Cinevra]\n Oh, no! You misheard me! I'm an ARCmage, not an Archmage! I never noticed the similarity before... how silly. I work with\nlightning in a magical way to create new things!\n  &5[So you made all these teleporters?]\n  &6[Cinevra]\n I did! It was quite the undertaking and took lots of travel, but that's why I'm a trusted member of the Mage Council!\n  &5[Do you have any tasks for me?]\n  &6[Cinevra]\n Oh, I'm so glad you asked! I actually do. See, recently, the Apartment complex just down the street was torn down and rebuilt.\nAnyway, the supervisor, Vinny, has a fantastic arc-crystal I've been wanting. It's the perfect piece of Magiscience out there!\nIf you can go get it for me, I'll give you a nice reward and teach you more about the King's Station here, or as it's more\ncasually known, the teleport hub!\n  &5[I'm in!]  Plain  (This starts/continues the quest.)\n  &5[Maybe later.]\n  &6[Cinevra]\n So be it!\n&o  C: Go talk to Vinny in the Apartments Building. Table\n Vinny\n  Coordinates: [-811, 102, 37]\n   &6[Vinny]\n Well hey, how ya doin' there?\n  &5[Hi, I'm [Player]. What's this place?]\n  &6[Vinny]\n This is the Apartment complex that I run. We remodeled due to a huge rat problem. We still have a few here and there though...\n  &6[Vinny]\n Chat with my Manager over there for more details. We've got a nice new program in place.\n  &5[Hi, Cinevra sent me to ask you for an arc-crystal.]\n  &6[Vinny]\n Ah, of course she did. Girl's been wanting that crystal for ages. Alright, fine, she can have it. I stuck it in one of the\nstorage rooms downstairs. You'll have to work out my categorizing system and go fetch it yourself though, if you wanna get it.\nIt's under magical science or something like that.\n  &5[How do I do that?]\n  &6[Vinny]\n Have a look at this book, work out which block the arc-crystal would be in, then check the rows of categories down here to find\nthe storage room you should visit. Talk to my storeroom manager down there if you need more help.\n  &5[Thank you!]\n  &6[Vinny]\n Say nothin' of it. Hey, maybe come buy some Ender Chest Expansions from my Apartment Manager over there too, eh?\n&o  C [1/2]: Go talk to Vinny in the Apartments Building.\n&o  C [2/2]: Head to the basement. Find the correct Vincent Variable System room, then use the elevator to visit that apartment\nand find the arc-crystal.\n  Go to the basement via the door at [-821, 94, 27].\n Talk to the Storeroom manager there if you need help or a new book.\n Look through   Link   Vincent Variable System Vincent_Variable_System wikilink and on page 3 find that the 500's section holds\nthe sciences. (We are looking for magical science).\n The 4th spot down shows we need apartment 504.\n Head to the elevator at [-2157, 140, 770] and input 504 into the key pad and grab the arc-crystal from the chest in the room at\n[-2171, 123, 781].\n &o  C [1/2]: Head to the basement. Find the correct Vincent Variable System room, then use the elevator to visit that apartment\nand find the arc-crystal.\n&o  C [2/2]: Return to Cinevra with the arc-crystal.\n After leaving the basement with an arc-crystal in your inventory:\n&o  C: Return to Cinevra with the arc-crystal. Table\n Cinevra\n  Coordinates: [-759, 126, 75]\n   &6[Cinevra]\n Amazing! Oh my goodness, this arc-crystal is just beautiful. Thank you so much! Let me help you out here. I'm gonna give you a\nlittle zap of this crystal, which should grant you right around 10 experience levels. With that, you can go buy that ender chest\nexpansion Vinny's having his manager sell now!\n  &5[Thank you!]\n  &6[Cinevra\n There you go! Now, about the King's Station here... It's pretty simple. You go somewhere, you find the teleporter there, you\nstep on it - it brings you back here! Now you can always go back through to whichever location you teleported in from, as much\nas you'd like! I hope you use it well.\n   Awarded 10 levels and some knowledge about the King's Station.\n", "reward": "rewards =\n* 10 levels\n"}