{"name": "A Lost Cause", "information": "prerequisites = &3A Merchant's Woe&r and &3Dealbreaker&r\n NPC: Amina Coords: 323, 47, 764\n Celsian Isles Alnera\nPOI: &3Crystal Haven&r, &3Warehouse Compound&r\n", "dialogue": "}} \n  WorkInProgress|Dialogue, Double check, add puzzle and more context.}} Table  AlignDefault ColWidthDefault AlignDefault \n Amina \n  Coordinates: [323, 47, 764] \n   &6[Amina] \n Safar, my right-hand man, informed me of an adventurer who has helped the Trade a great deal. Tell me, is that you? \n  &5[Yes, and here is the Amulet to prove it.] \n&o  She looks at the amulet in acknowledgement. \n  &6[Amina] \n Hmm... so it seems you are. I believe a greeting is in order then. My name is Amina, and I am the head of the Ishnir Trade. You, [Player], have shown the Trade your loyalty. \n  &5[So why did you want to see me?] \n  &6[Amina] \n You see, a rather perplexing issue has recently emerged. Many of our outposts among the Trade Route have fallen silent- one of the larger and more important outposts being the Crystal Haven. \n  &6[Amina] \n If we were to lose contact for a prolonged period of time, the Ishnir Trade would have a much harder time moving valuables between cities.  \n  &5[That sounds like a real issue... but I have something else to do.]  \n  &6[Amina] \n (MISSING) \n  &5[So I should check that out?] \n  &6[Amina] \n Precisely.  \n C:   &o  See why the   Link   Crystal Haven Crystal_Haven wikilink lost contact with Amina and The Trade. \n When you enter the storage area: \n&o  As you walk down the hallway you find yourself in a gigantic storeroom seemingly owned by The Trade. \n After you solve one side: \n&o  A click reverberates from the mechanism... \n After you solve both: \n&o  The vault door slowly swings open as the last mechanism is activated! Table  AlignDefault ColWidthDefault AlignDefault \n Hassan AlignDefault \n  &6[Hassan] \n Please don't harm me! \n&o  He flinches and looks away from you. \n  &5[I'm not here to harm you! I was sent by Amina.] \n  &6[Hassan] \n Amina? Oh, thank goodness! You've got to tell her what happened here! Raiders have slaughtered everyone! \n  &5[Yeah, I saw that. They seem to be overrunning the upper levels...] \n  &6[Hassan] \n I had to hide in the vault- luckily, they were too stupid to figure out the locking mechanism... Wait- oh no, I think they're coming back!  \n C:   &o  Save Hassan from the ambush! \n After saving Hassan: Table  AlignDefault ColWidthDefault AlignDefault \n Hassan AlignDefault \n  &6[Hassan] \n Thank goodness you defeated them! Now go warn Amina about what has happened here! \n  &5[What about you?] \n  &6[Hassan] \n I'll be fine, just go!  \n C:   &o  Warn Amina of what has happened at the   Link   Crystal Haven Crystal_Haven wikilink  . Table  AlignDefault ColWidthDefault AlignDefault \n Amina AlignDefault \n  &6[Amina] \n So? Have you scouted out the outpost? \n  &5[Yes. Most of the men stationed there were killed... Hassan was the only survivor.] \n  &6[Amina] \n What?! How could this be? What happened? \n  &5[Raiders took over the outpost. They nearly killed Hassan too!] \n  &6[Amina] \n Oh, this is awful, just awful! You need to warn Riaz about this. He controls the base of operations for Rahkeri- hopefully he can come up with a plan to help.  \n C:   &o  Travel to Rahkeri to meet Riaz to tell him about the situation. Table  AlignDefault ColWidthDefault AlignDefault \n Riaz \n  Coordinates: [MISSING] \n   &6[Riaz] \n Hello again, [Player]! How are you doing? \n  &5[Amina sent me. The Trade's outpost in Crystal Haven has been overrun with raiders.] \n  &6[Riaz] \n What?! How could this be? The Trade Route was always a secure means of travelling... \n  &5[She's asking you for a plan. Got any ideas?] \n  &6[Riaz] \n Well, we'd probably need to scout out a new location to build an outpost... However, to do so, we should ask for help in one of our other outposts, namely the Warehouse Compound. Have a look around there for mapping supplies.  \n C:   &o  [1/2]: Seek mapping supplies from the   Link   Warehouse Compound Warehouse_Compound wikilink  . \n C:   &o  [2/2]: Return to Riaz once you have found them. Table  AlignDefault ColWidthDefault AlignDefault \n Riaz AlignDefault \n  &6[Riaz] \n Did you find any maps? \n  &5[Yes, but the camp was also overrun with raiders... I was lucky I even got these.] \n  &6[Riaz] \n What? The warehouse, too? This can't be true! SoftBreak  He looks at you in disbelief. \n  &5[What should we do next?] \n  &6[Riaz] \n Thankfully, the maps you've retrieved are usable; I'll let Amina know when I've scouted out a location. You should go tell her about the warehouse though... I doubt she'll be pleased.  \n C:   &o  Let Amina know that the Warehouse Compound was also overrun... Table  AlignDefault ColWidthDefault AlignDefault \n Amina AlignDefault \n  &6[Amina] \n So has Riaz devised a solution? \n  &5[Yes, I've helped him retrieve some mapping supplies from the warehouse, but...] \n  &6[Amina] \n But? What's the but? \n  &5[It was overrun, too...] \n  &6[Amina] \n By Ishnir, are you serious? How could this happen? The Trade seems to be falling apart... \n&o  She looks completely distressed. \n  &5[Maybe I could help you guys reclaim what's yours?] \n  &6[Amina] \n Hmm, now that's an idea. The raiders are powerful though... Traveling to the Bandit Hideaway Hill on the Trade Route and stealing some of their food reserves might slow them down enough for us to take over again! Don't worry about getting all of it, about ten should be enough. Don't want them to starve to death, that would make us no better than them.  \n C:   &o  [1/2]: Raid the   Link   Bandit Hideaway Hill Bandit_Hideaway_Hill wikilink for their food rations. (You need 10 food supplies). \n C:   &o  [2/2]: Return to Amina with the raider's food reserves. Table  AlignDefault ColWidthDefault AlignDefault \n Amina AlignDefault \n  &6[Amina] \n Perfect! That looks like quite a bit of their food- let's see how well they raid without anything to eat. \n  &5[Hopefully that helps the Trade out! Should give you guys a window of opportunity to recover.] \n  &6[Amina] \n It might, it might not. No way of telling really... The Ishnir Trade has suffered a great deal today. Thankfully, with your help, the pain has been somewhat remedied.  \n A LOST CAUSE COMPLETE! SoftBreak  Awarded   Link   Amina's Axe Amina's_Axe wikilink and 28 Compressed Crystalline Shards! \n Post quest dialogue: Table  AlignDefault ColWidthDefault AlignDefault \n Amina AlignDefault \n  &6[Amina] \n Hello again [Player]. I bear some great news: Riaz successfully scouted out a prime location for our new outpost. Setting up has gone quite well. \n  &5[That's good to hear! Say... Mind if I check it out?] \n  &6[Amina] \n I don't see why not! You've helped us a great deal. The entrance is quite hidden, but it lies in the stretch of desert between the Terracotta Mining Town and the Lost Sands City. I hope to see you there soon.  ", "reward": "rewards =\n* &3Amina's Axe&r\n* 28 Compressed Crystalline Shards\n"}