{"name": "A Merchant's Woe", "information": "prerequisites = None\n NPC: Riaz Coords: -98, 154, 459\n Celsian Isles Rahkeri\n", "dialogue": "}} \n&o  Talk to Riaz's supplier to see where his goods are. Table  AlignDefault ColWidthDefault AlignDefault \n Riaz \n  Coordinates: [-98, 154, 459] \n   &6[Riaz] \n Oh dear me.... I still haven't received my supply package yet! It's been days! \n  &5[Hello! Is there anything I can do to help?] \n  color|gray|The man seems quite worried...}} \n  &6[Riaz] \n Why yes! Say... Could you check on my supplier? He has probably arrived and is at a small, spruce outpost overlooking the canyon by now. Ask him if he has my goods!  \n  &5[Actually, there's something that came up...]  \n  &6[Riaz] \n Oh darn it. Well, I guess I'll have to wait on him then. \n  &5[Sure, I'd be happy to help!] \n  &6[Riaz] \n Fantastic! Be sure to bring the goods back to me!  \n&o  C: Go check on Riaz's supplier at the outpost. You can not get to it from   Link   Cinder's Roost Cinder's_Roost wikilink directly, but the entrance is in the valley below it. Table  AlignDefault ColWidthDefault AlignDefault \n Supplier Anebos \n  Coordinates: For house: [116, 79, 639] For Npc: [127, 77, 632] \n   color|gray|The man seems to be very stressed... He looks like the right guy!}} \n  &5[Hello? Are you Riaz's supplier?] \n  &6[Supplier Anebos] \n Oh no! Has he found out already? I'm in so much trouble! \n  &5[Why? What happened?] \n  &6[Supplier Anebos] \n Well, you see, I've... lost the goods that I was supposed to have delivered to him a couple days ago! \n  &5[Any idea where you lost them?] \n  &6[Supplier Anebos] \n Perhaps in Rockspider Cavern? My cart felt a lot lighter after I left there... \n  &5[Alright. Thank you for your help!] \n  &6[Supplier Anebos] \n I hope you find them!  \n&o  C: [1/2]: Retrieve the supplies from   Link   Rockspider Cavern Rockspider_Cavern wikilink  . \n&o  C: [2/2]: Once you have the supplies return to Riaz. Table  AlignDefault ColWidthDefault AlignDefault \n Riaz AlignDefault \n  &6[Riaz] \n By Ishnir! You did it! You've retrieved them! \n  &5[All in a days work!] \n  &6[Riaz] \n Thank you so much! Now I'll be able to run my business again! Here, take this as a thank you from me. \n  &6[Riaz] \n What did you say your name was? [Player]? Thank you again- you're welcome here anytime!   AlignDefault \n  color|teal|'''A MERCHANT'S WOE COMPLETE!''' \n  color|teal|Awarded [[Merchant's Curio]] and 10 Compressed Crystalline Shards!  ", "reward": "rewards =\n* &3Merchant's Curio&r\n* 10 Compressed Crystalline Shards\n"}