{"name": "A Pigculiar Problem", "information": "prerequisites = None King's Valleytown = Sierhavenstarting_npc_coordinates = -770, 107, 125rewards = Levyn Bacon Maskstarting_npc_coordinates = -770, 107, 125rewards = Levyn Bacon Mask King's Valleytown = Sierhavenstarting_npc_coordinates = -770, 107, 125rewards = Levyn Bacon Masktown = Sierhavenstarting_npc_coordinates = -770, 107, 125rewards = Levyn Bacon Mask", "dialogue": "&o  Talk to Walter Jr. a few times until a different dialog pops up SoftBreak   WorkInProgress Table\n Walter Jr. SoftBreak  Coordinates: -770, 107, 125\n  Color|orange|[Walter Jr.]\n Now look here, hitting such a valuable test subject is quite rude, I say!\n  Color|purple|[Oh my goodness! A talking pig!]\n  Color|orange|[Walter Jr.]\n Uh... Oink?\n  Color|purple|[Stop that! I heard you talk. How are you doing that?!]\n  Color|purple|[Oh, thank goodness. I thought I was crazy.]\n  Color|orange|[Walter Jr.]\n This is what I get for showing off... fine... I'll tell you!\n  Color|purple|[Yay!]\n  Color|orange|[Walter Jr.]\n If you do me a favor!\n  Color|purple|[Oh... Okay.]\n  Color|purple|[Hmph. Not now.]\n  Color|orange|[Walter Jr.]\n Now, for your task. In this very valley is a wondrous place called Crescent Isle, where Pigkind lavish in beauty and luxury.\n  Color|purple|[That sounds majestic.]\n  Color|purple|[I don't believe that.]\n  Color|orange|[Walter Jr.]\n It truly is! I want you to go there and speak to Percy. He's the massage therapist there. He's got a special potion I want.\n  Color|purple|[Sounds easy enough.]\n  Color|orange|[Walter Jr.]\n You would think, but he likes to hide away at the top of the tower. The Isle is all the way west, across the ocean. Go sail!\nImage  width 297 height 297  2020-02-29_15.27.43.png 2020-02-29_15.27.43.png fig:2020-02-29_15.27.43.png\n&o  Go to the tower in the ocean (-1380, 91, 190) and talk to Percy. Header section Table\n Percy SoftBreak  Coordinates:   &o  -1380, 91, 190\n  Color|Orange|[Percy]\n Oink?\n  Color|Purple|[You're Percy, right? I've been sent by Walter Jr. to find you.]\n  Color|Orange|[Percy]\n Oh? You of humankind know of Walter Jr.? How is that fine chap?\n  Color|Purple|[AH! A talking pig again!]\n  Color|Orange|[Percy]\n ...You spoke to me in your tongue first, good sir. Now what can I do for thee?\n  Color|purple|[I'm sorry. I'm still not used to this... He sent me to ask about a potion?]\n  Color|purple|[YOU'RE A TALKING PIG!]\n  Color|Orange|[Percy]\n Ah yes. The Pig Potion of Porcine Perfection and Peculiarity. I'm afraid I've not got it any longer.\n  Color|purple|[WHAT?!]\n  Color|purple|[Uhhhhh... huh?]\n  Color|Orange|[Percy]\n What are you shouting for, chap? This is a place of sanctity!\n  Color|purple|[I went through all that trouble swimming and/or boating here and you've not even got the potion?]\n  Color|Orange|[Percy]\n I'm afraid not. I've shipped it to the capital, Sierhaven. It should be in the basement of the Workshop. It's where all new\narrivals go! Just find the little trapdoor and head down it.\n  Color|purple|[Then what?]\n  Color|Orange|[Percy]\n I'm sure my agent, Peppa, will happily give it to you!\nImage  width 302 height 302  2020-02-29_15.44.40.png 2020-02-29_15.44.40.png 2020-02-29_15.44.40.png &o  Go to the workshop in\nLink   Sierhaven Sierhaven wikilink (-725, 106, 16) and press the button on the work stations to access the basement. Once\ninside, grab a Beetroot (Beetroot is on a chest near 341 ,176, 570) and guide the pig to the other set of doors. Once you get\nthe potion in the chest, head back to Walter Jr. to finish the quest. Header section_1 Table\n Walter Jr. SoftBreak  Coordinates: -770, 107, 125\n  Color|orange|[Walter Jr.]\n You got it! You got the potion! Amazing! May I have it?\n  Color|purple|[Of course.]\n  Color|purple|[Never! It's mine!]\n  Color|purple|[OH GOD, A TALKING PIG!]\n  Color|orange|[Walter Jr.]\n I appreciate your time so much. Now let me share the secret I have promised you... how pigkind can speak!\n  Color|purple|[I can't wait!]\n  Color|orange|[Walter Jr.]\n Are you truly prepared to know this mighty secret?\n  Color|purple|[I am!]\n  Color|purple|[Give me a moment to brace myself.]\n  Color|purple|[I might need to sit down. Hold tight.]\n  Color|orange|[Walter Jr.]\n Are you truly sure? You may want to take a seat or something.\n  Color|purple|[No, I am ready.]\n  Color|purple|[You might be right. Let me take a seat.]\n  Color|orange|[Walter Jr.]\n Excellent. So, the secret as to why Pigkind can speak is...\n  Color|purple|[Spit it out!]\n  Color|orange|[Walter Jr.]\n Well, it's all because of Mawrmoch.\n  Color|purple|[Who?]\n  Color|orange|[Walter Jr.]\n He was a member of the Mage Council! He really liked animals, see, and decided one day to try and make his pet pig, Levyn\nBacon, talk.\n  Color|purple|[Then what?]\n  Color|purple|[Levyn Bacon?]\n  Color|orange|[Walter Jr.]\n Well, Levyn Bacon was able to talk after the spell resolved. But so could all other pigs. Mawrmoch really porked up.\n  Color|purple|[I can tell!]\n  Color|orange|[Walter Jr.]\n Thankfully you've brought me this potion. At last, I can be rid of this awful sentience. I've had my fun, but I feel so...\nresponsible... as a talking pig. I just want to go back to the old days, before this mess.\n  Color|purple|[Wait, what?]\n  Color|purple|[What happened to Mawrmoch?]\n  Color|orange|[Walter Jr.]\n Percy has been seeking a way back to normalcy for Pigkind. This is the solution. I am ready to return. Thank you for your help,\n___. Let me reward you for your help before I return to who I once was...\n  Color|purple|[If you must.]\n  Color|purple|[Ooh, rewards!]\n  Color|orange|[Walter Jr.]\n Thank you again. I offer you my commemorative mask of Levyn Bacon for your help.\n&o  A PIGCULIAR PROBLEM COMPLETE! Awarded   Link   Levyn Bacon Mask Levyn_Bacon_Mask wikilink Header tips  Tips  Plain\nPigculiar Problem does not show up in the quest list when talking to a town guide. However if you speak with Walter Jr. once, it\nwill show up. Plain  You can get another Levyn Bacon Mask for free by speaking to Walter Jr. again after completing the quest.\n", "reward": "rewards = Levyn Bacon Mask|starting_npc_name = Walter Jr. \n&o  Talk to Walter Jr. a few times until a different dialog pops up SoftBreak  mediawiki {{WorkInProgress"}