{"name": "A Study in Crimson Part Two", "information": "prerequisites = * &3A Study in Crimson Part One&r\n* &3Outer Demons&r\n* Completion of &3Forsworn Sanctum&r\n* Completion of King's Valley Monument\n* &3Kaul&r\n NPC: Jeremiah in the Memory Vault Coords: -917, 91, -161\n King's Valley Sierhaven\nDifficulty = Hard\nLength = very Long\n", "dialogue": "&o  Continue your journey with the Crimson King Header start_of_quest  Start of Quest Table\n Jeremiah\n  Coordinates: [-917, 91, -161]\n   &6[Jeremiah]\n You're back! What c-can I do for you?\n  &5[Jeremiah, surely it's been enough time?]\n  &6[Jeremiah]\n He moves. Something is changi-\n  &5[Jeremiah?]  Header subquest_a_study_in_home  SUBQUEST: A STUDY IN HOME Table\n The Crimson King\n  &6[The Crimson King]\n  &5[The demon summoner?!]\n  &6[The Crimson King]\n&o  C: Interact with Azacor's Effigy.\n  &6[Helring]\n Farewell Aesir... Your sacrifice will not be in vain.\n  &6[Aesir]\n Evil... dies...\n  &6[The Crimson King]\n  &6[Aesir]\n Who are... you? Another of the summoner's tricks?\n  &6[The Crimson King]\n  &6[Aesir]\n I... You really know what I seek?\n  &6[The Crimson King]\n  &6[Aesir]\n You... know of the Tree? Can you tell me what it offers?\n  &6[The Crimson King]\n  &6[Aesir]\n I... I shall... I accept your deal... Table\n The Crimson King\n  &6[The Crimson King]\n  &5[You know my name, demon?]\n  &6[The Crimson King]\n  &5[Yet you feel so familiar. The Veil flows through you.]\n  &6[The Crimson King]\n  &5[To the Monument? None have been there within my lifetime.]\n  &6[The Crimson King]\n  &5[What will you offer me?]\n  &6[The Crimson King]\n  &5[I have no eternity left. Lightbringer pierces my heart. I am dying.]\n  &6[The Crimson King]\n  &5[...You are right. That is not a choice. I a ccept. My kingdom for passage through the Veil. You make a good bargain,\ncreature.]\n  &6[The Crimson King]\n  &5[The summoning is complete. The Veil will tear. Enter and find your journey easy.]\n  &6[The Crimson King]\n&o  C: Speak to the Crimson King to begin the battle. Table\n The Crimson King\n  &6[The Crimson King]\n  &5[Why did you let Azacor remain, instead of taking him as you have the others?]\n  &6[The Crimson King]\n  &5[What do I need to know for this battle?]\n  &6[The Crimson King]\n  &5[I am.]\n  You need to kill the first 3 quickly and then use Zirin'kel's levitation arrows to climb up. Or you can use recoil bows from\nR2. Keep going either way till you reach the top layer of glass then go up the stairs.\n &o  Escape the Veil. Table\n The Crimson King\n  &6[The Crimson King]\n  &5[What was the alignment?]\n  &6[The Crimson King]\n Link   Puzzle Solutions Guide/A Study in Crimson Part 2 Puzzle_Solutions_Guide/A_Study_in_Crimson_Part_2 wikilink\n &o  Speak to the Crimson King. Table\n The Crimson King\n  &6[The Crimson King]\n  &5[You damaged reality to come here?]\n  &6[The Crimson King]\n  &5[Why at all? The Monument was just beyond Highwatch the whole time.]\n  &6[The Crimson King]\n  &5[The Pedestal.]\n  &6[The Crimson King]\n  &5[What does it do, really? I've used them for the other Wool I've found, but nobody seems quite sure why they're here.]\n  &6[The Crimson King]\n  &5[So what happened next?]\n  &6[The Crimson King]\n  &5[What is so special about me?]\n  &6[The Crimson King]\n  &5[Why didn't I?]\n  &6[The Crimson King]\n  &5[What more is there to show me here?]\n  &6[The Crimson King]\n&o  Speak to the Crimson King. Table\n The Crimson King\n  &6[The Crimson King]\n  &5[Do we?]\n  &6[The Crimson King]\n  &5[Clearly. We hadn't last time either, before you fled. Now we're playing games and fighting battles you already won.]\n  &6[The Crimson King]\n  &5[I'm not sure we can do that. He's sleeping, and waking him up isn't exactly safe either. I've tried. C'Axtal, his\nSoulspeaker, is dead, and the new one isn't ready yet.]\n  &6[The Crimson King]\n  &5[C'Shura? Shockingly, no. She's alive and is in Ta'Eldim now.]\n  &6[The Crimson King]\n  &5[I feel like she'll be as hard to convince as Zanil.]\n  &6[The Crimson King]\n    Header subquest_a_study_in_memories  SUBQUEST : A STUDY IN MEMORIES\n&o  C: [1/2]: Leave the Memory Vault.\n&o  C: [2/2]: Travel to Ta'Eldim.\n After reaching Ta'Eldim:\n&o  C: Enter C'Shura's Shrine.\n In C'Shura's Shrine:\n&o  C: Speak to C'Shura. Table\n C'Shura\n  &6[C'Shura]\n This world has changed greatly in my absence.\n  &5[I need to ask you something important.]\n  &6[C'Shura]\n Ask then.\n  &5[During your time as a Shaman, did you ever share visions with Kaul?]\n  &6[C'Shura]\n I did. Why do you need to know this?\n  &5[I'm searching for an answer I'm not sure anyone else living knows.]\n  &6[C'Shura]\n Who is seeking this knowledge other than you?\n  &5[...Oh, A friend.]\n  &6[C'Shura]\n ...The wool should not be asking questions of you, [Player]. You should not be following their requests. C'Zanil did. It broke\nhim.\n  &5[It's not like that.]\n  &6[C'Shura]\n Of course it's not. It never is. I feel the energy on you. The shape, following you... Did... Did you free one of them? I am\nnot comfortable continuing this line of conversation.\n  &5[Wait, C'Shura, I didn't free anything. I'm trying to put something back into a wool.]\n  &6[C'Shura]\n Are you now? Is that what it told you? You would not have that power alone, friend.\n  &5[I've seen what he's seen. It's real. He's not trying to hurt anyone.]\n  &6[C'Shura]\n Which wool do you refer to? Is it Myrahg? It never did mean any harm...\n  &5[Crimson.]\n  &6[C'Shura]\n ...\n  &6[C'Shura]\n How?\n  &5[What do you mean?]\n  &6[C'Shura]\n How did it break? The traitorous one, father of the Sons of the Forest, Telsket, took my sister, Shuli, from me. He claimed he\nwas a Shaman. He claimed he would find a beautiful Crimson. It was all fantasy.\n  &5[It wasn't. I've seen what C'Telsket did. He found the Wool and attacked Farr with it, but it broke during the attack.]\n  &6[C'Shura]\n And now the being from the wool has come to you. You think you can trust it. I'm sure it whispers in your ear still... Is it\nhere? The spirit?\n  &5[No. He's waiting back in Sierhaven.]\n  &6[C'Shura]\n Take me with you. We can try to destroy it together.\n  &6[Jeremiah]\n Enough! The Crimson King has been listening through me quietly, but he cannot take it any more. I must speak. C'Shura, [Player]\nspeaks the truth. I hold within me the creature freed from the Crimson Wool. I voluntarily serve as his conduit and speak his\nwords by choice. He wishes to tell you: \"I was placed within wool for my sins and I wish only to return to my prison from which\nI was freed by force. I offer no harm to this world.\"\n  &6[C'Shura]\n Creature, you have no right to enter the halls of Memory. Be. Thee. Gone.\n  &6[Jeremiah]\n No right? From where do you think these halls were born? His power echoes through your people's history! These halls are like\nhome to him!\n  &6[C'Shura]\n There is no truth in which you know the old ways, creature. Speak to me directly or not at all!\n  &6[The Crimson King]\n  &6[C'Shura]\n You... you have no right. This place is protected... You cannot BE here.\n  &6[The Crimson King]\n  &5[What are you doing?]\n  &6[The Crimson King]\n  &6[C'Shura]\n Ahhhhh!\n  &6[The Crimson King]\n  &6[C'Shura]\n I have seen them... In the\n  &5[STOP! This isn't okay. If this doesn't stop, now, I'm leaving. I don't owe you anything anymore, and you will not use other\npeople like this.]\n  &6[The Crimson King]\n  &6[C'Shura]\n   Oh... the weight. It is gone... No. I cannot let you see... I will succumb anew to his... madness... I will tell you the\nwords he spoke. Just leave my mind... alone. Never again.\n  &5[Never again.]\n  &6[C'Shura]\n \"Beings formed with vibrant colors once roamed this land. With them came power. In their wake came destruction. These beings\nroamed the world and the world was brought to its knees...\"\n  &6[C'Shura]\n \"Eyes fell upon the world and the beings that threatened to end it. Soon, soldiers in shining silver armor emerged, charging\ninto the fray to match the power of these beings. One by one the beings fell, trapped in prisons matching their being. You know\nthem as wool.\"\n  &6[C'Shura]\n \"Deep in Kaulslund, a temple was constructed. The Knights stood guard over the wool. In time, many were called away and many\nmore were destroyed, until there was just one left. A lone guardian, slumbering in the darkness.\"\n  &5[Where is the temple?]\n  &6[C'Shura]\n I don't know. Time has left that knowledge to rot. Zanil is dead. He knew the truth.\n  &5[What if you could speak to him?]\n  &6[C'Shura]\n I cannot speak to him. He is dead.\n  &5[C'Zanil made a deal with the Crimson King. You can talk to him. Convince him to show us what he knows.]\n  &6[C'Shura]\n ...That is disgusting. First you break into my mind, now you offer to puppet the corpse of the disgraced?\n  &6[The Crimson King]\n  &6[C'Shura]\n So this is why you have come to me. This is why you threaten me in my own shrine.\n  &5[If you can't help us, Zanil might be our last chance, and he won't talk. He doesn't trust the Crimson King.]\n  &6[C'Shura]\n Clearly Zanil has reason not to trust you. I never want to have my mind violated like this again. But... perhaps Zanil does\nstill trust me, like I trusted him with Ixume before I left. Fine. Let me see him, so long as you swear by your life that\nthis... friend of yours will be locked away again.\n  &5[I swear it. Take us there please.]\n  &6[The Crimson King]\n&o  C: Speak to Zanil. Table\n Zanil\n  &6[Zanil]\n I see you've returned with a frien- C'Shura?!\n  &5[Hello again, Zanil.]\n  &6[Zanil]\n How are you here? I thought you were dead in the capital.\n  &6[C'Shura]\n You fool. You ignored me. You destroyed our people. You slaughtered thousands and destroyed your very future. Before I came\nhere I told myself I wouldn't grow angry with you. I was wrong. I am furious, Zanil. You did not listen to me and listened to\nthe whispers of cruel gods instead. How dare you.\n  &6[Zanil]\n How dare I? You gave me Ixume. I did what felt right! I did what had to be done to keep our people alive, while you vanished\ninto the same corruption that took C'Axtal. It was your war, and I was left alone to lose it.\n  &6[C'Shura]\n You fell for their whispers. Sacrificing souls? Warping bodies? You did evil, Zanil.\n  &6[Zanil]\n I know. I know why I came here. I could never be disturbed again. Now leave me to suffer my destruction.\n  &5[We can not.]\n  &6[C'Shura]\n We will not.\n  &6[Zanil]\n You must and you will.\n  &5[You owe us answers Zanil. Where is the Knight?]\n  &6[Zanil]\n You've dragged C'Shura into your delusions? Right after she dares call me out for listening to the whispers of gods?! Do you\neven understand what I have done and what has been done to me?\n  &5[I know your story. I've followed your path.]\n  &6[Zanil]\n Do you? Truly? How the Elders tried to kill me? My exile was not their first choice.\n  &6[C'Shura]\n What?!\n  &6[Zanil]\n Let me show you...\n&o  C: Speak to R'Kitxet. Table\n R'Kitxet\n  &6[R'Kitxet]\n Your judgement has been decreed, Zanil. Your title has been stripped. Your wool has been taken.\n  &5[I accept your judgement, Elder.]\n  &6[R'Kitxet]\n Then it shall be delivered.\n  &5[Exile. I know what I deserve.]\n  &6[R'Kitxet]\n Nay, Zanil. Death. Stand forth, newly anointed, C'Tnet, and deliver the blow.\n  &6[C'Tnet]\n I will do as the Elders command.\n  &5[I... I cannot accept this, Elder. This is not the way.]\n  &6[R'Kitxet]\n Do you understand what you have done, Zanil? The pain you have caused? The deaths you have reveled in? The war you, and you\nalone, have now lost? This is us being merciful.\n  &5[No. I cannot. I have so many plans...]\n  &6[R'Kitxet]\n Goodbye, Zanil. Your name will forever be a stain upon our people. C'Tnet, if you will...\n After defeating C'Tnet:\n&o  C: Speak to Zanil. Table\n Zanil\n  &6[Zanil]\n Now you see. I slaughtered their champion. He was intended to replace me. In the chaos, covered in the blood of a Shaman only\ntrying to protect his people, I fled, my generals at my side. We escaped into a sealed off segment of my Halls and I was\ndetermined that would be my end, exiled.\n  &5[You're lucky.]\n  &6[Zanil]\n It was not luck. It was fate. Quetzalcoatl and Ixume granting my generals and I one last boon in departure. Or perhaps cursing\nme in my leaving.\n  &6[C'Shura]\n Enough stalling\n  &6[Zanil]\n Fine. For you and you alone. Now listen.\n  &6[Zanil]\n&o  Deep in Kaulslund, a temple was constructed. The Knights stood guard over the wool. In time, many were called away and many\nmore were destroyed, until there was just one left. A lone guardian, slumbering in the darkness. It was here that the Jungle saw\nan opportunity to protect. Kaul wove a powerful enhancement and cast it upon their temple, hiding it away. Even once that\nenchantment was destroyed, the lone guardian remained. He stood guard below the Monument, waiting for the day he would be needed\nonce more.\n  &5[The Monument? It's been there the entire time?]\n  &6[Zanil]\n Yes.\n  &5[The Crimson King took his wool pedestal from the Monument. He was so close, decades ago.]\n  &6[Zanil]\n He could not have entered. Kaul sealed the door so that it would only open when all the wools were contained. You might enter\nbelow where the wools might rest if somehow you have safely placed each wool.\n  &5[But how? Crimson is destroyed. The others have been placed there, but surely this is impossible.]\n  &6[Zanil]\n Perhaps not. Perhaps your whispering one may still be the key. Be warned. The way to the Slumbering Knight is perilous. Do not\nruin this.\n  &5[We won't.]\n  &6[Zanil]\n Now, leave me to my memories. Goodbye, Shaman. Goodbye woolbearer.\n&o  C: Speak to C'Shura. Table\n C'Shura\n  &6[C'Shura]\n So, you have what you need. Both of you. Remind your creature to release his hold on me, [Player].\n  &5[What do you mean? Has he not yet?]\n  &6[C'Shura]\n I still feel his attack rattling around my head. Little brushes of memory I should not have. I will echo what Zanil said. Do\nnot ruin this. Put the spirit back into his wool and end this. Do not let him stop you.\n  &5[I will. It's what we all want.]\n  &6[C'Shura]\n Now go. Return with your spirit and his thrall and plan your steps wisely. Goodbye.\n&o  C: Return to the Memory Vault.\n After returning to the Memory Vault:\n&o  C: Speak to the Crimson King. Header subquest_a_study_in_silver  SUBQUEST : A STUDY IN SILVER Table\n The Crimson King\n  &6[The Crimson King]\n  &5[First we need to discuss C'Shura.]\n  &6[The Crimson King]\n  &5[That's not what I mean. Why did you keep manipulating here still? We talked about this.]\n  &6[The Crimson King]\n  &5[We have your pedestal and we have you. Could you step onto it for real, outside of Jeremiah?]\n  &6[The Crimson King]\n  &5[What greater purpose is there to risk it all for?]\n  &6[The Crimson King]\n  &5[To you as well.]\n  &6[The Crimson King]\n&o  C: Leave the Memory Vault.\n&o  C: Travel to the King's Valley Monument and enter the hidden path. Table\n Jeremiah (Hidden Path)\n  &6[Jeremiah]\n Hello [Player]. The Crimson King is reaching out into my mind. He is delighted to hear this has worked, but he cannot step off\nthe Pedestal, as he feared, so long as this place is to remain open. You must approach the Silver Knight alone.\n  &5[I am prepared.]\n  &6[Jeremiah]\n Be safe, be prepared. I do not know what lies ahead in this maze. I hope we find all the King needs. This has been such a long\ntime coming.\n After making your way through the maze: Table\n Silver Knight?\n  &5[Hello? Are you... a Silver Knight?]\n  &6[The Crimson King]\n  &5[Yes, if you promise not to do what you did to C'Shura.]\n  &6[The Crimson King]\n  &5[I don't know how to say this... I think the Silver Knight is dead.]\n  &6[The Crimson King]\n  &5[I don't know. What do we do now?]\n  &6[The Crimson King]\n&o  C: [1/2]: Return to the Memory Vault and interact with the Silver Knight effigy.\n&o  C: [2/2]: Exit the Silver Knight's Sanctum.\n After interacting with the Silver Knight effigy:\n  Silver Knight?\n  &6[The Crimson King]\n  &5[We'll discover it. We'll dig through my memories if we have to. I want to know how I got to Kaul's Temple.]\n  &6[The Crimson King]\n  &5[Oh...]\n  &6[The Crimson King]\n  &5[Excuse me?]\n  &6[The Crimson King]\n", "reward": "rewards =\n* access to &3Ephemeral Corridors&r Endless Mode\n* 12 Twisted ands\n* &3Silver Knight's Failure&r\n"}