{"name": "A Well Deserved Rest", "information": "prerequisites = None\n NPC: Sam Ludvic Coords: -1599, 106, 1007\n Celsian Isles Frostgate\n", "dialogue": "}} \n  WorkInProgress|Missing a line of dialogue of asking Sam Ludvic to repeat.}} \n&o  Destroy Marshall Ludvic's coffee so he'll finally sleep. Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic \n  Coordinates: [-1599, 106, 1007] \n   &6[Sam Ludvic] \n Y'know, I thought it would be great when my husband got promoted. Marshall! One of the most important men in all of Chillwind! Except now he's never, ever, ever around.  \n  &5[I'm sure he's doing important work.]  \n  &6[Sam Ludvic] \n Heh, guess he got to you too. That could've come straight from his mouth, or from his squire over there. \n  &5[Anything I can do?] \n  &6[Sam Ludvic] \n I- Ma- Hmm... Well, lately it's all because of that darn coffee. I used to be able to deal with his work, but ever since he bought that barrel of it from the isles, he's been running around the city working non-stop. But, if we get rid of it...  \n  &5[I'm out. Never mess with a man's coffee!]  \n  &6[Sam Ludvic] \n Y'know, I'm disappointed, but I've got to respect that level of caring about a beverage. \n  &5[This seems like a bad idea.]  \n  &6[Sam Ludvic] \n I- Bu- Wh- Plain &o  He sighs. \n  &6[Sam Ludvic] \n Yeah, probably. Guess I'll just wait until four in the morning, when he finally comes back and stays for an hour... \n  &5[I'm in; sounds like you need the help.] \n  &6[Sam Ludvic] \n Y'know, I knew I could count on you. Let's start with the easy approach. You look soldiery- go see if his squire will let you into his office.  \n&o  C: See if Squire Tano will let you into the Marshall's office. Table  AlignDefault ColWidthDefault AlignDefault \n Squire Tano \n  Coordinates: [-1604, 106, 1016] \n   &6[Squire Tano] \n Sorry, I saw you talking to Sam over there. I know he misses the Marshall, but I still can't let either of you into his office.  \n&o  C: Talk to Sam to see what he needs for his plan to destroy the Marshall's coffee. Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic AlignDefault \n  &6[Sam Ludvic] \n Y'know, I saw that coming. Alright, easy plan didn't work, so on to the ridiculous plan. I need you to gather some materials: a Steel Woodcutter, a Trebuchet Stone from the city's defenses, and some gloop. You'll also probably want a sword, in case I can't think of a good enough distraction...  \n  &5[Is this plan going to end horribly?]  \n  &6[Sam Ludvic] \n Hmmm... Maybe. We'll figure that out once we try it! Go get those things- if we're lucky, we can get this done tonight! \n  &5[Can you repeat that?]  \n  &6[Sam Ludvic] \n (Missing) \n  &5[Steel Woodcutter?]  \n  &6[Sam Ludvic] \n Yep. It's a popular woodcutting axe around here; should be great for hacking a hole in the floor. Not sure any are for sale, but maybe a nearby cabin in the countryside will have one. \n  &5[Trebuchet Stone?]  \n  &6[Sam Ludvic] \n I mean, yeah: it rolls and it's heavy, and as long as it bounces, it'll work. Check with Bombardier Marty, maybe we'll get lucky and he'll just give you one. \n  &5[Gloop?]  \n  &6[Sam Ludvic] \n Y'know, gloop. A bouncy, slimy kind of thing. There's some cracks in the floor nearby, and, while we wouldn't be able to put a whole chunk of slime there, we could pour gloop into the cracks! Not sure I've ever heard of that anywhere in the Isles though- seems like it's more of a swampy kind of thing.  \n&o  C: [1/4] Sam needs a   Link   Steel Woodcutter Steel_Woodcutter wikilink for his plan. If you don't already have one, perhaps one is lying around somewhere. \n  Clear the local PoIs till you loot one from a chest. Or follow the compass to   Link   Smuggler's Cabin Smuggler's_Cabin wikilink  , it has a chest that will always have a Steel Woodcutter. \n &o  C: [2/4] Sam needs a Trebuchet Stone for his plan. Perhaps Bombardier Marty can give you one? \n  Talk to the Bombardier. Table  AlignDefault ColWidthDefault AlignDefault \n Bombardier Marty \n  Coordinates: [-1536, 94, 1023] \n   &6[Bombardier Marty] \n I may be in charge of this trebuchet, but I think we both know the rocks are more impressive. Mined and chiseled half of them myself; they're so smooth they'll fly like a bird! \n  &5[Can I have one?] \n  &6[Bombardier Marty] \n Wow, how bold! You must be a big rock fan yerself! Tell you what, bring me what my riddle describes and a rock's all yours. Deal? \n  &5[Deal] \n  &6[Bombardier Marty] \n Alright, here it is! \n&o Code  A tomb's one of these, then add an \"L\". LineBreak &o Code  You won't find it up high, 'cause it certainly fell. LineBreak Code  Bring me one of those and a boulder's all yours!  \n  A tomb's one of these - Grave. \n Add an \"L\" - Grave + L = Gravel. \n You won't find it up high, 'cause it certainly fell. - Gravel has gravity. \n The moat around Frostgate has gravel banks. \n  Bombardier Marty AlignDefault \n  &6[Bombardier Marty] \n Yep, that's the block! With a head that good on your shoulders, I know I can trust you with this.  \n &o  C: [3/4] Sam needs Gloop? That sounds familiar. Perhaps a boat trip is in order. \n  Gloop can be found in the R1 PoI   Link   Witch Village Witch_Village wikilink  . Gotten by killing a slime there. \n &o  C: [4/4] Once you have all three items bring them back to Sam Ludvic. Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic AlignDefault \n  &6[Sam Ludvic] \n Now that you've found everything so quickly, we're good to go! Let me know when you're ready, and then we'll enact my perfect plan. You, uh, came armed, right? \n  &5[I'm ready.] \n  &6[Sam Ludvic] \n Great! Follow me!  \n&o  C: Work with Sam to enact his ridiculous Scheme. Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic (Quest Area) AlignDefault \n  &6[Sam Ludvic] \n First up, let's pour the gloop here and... \n  &6[Sam Ludvic] \n Hah! Y'know, this is even bouncier than I expected! \n  &6[Sam Ludvic] \n Now that the gloop's been poured, head on upstairs. Things might get a bit messy now.  Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic (Upstairs Quest Area) AlignDefault \n  &6[Sam Ludvic] \n I- We- Alright, no easy way to say it. I'll hack a hole in the floor, and you hold off the guards. The city's healing aura should keep them alive no matter what, so they'll just get knocked out.  \n  &5[Isn't this treason or something?]  \n  &6[Sam Ludvic] \n Y'know, I never thought about it. Probably not though, and I'm sure they'll understand in the long run. \n  &5[Let's do this.] \n  &6[Sam Ludvic] \n Good luck!  \n After a short amount of time: \n  &6[Sam Ludvic] \n And here's our hole! Clear out those guards and we can finish this up! \n After clearing guards: Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic (Upstairs Quest Area) AlignDefault \n  &6[Sam Ludvic] \n Alright! Now, if I planned this right, I can roll the trebuchet stone down the hole, then it'll bounce off of the gloop, up into that hole near his office, roll across the shelf, and then fall off and crush the barrel. Ready? \n  &5[Yeah!] \n  &6[Sam Ludvic] \n Here it goes! \n  &6[Sam Ludvic] \n ... Y'know. That could've gone better.  \n  &6[Squire Tano] \n Okay, this is ridiculous. I'll let you into the office- just... just never do anything this ridiculous again. \n&o  C: Run into the Marshall's office and pour out his coffee. Table  AlignDefault ColWidthDefault AlignDefault \n Sam Ludvic (Upstairs Quest Area) AlignDefault \n  &6[Squire Tano] \n Glad this farce is over with. The Marshall will be furious about his table; at least he'll probably forget about the coffee. \n  &6[Sam Ludvic] \n Y'know, I really can't believe this all worked out. Well, except for the table. Anyway, thank you so, so much! Hopefully he'll be able to finally get some rest now. Here, this is the least I can do.  \n A WELL DESRVED REST COMPLETE!- \n Awarded   Link   Grindstone Grindstone wikilink and 32 Crystalline Shards! ", "reward": "rewards =\n* &3Grindstone&r\n* 32 Crystalline Shards\n"}