{"name": "A Wolf in Witch's Clothing", "information": "prerequisites = * &3Of Mushrooms and Magic&r\n* &3The Tomb of Time&r\n NPC: Primirium Conquort Coords: -311 181 -663\n Architect's Ring Galengarde\nDifficulty = Hard\nLength = Very long\n", "dialogue": "&o  Go inform the Aradia that the Dichen are ready to attack the Coven. Table\n Primirium Conquort\n  Coordinates: [-311 181 -663]\n   &6[Conquort]\n I feel I must offer you thanks for your work so far! Well done soldier!\n  &5[How are the attack preparations coming?]\n  &6[Conquort]\n It's a beautiful day today! The assault begins soon.\n  &5[It's time?]\n  &6[Conquort]\n It's time. Your task, should you choose to accept it, is to let Lytania and her Aradia troops know we are prepared and\ncoordinate a time for the attack to officially begin.\n  &5[That's it? No complex task? No spy network? No gifts? Just \"Let's go fight\"?]\n  &6[Conquort]\n Yes indeed, that's the spirit! Go! Get it done!\n  &5[I'm on it.]\n  &6[Conquort]\n There is glory waiting for us to earn it!\n&o  C: Go inform Lytania and the Aradia that the Dichen are ready to attack. Table\n Elder Lytania\n  &6[Elder Lytania]\n Hello again, [Player]. Don't forget to tell Verdanne - the time is right, and the hour of our Lady is almost upon us.\n  &5[I've gotten word from the Dichen. It's time.]\n  &6[Elder Lytania]\n Good. There's a few preparations we must still make before the attack can begin. There's also a few tasks you must execute once\nthe assault has begun should we have any hope of victory.\n  &5[What are they?]\n  &6[Elder Lytania]\n First, there's the matter of the Council. Molldyer, Laurey, Nalatia, and the Vedha will be facing our troops directly, of this\nI'm sure. This will give you an opportunity none have ever had before - to get into the personal covensteads and destroy their\nties to the Hex and the Tree of Life.\n  &5[Why do I need to do that?]\n  &6[Elder Lytania]\n Unless you can sever their connections to the Tree, they cannot be destroyed and Hycenea cannot be freed. Their connections are\nwhat keeps her chains intact.\n  &5[So how do I do that?]\n  &6[Elder Lytania]\n Inside the Tree of Life is the Coven's central village, Ravenna. If you speak to Jehenne inside, you'll find an ally. He will\nbe able to conjure forth the Tower of the Coven, which will offer you transport safely into the covensteads of the Council. Once\ninside though, you would be on your own.\n  &5[What exactly is a covenstead, Lytania?]\n  &6[Elder Lytania]\n Oh, I did not even consider your ignorance of the language here. A covenstead is a place where a coven has its greatest power.\nAs a large and diverse coven of many powers, instead the Coven has four covensteads, one for each branch of elemental power.\nMolldyer's is in the Jaguartooth Mountains of Kaulslund. Laurey's is resting on the crags of the Altaer Mesa. Nalatia's soars\nabove the earth near the lands of Galos. The Vedha's covenstead is suspended above the endless expanse of the Arunara Ocean.\n  &5[I see. So I'll be traveling around the world to destroy these bindings? How long will it take?]\n  &6[Elder Lytania]\n It's supposed to be difficult to find them all for an outsider. Outsiders don't tend to have friends in the Coven, I would\nimagine. There's no travel time for you, so long as we can keep the Coven distracted.\n  &5[So that's all? Will we be ready to start?]\n  &6[Elder Lytania]\n Oh no, there's something important we must do first. As you may well remember, Laurey, Molldyer, The Vedha, and Nalatia aren't\nthe only threats on the Council. There are eight more members, each an Adherent of one of the leaders. We need to handle them\nbefore the attack ends.\n  &5[Do I have to go assassinate them or something?]\n  &6[Elder Lytania]\n Oh stars no. We're about to handle them right now, in one fell swoop. I'm going to arrange a meeting with them so I can betray\nyou and the Dichen.\n  &5[Come again?]\n  &6[Elder Lytania]\n Not for real. But they know me. I've been with the Coven for far too long. If I have information, they'll come. And then you're\ngoing to help me trap us inside our meeting place.\n  &5[Trap... us? Like you and the Council members?]\n  &6[Elder Lytania]\n Exactly that, yes.\n  &5[...Won't they kill you?]\n  &6[Elder Lytania]\n I can handle myself.\n  &5[But -]\n  &6[Elder Lytania]\n No. We're doing this. I'll survive their wrath, I am certain. They need to be handled. This is how we can.\n  &5[...If you say so.]\n  &6[Elder Lytania]\n I do.\n  &5[So what do I have to do?]\n  &6[Elder Lytania]\n Once the spell begins casting, enter our minds and try to assert control of the magic. You have the power of the Aradia behind\nyou. Now, I will reach out and wait for a reply. It shouldn't take long...\n  Several hours pass. At last, a flurry of movement from the Aradia let you know something is happening.\n  &6[Elder Lytania]\n They're coming. Together we will leap into the fabric of magic. The Adherents will have defenders also patrolling the fabric of\nthe magic we cast. If you can defeat them, my Aradia can use their deaths to change the power flow to our side. If we can take\nover the entire sigil, then we can trap the Adherents inside long enough for this all to be successful.\n  &5[Got it.]\n  &6[Elder Lytania]\n I'll let them know it's time to meet, then. I hope you can pull this off. I look forward to gazing upon you with newly opened\neyes, if this all goes well.\n&o  C: Speak to Lytania when you are ready to battle the Coven Adherents, then use their magic to paint the Sigil red. Table\n Elder Lytania\n  &6[Elder Lytania]\n Welcome to the Voidgarden, a place deep within the threads of Magic itself. The Adherents are on their way now. Are you ready\nto trap them? You'll need to be ready for combat.\n  &5[I'm not, can I leave?]\n  &6[Elder Lytania]\n You can.\n  &5[I am.]\n  &6[Elder Lytania]\n Then I will summon them to enter the circle. Below us is another circle. As the Adherents summon their allies, you will defeat\nthem to transform the circle red. Once the entire circle is red, they will be trapped, while you will be sent back to Rowantree.\nShall we begin?\n  Invokers when killed will change nearby blue glass into red glass. LineBreak  Convokers when killed will change nearby red\nglass into blue glass. LineBreak\n  After painting the Sigil red:\n&o  C: It's time to begin the assault on the Tree of Life and the   Link   Coven Fortress Coven_Fortress wikilink  ! Travel to\nthe top and find a way to their Covensteads.\n Clear and beat the miniboss at the very top of   Link   Coven Fortress Coven_Fortress wikilink to reach   Link   Coven's Gambit\nCoven's_Gambit wikilink lobby.\n&o  C: Enter the Coven's Gambit.\n Talk to Jehenne and go through the dungeon.\n  &6[Jehenne]\n [Player]! Quickly, over here! It's time to get you inside Ravenna. I've got a key for you. Meet me inside. We have much to\ndiscuss.\n After beating the dungeon:\n&o  C: Return to the Primirium with the Favor of the Wolf!\n After entering the Primirium room:\n&o  C: Speak to the Primirium. Table\n Primirium Tybale\n  &6[Conquort]\n It's over! The Coven is surrendering to the Aradia! [Player], you're a marvel! Not that our troops weren't impeccable of\ncourse, the battle was truly one for the ages.\n  &5[I can't believe we all did it. The Aradia did so much as well.]\n  &6[Conquort]\n Yeah sure, they did great. Victory and glory are ours!\n  &6[Verdanne]\n I sense power on you. If that isn't the Favor of the Wolf, I need you to know you'd be in violation of Clause 18.06b of\nGalengarde's powered magic and weapons laws.\n  &5[Luckily, it is. I've claimed the Blue Wool.]\n  A knock rings out at the threshold of the council room.\n  &6[Conquort]\n Not now! We're in a meeting!\n  &6[Calder]\n There is no better time than now, Conquort.\n  &6[Conquort]\n Sir Maxwell? Why are you here now?\n  &6[Calder]\n I have business with [Player].\n  &5[...Calder?! How are you here?]\n  &6[Calder]\n Don't even think about moving. I've been here for months while you chased down the spirit inside the Teal Wool. Thank you for\ncleaning up that mess, by the way. It sounds like you did some excellent work there.\n  &5[Not that you helped.]\n  &6[Calder]\n Of course not. I had more important work to prepare for. I've been visiting the lovely people of the Architect's Ring. The\nDichen, the Coven, the Ashkii. There's so much to do here, yet somehow, like a bloodhound, you went right to the Wool again.\nEnough is enough. I can't let you continue to scoop them up. I don't get why you think they're the real goal.\n  &5[You couldn't stop me if you tried.]\n  &6[Calder]\n Of course I can. What do you think I'm doing right now?\n  &6[Conquort]\n Leaving our chambe-\n  &6[Calder]\n Silence, pawn. No more speaking. Give me the Blue Wool. I have work to do and little time to waste on your high and mighty\nattitude. Let me find a way to destroy these hideous mistakes, this time without unleashing a blight on the land.\n  &5[No. You don't have a plan. You didn't last time either. You're just going to cause more deaths.]\n  &6[Calder]\n Okay then. I didn't think you'd work with me, but I wanted to give you one more chance. My Masked are already here in the Ring\nand we will continue to expand our influence. The Primarium here were even kind enough to give us a place to stay. Not that they\nknew who I am, but still. So open and welcoming. I appreciate it. Now, back to the issue at hand. I am going to take the wool\nand leave. If you do anything to try and stop me, I'll kill the Primirium. Conquort first.\n  &6[Calder]\n Then Tybale.\n  &6[Calder]\n Then Verdanne. Understood?\n  &5[...No.]\n  &6[Calder]\n Fine. You made me do this. Conquort. You always were obnoxious. Goodbye.\n  &6[Conquort]\n What no-AHHHHH!\n  &6[Calder]\n Now, I said, bring it here! Or I will continue to kill until it's just you left, [Player].\n  &6[Calder]\n You don't have a choice now. I'll be taking that. Thank you. I'll be seeing you around, [Player]. Perhaps if this experiment\nworks, you'll reconsider your position on joining me.\n  &6[Tybale]\n CONQUORT?! NO! That man lied to us, Verdanne. He's no knight! He's a murderer!\n  &5[That was Maxwell Calder, a violent mage with the power of the Black Wool.]\n  &6[Verdanne]\n I'm gathering that now... This is an emergency.\n  &6[Tybale]\n I don't know what to do... Why would he do that? Why would he even need the Favor of the Wolf?!\n  &6[Verdanne]\n Power, Tybale. It's always about... power. We must honor Conquort's legacy. We cannot let his death be in vain. Clearly\n[Player] has experience dealing with that man... We must give him all the support we can. Calder must pay.\n  &5[I have quite a bit of experience with him. With your support and my team, we'll get the wool back. Where are they holed up,\nVerdanne?]\n  &6[Verdanne]\n We tasked him to clear out the Shadowcast Bastille and he never came back. Clearly he did as asked and set up there.\n  &5[I'll need to prepare, but that seems like the next step then.]\n  &6[Tybale]\n Indeed. Make him pay, [Player].\n  &6[Tybale]\n Before you go... Thank you. We'd like to offer you a reward for your help, and to prepare you for the future conflict ahead.\n  &6[Verdanne]\n I'm not sure the Aradia are going to be happy that the Favor of the Wolf is gone either. Perhaps they can spare some forces to\nhelp on the attack against Calder as well. But yes, some items to help you. We need all the help we can get...\n  &5[Thank you.]\n  A WITCH IN WOLF'S CLOTHING COMPLETE...\n  Awarded a Hycenea's Vinelash, 2 Hyperchromatic Archos Rings, access to Coven's Gambit delves, and... the remaining 2722 Archos\nRings of your debt removed!\n", "reward": "rewards =\n* &3Hycenea's Vinelash&r\n* 2 Hyperchromatic Archos Rings\n* access to Coven's Gambit delves\n"}