{"name": "An Unlikely Partnership", "information": "prerequisites = &3Vault of Glass&r\n&3The Foreign Soldier&r NPC: Tiffy Celsian Islestown = Mistportstarting_npc_coordinates = -817, 81, 1326starting_npc_coordinates = -817, 81, 1326 Celsian Islestown = Mistportstarting_npc_coordinates = -817, 81, 1326town = Mistportstarting_npc_coordinates = -817, 81, 1326", "dialogue": " Table\n Tiffy\n  Color|orange|[Tiffy]\n I have been waiting for you,      Color|purple|[Do I know you?]\n  Color|orange|[Tiffy]\n If you did, I might have reason to worry. I am here on behalf of the Glass. We have come across some intel that you need to\nknow, but it is too sensitive to discuss here. Pirates have such bad manners at times.\n  Color|purple|[Where do I need to go?]\n  Color|orange|[Tiffy]\n I have prepared a teleport there, just let me finish this cuppa first. Talk to me when you are ready to go.\n&o  Talk to Tiffy to go to the Glass Meeting. Try to act presentable and stay put when asked to. Table\n Tiffy\n  Color|orange|[Tiffy]\n Ah, always feel better after a good cuppa. Are you ready to go the the meeting?\n  Color|purple|[Yes, I am.]\n  Color|orange|[Tiffy]\n Please make sure to listen to them carefully, our safety is at stake.\n  Color|orange|[Duchess Emmeline]\n Ah,      Color|orange|[Octavius]\n Why do I have to sit across from them? We have a huge table.\n  Color|orange|[Duchess Emmeline]\n Are you questioning my judgement in front of our guest?\n  Color|orange|[Octavius]\n N... No, I would never.\n  Color|orange|[Duchess Emmeline]\n That is good to hear. To your seat,      Color|orange|[Duchess Emmeline]\n Come now, don't be a stranger, help yourself to some tea.\n  Color|purple|[I take it that you're with the Glass?]\n  Color|orange|[Duchess Emmeline]\n Oh dear, did they actually go with that one? I told them you wouldn't be foolish enough to think that a spy would risk\nrevealing themselves, but I guess I was mistaken. That being said, I am a bit disappointed you don't remember me.\n  Color|purple|[What do you want with me? Why am I here?]\n  Color|orange|[Duchess Emmeline]\n I merely wished to meet with the new leader of Mistport and ensure that our business agreements will continue moving forward.\nI'm sure you would have made an appointment to see me eventually, but I am very busy, so I decided to set up the meeting myself.\n  Color|orange|[Octavius]\n You can't trust anything that adventurer says. They complicated our business in the valley and sent Murano after me. They will\njust end up betraying you!\n  Color|orange|[Duchess Emmeline]\n Remind me again, Octavius... Who is in charge here?\n  Color|orange|[Octavius]\n Y-you, but it is far too risky. We should just kill them now.\n  Color|orange|[Duchess Emmeline]\n Hush, drink your tea, everything will be alright.\n  Color|orange|[Octavius]\n Okay, if you say so... GAHHK\n  Color|orange|[Duchess Emmeline]\n He'll live. Although, tongues and that toxin don't mix well. With any mercy, we'll never have to hear his blathering again.\nWhere were we again? Oh right, our continuing partnership.\n  Color|purple|[A partnership? I'm listening.]\n  Color|orange|[Duchess Emmeline]\n I'm glad you understand the value of your position. You seem much easier to work with than Xeno was. I should have gotten rid\nof him instead of waiting for him to get himself killed.\n  Color|orange|[Duchess Emmeline]\n To get to the point. I have scheduled a meeting between you and the diplomats of Chillwind and Ishnir. You can thank me for\nadvancing your cities relations with the kingdoms by spying on them for me. I don't want much, just a few pieces of blackmail\nthat I can use against them later.\n  Color|purple|[Wouldn't they know who leaked the information?]\n  Color|orange|[Duchess Emmeline]\n Perhaps, but what are they going to do about it? Blackmail has a way of keeping people quiet for quite a while, and they are\neasy enough to dispose of if it stops being effective.\n  Color|orange|[Duchess Emmeline]\n The diplomats are already on their way, so I would advise getting ready to meet with them. You need to get your city in order,\nfirst impressions and all that. I expect results and can't guarantee your city will be happy should you fail.\n  Color|purple|[I assume that is a threat?]\n  Color|orange|[Duchess Emmeline]\n Not at all, it is more common sense. Many of your citizens are fans of mine. I can't guarantee that they wouldn't react\nviolently, or try to assassinate someone you care about. Trust me, if I was threatening you, it would be far more obvious. I\nwant to build a good working relationship with you, and that requires you not being randomly murdered.\n  Color|orange|[Duchess Emmeline]\n Salieri, please see our guest out when they are ready to depart.\n&o  Speak to Salieri. He will give you something and help you leave. Table\n Salieri\n  Color|orange|[Salieri]\n I will try to keep this short. You are too charismatic to be a spy on your own. So I was told to give you a communication\ndevice. With it, you will be able to both detect and listen into conversations. My employer would rather you keep our\ninvolvement a secret. Is that understood?\n  Color|purple|[I understand.]\n  Color|orange|[Salieri]\n Good, here is the device.\n  Color|orange|[Salieri]\n I assume you know what needs to be done. When you get back to Mistport, talk to the person that brought you here. Are you ready\nto go?\n  Color|purple|[I'm ready to leave.]\n  Color|orange|[Salieri]\n Very well. Let me give you a one way trip back to that \"agent\".\n  Color|red|You wake up near Tiffy with a horrible headache. Salieri technically did what he said he would.\n  Color|orange|[Tiffy]\n Oh, you are still alive. I’m glad, but I’m probably in a lot of trouble now.\n  Color|purple|[It isn’t smart to lie to the person in charge of a pirate city.]\n  Color|purple|[Diplomats are on their way, we have to get ready.]\n  Color|orange|[Tiffy]\n The Duchess was going to kill me, as well as my family, I figured you would get bored after killing me if she let you live.\n  Color|purple|[I don’t have time for this, we have to get the city ready.]\n  Color|orange|[Tiffy]\n You should probably speak to the Captain, I think her name is Indigo? She should be able to help coordinate everything. I'll\ntry to help, but I probably won’t be trusted much, after what I did.\n&o  Speak to Indigo about the current situation with the diplomats. Table\n Captain Indigo\n  Color|orange|[Captain Indigo]\n Hello there Captain      Color|purple|[We have a situation.]\n  Color|orange|[Captain Indigo]\n A situation? What is it this time?\n  Color|purple|[Diplomats from the two kingdoms are on their way.]\n  Color|orange|[Captain Indigo]\n Why would they come here on such short notice, or here at all? Security is going to be needed to keep them safe, and we have no\nfood, decorations, or housing ready. Can we tell them to wait?\n  Color|purple|[The Duchess invited them on our behalf.]\n  Color|orange|[Captain Indigo]\n The Duchess?\n  Color|purple|[Yes the Duc...]\n  Color|gray|The communications device spontaneously starts to heat up\n  Color|purple|[...Never mind, we can't hold them off.]\n  Color|orange|[Captain Indigo]\n You really do have odd associates, Captain      Color|orange|[Captain Indigo]\n Alright, I'll take care of it. Just speak to me when you're ready to proceed\n&o  1/2 - Tell Indigo that you are ready to proceed.\n&o  2/2 - Once the diplomats arrive speak to either one of them. Table\n Captain Indigo\n  Color|orange|[Captain Indigo]\n Are you ready to go greet our guests?\n  Color|purple|[I am ready.]\n  Color|orange|[Captain Indigo]\n We barely had enough time to make things presentable. Hopefully it is good enough. The diplomats should be here shortly.\n  Color|orange|[Captain Indigo]\n Sounds like they’re here, it’s showtime, Captain      Color|orange|[Torren, Ishnir Diplomat]\n Greetings, Captain      Color|orange|[Wilhelm, Chillwind Diplomat]\n As does the Queen. I must say, Captain      Color|orange|[Torren, Ishnir Diplomat]\n Speaking of walking the plank… You sure brought a big ship this time, Wilhelm.\n  Color|orange|[Wilhelm, Chillwind Diplomat]\n They said something about needing to show our country’s power. Thank you again for having your ship moved out to sea so we\ncould dock.\n  Color|orange|[Torren, Ishnir Diplomat]\n As much as we’d like to stay and chat, we both need to check in with our advisors. We will speak soon, Captain\nColor|orange|[Captain Indigo]\n Those two looked oddly comfortable with each other, considering their countries are on the brink of war. I'll go with them so\nthey don't get lost.\n&o  Talk to Indigo and find out where some of your guests went. Table\n Captain Indigo\n  Color|orange|[Captain Indigo]\n Oh hey      Color|purple|[Have you seen where any of our guests went?]\n  Color|orange|[Captain Indigo]\n An Ishnir Navigator went outside with some of the crew. Izzy went in that direction as well and might be able to help.\n&o  Speak to Izzy for help finding a way to spy on a group of party goers. Table\n Izzy\n  Color|orange|[Izzy]\n Hey      Color|purple|[Have you heard anything interesting, Izzy?]\n  Color|orange|[Izzy] Not entirel\n y, these guys seem to be talking about the Ishnir Diplomat but I can’t hear them clearly. If you really wanted to listen to\nthem for some reason you could probably use a communication device to do so. Not sure where one would find one of those though.\n  Color|purple|[They will stop talking if they notice me though.]\n  Color|orange|[Izzy]\n Looks like you could get on the balcony of that house over there, the one the Chef's are in. You could likely listen in from\nthere.\n&o  Use the Spymaster 9001 to listen from the balcony. Table\n Spymaster 9001\n  Color|orange|[Ishnir Navigator]\n Now get this, you’ve all seen how friendly the boss is with the Chillwind diplomat. The two have been friends for years, I tell\nyou! At least, that’s what I heard from one of my sources.\n  Color|gray|You decide that you should return to Indigo. Maybe she has seen someone else.\n&o  Speak to Indigo to inquire about the Chillwind. Table\n Captain Indigo\n  Color|orange|[Captain Indigo]\n Did you find the crew you were looking for,      Color|purple|[More or less, did you happen to see any other groups, by\nchance?]\n  Color|orange|[Captain Indigo]\n I saw some Chillwind crew going east toward the docks. Vargos went out that way as well, maybe he can help you.\n&o  Speak to Vargos for more information on the location of Chillwind Sailors. Table\n Vargos\n  Color|orange|[Vargos]\n Ah, good to finally get some fresh air. Oh, Captain      Color|purple|[Did you happen to see any Chillwind Crew come through\nhere?]\n  Color|orange|[Vargos]\n Yes, one of the crew members seemingly had gotten landsick. They took him aboard the ship for him to recover.\n&o  Use the Spymaster 9001 to listen on a ship. Table\n Spymaster 9001\n  Color|orange|[Landsick Chillwind Sailor]\n *HURF* The diplomat saw me and some glowy thing came out of his hands and I started feeling a bit better. It was magic I tell\nyou. Our own diplomat was using magic!\n  Color|orange|[Chillwind Quartermaster]\n You must be seeing things. I was there with you and I didn't see anything out of the ordinary. Perhaps your landsickness made\nyou imagine it?\n  Color|orange|[Landsick Chillwind Sailor]\n You are probably *URGH* right. I'll probably forget all about it when I'm feeling better. He isn't that type of person.\n  Color|gray|You decide that you should return to Indigo. Maybe she has seen someone else.\n&o  Speak to Indigo to inquire about the Ishnir. Table\n Captain Indigo\n  Color|orange|[Captain Indigo]\n Did you find whatever you were looking for,      Color|purple|[Yeah, while unlikely, have you seen a third group pass through\nhere?]\n  Color|orange|[Captain Indigo]\n Well, the Ishnir Adviser has been upstairs, though good luck getting up there without making a ruckus. Levyn was suppose to be\npruning the vines outside, he might be able to help you.\n&o  Speak to Levyn about how to get upstairs. Also make sure he is okay. Table\n Levyn\n  Color|gray|Levyn looks heavily dazed and battered.\n  Color|orange|[Levyn]\n Uuuughghhhhh…..\n  Color|purple|[Are you ok?]\n  Color|orange|[Levyn]\n Yaarrrrrr…. I’ll be fine, just fell off the building and hit me head.\n  Color|purple|[Well, do you happen to know a way to climb onto the balcony upstairs?]\n  Color|orange|[Levyn]\n Aye, I didn’t trim back the vines before the party started, as you can see. You could use them to climb up. I think I'm going\nto rest here a bit longer.\n&o  Use the Spymaster 9001 to listen in from the balcony. Table\n Spymaster 9001\n  Color|orange|[Ishnir Advisor]\n I must say, the Frostgate monarchy is more hypocritical than I’d ever have imagined. They tout being able to do everything they\nhave by the sheer will of their people; yet they have been using magic acquired from defectors to the sceptre...\n  Color|orange|[Unknown Voice]\n Alright, this has gone far enough, coetus participes mentem!\n  Color|orange|[Torren, Ishnir Diplomat]\n I did not expect to have to meet again under these circumstances, Captain      Color|orange|[Wilhelm, Chillwind Diplomat]\n However, I dare say this was expected. I could see the distress in your eyes, and the entire affair reeks of Emmeline's\nhandiwork. Although, the party was pretty well executed for the time you likely had. I don't want you breaking things within my\nmind, so I would like to ask you to stay still.\n  Color|purple|[Wait, you know the Duchess?]\n  Color|orange|[Torren, Ishnir Diplomat]\n Yes, we both do. She's been a thorn in both of our sides for years, even before we both got our current positions.\n  Color|orange|[Wilhelm, Chillwind Diplomat]\n She can't hear anything we say as long as we are talking to each other like this, however I can't maintain this link for much\nlonger. Captain      Color|orange|[Torren, Ishnir Diplomat]\n No, WE have a request. We cannot ask blood to be spilt, but for the good of the isles, we ask that, by some means, Emmeline is\ndealt with. She jeopardizes the stability of the region with every breath she takes. One way or another, she needs to be\nstopped.\n  Color|purple|[Why me?]\n  Color|orange|[Wilhelm, Chillwind Diplomat]\n You are the Captain of Mistport. You are one of the easiest ways for her to spread her influence around.\n  Color|orange|[Torren, Ishnir Diplomat]\n If we act like this talk never happened, she will surely contact you again. Eventually, she may even drop her guard...\nWilhelm's focus is waning fast, thankfully it lasted long enough.\n  Color|orange|[Wilhelm, Chillwind Diplomat]\n Yes, soon this link will break, and the party will come to an end. Once it does, we shall return to our own countries. To sate\na portion of your probable curiosity, Captain    &o  Speak to Tiffy about what has happened. Table\n Tiffy\n  Color|orange|[Tiffy]\n Ello, ol’ chap, how did the mission go?\n  Color|purple|[She should have the information she requested. Here's the communicator back.]\n  Color|orange|[Tiffy]\n Jolly good show that is. Here's your reward...\n  Color|purple|[You can cut out the accent, you have a lot to answer for.]\n  Color|orange|[Tiffy]\n Indeed I do ol' chap, but so do you at this point. Neither of us chose to become employed by her. Also, I don't know what\naccent you mean. Anyway, here is your reward, a Spymaster 9001.\n  Color|purple|[What? That's it?]\n  Color|orange|[Tiffy]\n What were you expecting? The Duchess doesn't pay easily, and that orb is worth more than all of your possessions put together.\nBesides, the advice from the guy on the other side is PRICELESS... Eh, take this too, it's not like I need it anymore.\n AN UNLIKELY PARTNERSHIP COMPLETE! SoftBreak  Awarded   Link   Tiffy's Shield Tiffy's_Shield wikilink and a Spymaster 9001.\nLink   Category:Quests Category:Quests wikilink\n", "reward": "rewards = *&3Tiffy's Shield&r\n*Spymaster 9001"}