{"name": "Bandit Troubles", "information": "prerequisites = None NPC: Octavius King's Valleytown = Sierhavenstarting_npc_coordinates = -672, 107, 70POI: &3Bandit onghold&r NPC: Octavius King's Valleytown = Sierhavenstarting_npc_coordinates = -672, 107, 70POI: &3Bandit onghold&rstarting_npc_coordinates = -672, 107, 70POI: &3Bandit onghold&r King's Valleytown = Sierhavenstarting_npc_coordinates = -672, 107, 70POI: &3Bandit onghold&rtown = Sierhavenstarting_npc_coordinates = -672, 107, 70POI: &3Bandit onghold&rPOI: &3Bandit onghold&r", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Octavius \n  Coordinates: [-672,107,70] \n   &6[Octavius] \n Ah, you there! You look quite skilled, tell me, do you have any compunctions about killing thieves and ruffians?  \n  &5[None whatsoever]  \n  &6[Octavius] \n Wonderful! I am Octavius, head of the Five Axes Trading Company. Bandits have been harassing my caravans for a while now, and the City Guard is completely inept! Kill their leaders - of the bandits, not of the Guard, haha - and I will greatly reward you.  \n  &5[I'll do what I can]  \n  &6[Octavius] \n Simply Wonderful! The leaders are in two camps north of the city and fly black and brown banners. Bring back some proof when they're both killed, and do what you can to make them suffer. \n  &5[Not interested.]  \n  &6[Octavius] \n Alas, I suppose I shall have to find someone more mercenary to assist me. \n  &5[Not interested.]  \n  &6[Octavius] \n Alas, I suppose I shall have to find someone more mercenary to assist me.  \n&o  Assassinate two Bandit Leaders at their camps North of the city. Bring back proof once they're both dead. \n&o  1/3 - Slay a Bandit Leader in their   Link   northwestern stronghold Bandit_onghold wikilink for Octavius. They should drop evidence of your victory.  \n  Coordinates: [-900, 115, -434] \n &o  2/3 - Slay a Bandit Leader in their   Link   hilltop fortress Bandit_Camp wikilink  , southeast of the mage tower. They should drop evidence of your victory. \n  Coordinates: [-390, 113, -339] \n &o  3/3 - Once you have the Cargo Manifests and the Suspicious Note return to Octavius. Table  AlignDefault ColWidthDefault AlignDefault \n Octavius AlignDefault \n  &6[Octavius] \n Well done indeed! Those bandits won't be harrassing anyone any more. What do you think, a stack of enchanting bottles for your trouble?  \n  &5[This book the bandit had said insurance...]  \n  &6[Octavius] \n Hah, you're smarter than you look. Yes, there's something questionably legal here, but keep your mouth shut and don't tell the guards and there's an extra stack of bottles in it for you. LineBreak ong  Note: This decision will change future quest lines!  \n  &5[Make it three stacks and you've got a deal.]  \n  &6[Octavius] \n Haha, a shrewd negotiator. Three it is. Glad to see you know which way the wind blows. I'll mention your name to an associate who occasionally needs someone with your... scruples. \n  &5[Your bribery won't work. I'm going to Captain Murano!]  \n  &6[Octavius] \n Alas. You had such promise, and threw it away for the possibility of praise and promotion. Go, and know that if you meddle in my affairs there will be consequences.  \n&o  Bring Captain Murano the two suspicious books Table  AlignDefault ColWidthDefault AlignDefault \n Captain Murano \n  Coordinates: [-759, 125, -132] \n   &6[Captain Murano] \n Let me know if there's anything that I, or the rest of the city guard, can do for you.  \n  &5[You might be interested in these papers.]  \n  &6[Captain Murano] \n *reads documents* That cur! We've been suspicious of Octavius for a while but had no evidence. With this we can start building a case. I can't offer much by way of reward, but take this blade in case he sends his thugs. Thank you, and I shall tell the other guards of your honor and trustworthiness.  ", "reward": "rewards =\n192 Experience Bottles if you side with Octavius\n\n\n-or-\n\n&3Watcher's Sword&r if you side with Captain Murano"}