{"name": "Bane of the Bakers", "information": "prerequisites = None NPC: &3Stefan&r &3King's Valley&rtown = &3Sierhaven&rstarting_npc_coordinates = -865, 104, 31 NPC: &3Stefan&r &3King's Valley&rtown = &3Sierhaven&rstarting_npc_coordinates = -865, 104, 31starting_npc_coordinates = -865, 104, 31 &3King's Valley&rtown = &3Sierhaven&rstarting_npc_coordinates = -865, 104, 31town = &3Sierhaven&rstarting_npc_coordinates = -865, 104, 31", "dialogue": "}} \n&o  Retrieve   Link   Stefan's Stefan wikilink pretzel recipe from the bakers in the bakery. LineBreak &o  Using the official Monumenta Resource Pack is highly recommended. Table  AlignDefault ColWidthDefault AlignDefault \n Stefan \n  Coordinates: [-865, 104, 31] \n   Color|orange|[Stefan]}} \n You look like the kind of guy who likes pretzels. You know who makes pretzels? Me, Stefan, young pretzel maker extraordinaire.  \n  Color|purple|[Aren't you a bit young to be running a business?]}}  \n  Color|orange|[Stefan] \n I don't need your sass. If you don't want a pretzel go buy some boring bread, I hear that's what all the boring old fogies eat. \n  Color|purple|[Where are your pretzels?]}}  \n  Color|orange|[Stefan]}} \n Well, I've had a bit of an issue. The bakers stole my recipe. Don't ask me why, they're just jerks and like taking things from little kids. If you could get my recipe back I'll give you all the pretzels you can eat and more. I'm almost out of stock to sell!  \n  Color|purple|[I'll get the recipe.]}}  \n  Color|orange|[Stefan]}} \n Thanks! That baker will get what he deserves. You can find him in the bazaar along the eastern path from the plaza \n  Color|purple|[Maybe I'll have time later.]}}  \n  Color|orange|[Stefan]}} \n Fine, be that way. I'll just be here, young and sand, because some old person wouldn't help me.  \n&o  C: Ask the Head Baker about his pretzel recipe Table  AlignDefault ColWidthDefault AlignDefault \n Head Baker \n  Coordinates: [-811, 102, 85] \n   Color|orange|[Head Baker]}} \n Hello there! Is there any way I can help you? \n  Color|purple|[Do you have a pretzel recipe I could borrow?]}} \n  Color|orange|[Head Baker]}} \n Gah! That dastardly kid must have sent you for it. No, we're not giving our recipe away, especially not to that kid. Go tell him he's out of luck  \n&o  C: Tell   Link   Stefan Stefan wikilink about the Head Baker's unwillingness to give up the recipe Table  AlignDefault ColWidthDefault AlignDefault \n Stefan \n  Coordinates: [-865, 104, 31] \n   Color|orange|[Stefan]}} \n I should have guessed they wouldn't give it up that easily. We're going to have to take it ourselves. \n  Color|orange|[Stefan]}} \n So here's the plan. The bakers have a large kitchen below their shop. The entrance is right behind the shop and leads down to a trap filled baking and storage area. You're going to have to go in there and hunt for the recipe and then bring is back to me. I'd be careful, you have to jump around a bunch and I'm scared of heights, which is why I haven't gone down there myself. Good luck!  \n&o  C: Break into the bakers' kitchen and steal the recipe! \n  Tip: This jumping puzzle (and jumping puzzles throughout Monumenta) uses redstone torches to mark where to go. OrderedList DefaultStyle DefaultDelim Plain  Enter the trapdoor by pressing the button at -805 98 107. Plain  Head to the north-west corner of the room (with furnaces). Jump on the lowest furnace, turn east and jump on that bar, and jump onto the ladder. Plain  Jump down from the raised quartz floor onto a crate with slime blocks. Open the two trapdoors beneath the ladder and climb up. Plain  Jump off the ladder's top onto the quartz railing. Move to the elevated pumpkin crate. Plain  Climb up another ladder hidden near the pumpkins. Walk on the west-most fences to reach above the melon crate. Plain  Press the button at -708 82 139. Plain  Use the stack of haybales on the ground near this room's entrance to jump atop crates. Use the newly blown up platform to climb up to where the recipe is held. \n  After retrieving the recipe: \n&o  C: You've got the recipe! Head back to   Link   Stefan Stefan wikilink  ! Table  AlignDefault ColWidthDefault AlignDefault \n Stefan \n  Coordinates: [-865, 104, 31] \n   Color|orange|[Stefan]}} \n Awesome! This recipe is perfect! Here, I baked some pretzels just for you. These should keep you going for a while. Also, here's a fun little toy I use sometimes. It's really great for helping me focus and might help you too!  \n ''' RawInline  color|teal|BANE OF BAKERS COMPLETE! LineBreak RawInline  color|teal|Awarded Fidget Spinner and 32 Pretzels!}} ", "reward": "rewards = *&3Fidget Spinner&r\n*32 Pretzels"}