{"name": "Borrowed Time", "information": "prerequisites = * &3The Olive Branch (Quest)The Olive Branch&r\n* &3A Study in Crimson Part Two&r\n* &3Here There Be Dragons&r\n* &3Treasure for the Future&r\n* Completion of &3Celsian Isles&r monument\n NPC: Vargos Coords: -740 82 1337\n Celsian Isles Mistport\nDifficulty = Very Hard\nLength = Very Long\n", "dialogue": "&o  Meet with the Celsian representatives. Header start_of_quest  Start of Quest Table\n Vargos\n  Coordinates: [-917, 91, -161]\n   &6[Vargos]\n Hello [Player]. It’s good that you’re here, we were looking to get a hold of you.\n  &5[I’m pretty busy right now, I’ll have to come back later.]\n  &6[Vargos]\n Very well, but come back quick. Time is, very literally, of the essence.\n  &5[What’s going on?]\n  &6[Vargos]\n Bhairavi and her team have arrived at Mistport, and we were preparing to hold a council to determine what our next steps are in\norder to deal with the Teal spirit. We were hoping to have you join us.\n  &5[Sounds important. I’m ready to go now.]\n  &6[Vargos]\n Then I’ll let everyone else know we’re meeting now. Let us go.\n If you leave the meeting go back to Vargos:\n  You can leave the meeting by stepping on the pressure plate at [-1432 120 2910].\n To rejoin talk to Vargos again: Table\n Vargos\n  Coordinates: [-917, 91, -161]\n   &6[Vargos]\n Ready to go back to the meeting?\n  &5[Yes, please]\n  &6[Vargos]\n Right away.\n &o  C: Talk to Bhairavi - and the other guests - to discuss the plan to handle Teal.\n Pre-Meeting dialogue:\n  Levyn\n  Coordinates: [-1423 119 2910]\n   &6[Levyn]\n Ahoy cap'n. Anythin' I can be doin' ta help?\n  &5[You're helping just by being here Levyn. It's nice to see you.]\n  &6[Levyn]\n Ye as well Cap'n!  Table\n Keller\n  Coordinates: [-1432 131 2911]\n   &6[Keller]\n What an experience. Time travel, magical corruption, and a fake wool? I have no idea what's next, but I'll be prepared for\nanything.  Table\n Antigone\n  Coordinates: [-1433 100 2917]\n   &6[Antigone]\n Hi [Player].\n  &5[Hi Antigone. Surprised you're here!]\n  &6[Antigone]\n I figured I could leave Professor Marin flopping around through time for a bit. I've already made a few excursions into the\nCongress anyway. What's up?\n  &5[Just looking for info on Teal.]\n  &6[Antigone]\n Nothing new from me, sad to report.  Table\n First Mate Jones\n  Coordinates: [-1422 100 2914]\n   &6[First Mate Jones]\n Ahoy, Captain! Hostin’ another big event, I see!\n  &5[I am. It's an important one. Do you have any information about the Teal spirit?]\n  &6[First Mate Jones]\n Th' wha' now? Not a darned clue what yer on 'bout, Captain. Say, I hear ye be askin' about weird glowy figures 'n' even weirder\nstuff around 'em.\n  &5[I... absolutely am. That's actually what I just asked about!]\n  &6[First Mate Jones]\n Do ye know 'bout th' Depths then? Portals ta th' world below the sea. Opened by a monster sighted by crews 'cross th' sea... It\nbe no sailor's tale. Over th' years many have claimed ta see glowin' figures floatin' above th' ocean, causin' rifts ta open\ndeep below th' waves.\n  &5[Huh, that sounds wild. Could it have been Teal as well?]\n  &6[First Mate Jones]\n Th' ocean tends ta be more of a deep blue, but maybe? Thanks fer hearin' me out, cap'n.  Table\n Brayllur\n  Coordinates: [-1430 104 2929]\n   &6[Brayllur]\n Hi hi puny one. You fight like bear inside, yes. Eye no survive - it be made of sandglass now! Brayllur survive though. Thank\nyou, friend.  Table\n Wexley\n  Coordinates: [-1431 107 2922]\n   &6[Wexley]\n Well hey [Player]! We're here for the big meeting!\n  &5[Hi Wexley! Find anything in the Congress that might help?]\n  &6[Wexley]\n SOOOOO many books! But nothing about Teal, sorry! Took me a moment to realize whatcha meant...  Table\n Torbran\n  Coordinates: [-1428 107 2923]\n   &6[Torbran]\n Greetings [Player]. It's nice to see you again. Hopefully we'll get to speak when not in the midst of a crisis eventually.\nTable\n Zarek\n  Coordinates: [-1426 107 2922]\n   &6[Zarek]\n Hey hey Captain [Player]! Glad to see ya made it to your meeting.\n  &5[Glad I made it as well. Got any info for me?]\n  &6[Zarek]\n Nothing new on Teal, sorry. The Congress had enough craziness!  Table\n Marshall Ludvic\n  Coordinates: [-1434 107 2917]\n   &6[Marshall Ludvic]\n Let’s see here... Oh, hello. You’re the... Captain, yes? Good to meet you properly. I’m here on behalf of her Majesty, Queen\nObregson, to represent her in this conference.\n  &5[Do you have any information on the whereabouts of the Teal Spirit?]\n  &6[Marshall Ludvic]\n Oh, yes, that I do. There was an event several months back on the west end of the continent which was, at the time, blamed on\nthe mages hiding out in Wispervale. A large storm had formed above an ancient tower, lightning crashing down around the area.\nAllegedly, this was an attempt at some dangerous ritual by the mages, designed to destroy the crown for good...\n  &6[Marshall Ludvic]\n Yet, as our nation begins to grow more tolerant of magic, some scrutiny has been placed on these claims. As far as we can tell,\nthe mages of Wispervale were not responsible for this event.\n  &6[Marshall Ludvic]\n With the knowledge of this rogue spirit, it seems possible that it was the source of the magic on that day. I couldn’t tell you\nwhat it was attempting - the tower returned to normal long before anyone could investigate. But, perhaps that is enough of a\nlead to help you with your search.\n Talking again:\n  &6[Marshall Ludvic]\n Hmm... Let's see... Oh, hello again, Captain. What else can I do for you? Is the meeting getting underway?\n  &5[Not yet, just checking back in.]\n  &6[Marshall Ludvic]\n Thanks for checking. I've got nothing new, I'm afraid.  Table\n Wilhelm\n  Coordinates: [-1435 107 2915]\n   &6[Wilhelm]\n [Player], good to see you. I had hoped our troubles would have mostly ended when we removed Ridnan, but it seems there is more\nwork to do.\n  &5[There's always more work to do. Do you have any information on the whereabouts of the Teal Spirit?]\n  &6[Wilhelm]\n Ah! I personally do not, no. I did, however, invite my old friend Artol to this council. He believes he has seen something that\nfits your search.\n  &5[It’s good to see you as well. How are things in Chillwind?]\n  &6[Wilhelm]\n Things are going as well as they can be, I would say. A sizable group of Magehunters fled the capitol after Ridnan’s removal\nfrom power, and seem to still be at large... But we have it handled.  Table\n Artol\n  Coordinates: [-1435 107 2915]\n   &6[Artol]\n Hm. Well met, Paladin [Player]. I trust your adventures have gone well? You’ve slain many undead in your travels, surely!\n  &5[I’ve defeated many undead, Artol.]\n  &6[Artol]\n Excellent! Fine work, my friend. You have made an excellent paladin in your time away.\n  &5[Wilhelm told me you have information about Teal.]\n  &6[Artol]\n Ah. Yes. The strange spirit. Not my area of expertise, I will admit. The undead are my only foes.\n  &6[Artol]\n I have, in any case, seen a strange sight indeed. During one of my routine patrols around Nightroost, my eye was caught by\nflashes of otherworldly light deep within the abandoned dig sight.\n  &6[Artol]\n As I descended to investigate, I caught a glimpse of an impossibility. An arm of a mighty Frost Giant burst from the ground,\nflailing and grasping at seemingly nothing. A tall figure floated above, watching. In a blink of an eye, it vanished along with\nthe arm.\n  &6[Artol]\n The area was scarred with a strange magic, unlike any I have seen before. I have seen nothing since, though I have kept my eye\non the area.\n Talking again:\n  &6[Artol]\n Hm. You return. What can I do for you?\n  &5[Just seeking information still.]\n  &6[Artol]\n Pursuit of knowledge is often the best way forward.  Table\n Brandy\n  Coordinates: [-1423 107 2920]\n   &6[Brandy]\n Hello again [Player]. Nice to see you without a prisoner needing persuading this time.\n  &5[Good to see you Brandy. How's the family?]\n  &6[Brandy]\n Doing well! Cinevra wanted to come along, but I told her to stay put for now. She says hello.  Table\n Archivist Nyra\n  Coordinates: [-1420 107 2917]\n   &6[Archivist Nyra]\n So you’re Mistport’s Captain, then? I suppose I should have connected the dots, what with the strange questions you kept asking\nme about our history.\n  &5[That's me. What information do you have on the whereabouts of the Teal Spirit?]\n  &6[Archivist Nyra]\n Oh, yes, the rogue spirit. I will admit, this was a challenging topic to research, even with all our resources... But I believe\nI managed to find an item which is relevant to your search.\n  &6[Archivist Nyra]\n Out in the Ishniran desert was a statue that seemed to depict a Silver Knight, based on the research I did. Here's the catch\nthough. It was quite grand only a few years back. However, your friend Bhairavi has told me it's destroyed and she found\nimportant writings inside.\n  &6[Archivist Nyra]\n I've since found an eyewitness to its destruction! His name was Ron or something. He saw a glowing figure appear near it, float\naround for a bit, then the whole thing began to crumble quite suddenly. Then it was gone. I hope that helps!\n Talking again:\n  &6[Archivist Nyra]\n Ah, the Captain returns. What can I do for you?\n  &5[I'm still looking for more information.]\n  &6[Archivist Nyra]\n Alas, I have none for you. Perhaps someone else will.  Table\n Torren\n  Coordinates: [-1419 107 2915]\n   &6[Torren]\n Well met [Player]. I'm surprised you managed to coordinate another meeting here so quickly.\n  &5[Me too. Do you have any information about the Teal Spirit? I've been asking around to gather what we know.]\n  &6[Torren]\n I think I do. Alnera had to send a regimen to the north of Ishnir recently to handle reports of what I could only describe as\nwell... one of our founding god myths, Mauta, appearing.\n  &5[That sounds amazing.]\n  &6[Torren]\n You would think, but all we found were smoldering remains of humans, coated in magma-like armor that cooled into something more\nsilver. Like a war had been fought under the lava itself. People nearby claimed to have seen a glowing figure floating about the\nlava, then the molten flow itself came alive and began to form into a figure. The being seemed to take something, then it\nvanished.\n  &6[Torren]\n From your description, the figure sounds like Teal, but I have no idea what it could have been seeking. I hope this is enough\nto help you.\n Talking again:\n  &6[Torren]\n Well met again [Player]. What brings you back?\n  &5[Still poking around for information. I figured talking to everyone a bunch could help.]\n  &6[Torren]\n I wish I could help more.  Table\n Head Guard Obadiah\n  Coordinates: [-1420 107 2913]\n   &6[Head Guard Obadiah]\n Well hello Captain [Player].\n  &5[Hi Obadiah. Sorry again for accusing you...]\n  &6[Head Guard Obadiah]\n Not to worry. I think I've gotten over it! What can I do for you?\n  &5[I'm looking for information on the Teal Wool spirit.]\n  &6[Head Guard Obadiah]\n I'm not sure I can help you, but I know Nyra has a story for you.  Table\n Izzy\n  Coordinates: [-1431 107 2909]\n   &6[Izzy]\n Ahoy [Player]! So, we're finally doing this?\n  &5[Yes indeed. It's time to find Teal and take it down.]\n  &6[Izzy]\n We’ll figure out what to do about Teal, I’m sure of it. I think you should go chat with everyone you can. Maybe they have some\ngood information we can use.  Table\n Pten\n  Coordinates: [-1429 107 2908]\n   &6[Pten]\n Hail [Player]. It's good to see you again, even under dire circumstances.\n  &5[Indeed. How goes the project at the Congress?]\n  &6[Pten]\n Well, but slow. We've been trying to recover parts of the Conscriptorium recently. Fascinating stuff, but seriously, so\ndangerous. Would have been far worse without your help in there.  Table\n Vargos\n  Coordinates: [-1425 107 2908]\n   &6[Vargos]\n Welcome to the meeting, [Player]. Head around and chat with the guests. See what information you can get together before we\nstart the meeting properly.\n  Meeting: Table\n Bhairavi\n  Coordinates: [-1427 107 2907]\n   &6[Bhairavi]\n So! Have you spoken to everyone yet?\n  &5[Not yet. I still have a few people I need to get to.]\n  &6[Bhairavi]\n Okay. Let me know when you're ready to discuss.\n  &5[I’ve spoken to everyone I need to, yes.]\n  &6[Bhairavi]\n Excellent. Do we have any new leads from the information you got?\n  &5[Not really. Some of the reports could actually be Teal, but if it was, the spirit’s long gone by now.]\n  &6[Bhairavi]\n That’s… discouraging. Is there at least something that the reports share in common? Something that could link them together?\n  &5[Well, Teal seems to really dislike the Silver Knights. Some reports include it messing with or destroying things that could\nbe linked to the knights.]\n  &6[Bhairavi]\n The Silver Knights... What do we know about them?\n  &6[Izzy]\n The Silver Knights are enforcers, seeking out Wool. Traces of them are hard to find, but they've been active all over the\nworld, in ancient history, and have left traces of their time around. Legends as well. Great battles.\n  &6[Pten]\n They certainly were involved with the creation of the Monuments. [Player] got a Hammer of theirs from the Valley that Farr's\npeople found at said Monument.\n  &5[I've met some Knights.]\n  &6[Bhairavi]\n I'm sorry, what?\n  &5[I found one in the Valley underneath the Monument. I found another here in the Isles during an adventure related to\nSalazar, under the Silver Tower.]\n  &6[Vargos]\n Why are you just now bringing this up [Player]? Were any of them alive?\n  &5[Not those ones, but I did meet three who spoke with me briefly under the City of Bones, in the Blackflame city. ]\n  &6[Izzy]\n I thought I mentioned those guys to you Archmage Vargos?\n  &5[Maybe you did. Maybe time reverted again? Things were weird there... They can't help us though. They can't leave. It's\ncomplicated.]\n  &6[Vargos]\n So basically we can't actually speak to the Knights to see if they know anything. Shame.\n  &6[Torren]\n Nor do we have any actual knowledge of where this Teal spirit is.\n  &6[Wilhelm]\n Nor do we even have the capability to catch it.\n  &6[Marshall Ludvic]\n Will our forces even work against it? The Wools are dangerous after all. Something living with that power could decimate us\nwith a thought! How would we win?\n  &6[Obadiah]\n So this was all pointless then?\n  &6[Brandy]\n Surely there's a reason we're all here... Why would we have just randomly been called together to-\n  &6[Bhairavi]\n Hey. Hey! HEY! Shut up! There's a reason we're all here, and it's to try and pool our resources and our knowledge to try and\ncome up with something. So, does anyone have any ideas?\n  &5[I... I know someone who would know how to help. He's called the Crimson King. He's... another Wool Spirit, from the Crimson\nWool.]\n  &6[Vargos]\n ...EXCUSE ME?! WHY ARE YOU JUST NOW BRINGING THIS UP?\n  &6[Bhairavi]\n Surely you're joking. There isn't a Crimson Wool.\n  &5[Not anymore. It was destroyed during the attack on the city of Farr by C'Telsket, a leader of the Sons of the Forest.]\n  &6[Vargos]\n ...Um. What? We didn't know of Wool back then. Herring died in that attack... Maxwel- Calder... He and Minerva, his friend,\nsurvived that attack. They never mentioned a Wool.\n  &5[He holds domain over Memory. His release caused a severe warp in memory nearby, even keeping Farr trapped in its damaged\nstate.]\n  &6[Bhairavi]\n Why is this all making sense...? You really know another Wool Spirit?\n  &5[I do, and I count him as an ally. Unlike Teal, he is not hostile, and wants to be back in his Wool.]\n  &6[Bhairavi]\n And you believe him? The Wools... They lie, [Player]. You know this. We've all heard the stories and seen the destruction\nthey've wrought. You and I have been involved in far too many adventures involving the dangers they pose. Would the Crimson\nspirit actually work against Teal?\n  &5[Yes. To all of it.]\n  &6[Bhairavi]\n Do you know that for sure?\n  &6[Izzy]\n Yeah... Can he actually be trusted, or is he just working with you to get what he wants?\n  &6[Brandy]\n I've not said much so far but... the Wool. They've caused such horrors. Would it be so bad if one were helping heal? [Player]\nhas more experience with this being than us. This could be a chance for us.\n  The gathered crowd murmurs agreement... slightly.\n  &6[Vargos]\n I think Brandy is right. I think we should be taking the allies we can get. If [Player] truly has gained an ally of a Wool\nspirit, and they can offer us help in resolving this crisis, we should take it.\n  &5[Thank you for your thoughts. Should I pay him a visit?]\n  Voices break out across the room. Excited. Nervous. Scared. Hopeful. Eventually the murmuring reaches an agreement... until...\n  &6[Vargos]\n Yes.\n  &5[I hope he can help us.]\n  &6[Vargos]\n For all of our sakes, yes. Go pay your Crimson King in the King's Valley a visit. Let's see what he can do for us.\n Talking to Vargos after the meeting:\n  &6[Vargos]\n Hi [Player]. Go meet with your Wool Spirit, wherever he is. No time to waste.\n&o  C: Travel to the King's Valley and meet with the Crimson King. Header meeting_crimson_king  Meeting Crimson King Table\n The Crimson King\n  Coordinates: [-917 91 -161 (KV)]\n   &6[The Crimson King]\n  Hello again [Player].\n  &5[I have something to talk to you about. It's important. [Borrowed Time]]\n  &6[The Crimson King]\n  Did you find them? The Silver Knights?\n  &5[Kind of. It's actually about another Wool. Teal has been broken and the spirit inside is loose. I need your help.]\n  &6[The Crimson King]\n  ...How?! The Malefactor was never to be released.\n  &5[It's a very long story. After much discussion with my allies, I felt you were the best option to ask for help. Also,\nneither were you?]\n  &6[The Crimson King]\n  I would be glad to assist you. Teal's pedestal would be a good starting point. We could potentially track him from it. Do you\nknow where it is?\n  &5[Pedestal? There wasn't one for Teal with the other Wool in the Celsian Isles.]\n  &6[The Crimson King]\n  That can not be right. His place was in the Isles. Unless he took his pedestal as well? That would be very odd indeed. The two\nof us, following the same path once again... Can we visit this Monument then?\n  &5[Of course. It's in a place called Steelmeld in the Isles. Will you just follow me?]\n  &6[The Crimson King]\n  That will work. Let me reach out to Jeremiah to get him out of our Monument first. I would rather not leave him trapped in\nthere unexpectedly. Feel free to begin your travels. I will catch up.\n&o  C: Travel to the Steelmeld Monument. Table\n The Crimson King\n  Coordinates: [-1334 109 2814 (CI)]\n   &6[The Crimson King]\n  &5[Exactly.]\n  &6[The Crimson King]\n  &5[Can we do that? I thought a specific Doorway was needed to enter.]\n  &6[The Crimson King]\n  &5[Why did you need Azacor's help then?]\n  &6[The Crimson King]\n  &5[Then let's go.]\n  &6[The Crimson King]\n&o  C: Talk to the Crimson King. Table\n Crimson King\n  Coordinates: [-2613 163 2607 (Veil)]\n   &6[The Crimson King]\n  &5[Where are the wool markers?]\n  &6[The Crimson King]\n  &5[So Hekawt wasn't lying, the pedestals aren't supposed to be here...]\n  &6[The Crimson King]\n  &5[How do we even start looking for where they're supposed to be?]\n  &6[The Crimson King]\n  &6[The Crimson King]\n&o  C: Talk to the Crimson King... and Teal. Table\n The Crimson King\n  Coordinates: [-1334 109 2814 (CI)]\n   &6[The Malefactor]\n  &5[Teal!]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &5[We will not help you continue to cause such destruction and death.]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &6[The Malefactor]\n&o  C: Battle back the broken Wool!\n  You must survive for 3 minutes. Every time the next wool is broken then mobs from that dungeon will start spawning.\n &o  C: Talk to the Crimson King. Table\n The Crimson King\n  Coordinates: [-1334 109 2814 (CI)]\n   &5[What... what just happened?]\n  &6[The Crimson King]\n  &5[How are we going to stop him from just doing it again?]\n  &6[The Crimson King]\n  &5[If you think we can pull it off...]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &5[Hello, Teal.]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &5[Now, you need to leave. There is nothing here for you.]\n  &6[The Crimson King]\n  &5[We found a Knight resting below the Monument in the King's Valley.]\n  &6[The Malefactor]\n  &5[You were the voice in the memory?]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &5[I'm ready.]\n&o  C: Speak to the Silver Knight and learn the past...\n  &6[The Malefactor]\n   Table\n The Malefactor\n  Coordinates: [-2307 179 2444]\n   &6[The Malefactor]\n  &5[By... my hand? How? How did I get here?]\n  &6[The Malefactor]\n    Table\n Silver Knight Daarken\n  &5[You must be Daarken.]\n  &6[Silver Knight Daarken]\n Another stranger approaches this sacred tomb. Have they placed down the imprisoned to activate the Claim? The last stranger\ntook the prison that waited here, I see...\n  &5[No. I came to find you.]\n  &6[Silver Knight Daarken]\n Something has let them through the gateways. This cannot be anything but a sign of the end. The Veil cannot survive this.\n  &5[The Veil will be fine. You, however, have reached the end of your usefulness. It's time to go.]\n  &6[Silver Knight Daarken]\n No. What master do you serve? Yes, I speak to you directly. I see them inside. Those eyes are not your own. Thy thoughts are\nempty and cold. I feel for thee, puppet. How did thee enter these sacred halls? What darkness hath thee twisted?\n  &5[The how does not matter, only the results. It is your time to return, Daarken.]\n  &6[Silver Knight Daarken]\n Know I will not lay down my arms lightly. If what speaks through you expects this to be easy, know it shall be not! To arms!\n After beating Silver Knight Daarken:\n  &6[Silver Knight Daarken]\n How...? I feel...... him calling...................... Header post_silver_knight  Post Silver Knight\n&o  C: Talk to the Crimson King... and Teal. Table\n The Crimson King\n  Coordinates: [-1334 109 2814 (CI)]\n   &6[The Crimson King]\n  &5[I have no idea. I have no memory of that. You heard him. That wasn't me.]\n  &6[The Malefactor]\n  &5[That couldn't be me. I'd never been there before, as far as I know. Why would I kill him?]\n  &6[The Crimson King]\n  &5[The Knight - Daarken? - mentioned there was someone else before me.]\n  &6[The Crimson King]\n  &5[I swear to you I’m not. Could this be more false memories? Could Teal be trying to drive us apart?]\n  &6[The Malefactor]\n  &5[I found another Knight here in the Isles, under the Silver Tower. I activated a machine near it, but the place collapsed. I\ndon’t know what happened to it. Maybe it knows where the pedestal is?]\n  &6[The Crimson King]\n  &6[The Malefactor]\n  &5[We'll stop you. You can't keep destroying time to get your way.]\n  &6[The Malefactor]\n  &6[The Crimson King]\n  &5[I have so many more questions about what we've learned...]\n  &6[The Crimson King]\n&o  C [1/2]: Leave the Monument.\n&o  C [2/2]: Talk to Vargos.\n After hitting Vargos and getting sent to the dialogue area:\n&o  C [1/2]: Talk to Vargos.\n&o  C [2/2]: Talk to Bhairavi and Vargos. Table\n Zarek\n  &6[Zarek]\n Hey [Player]! Vargos is waiting to chat with ya.  Table\n Pten\n  &6[Pten]\n Hello [Player]. Vargos and Bhairavi are waiting to discuss with you.  Table\n Izzy\n  &6[Izzy]\n Ahoy Captain. I assume you're bringing news? Vargos and Bhairavi will definitely want to hear it.  Table\n Bhairavi & Vargos\n  &6[Bhairavi]\n You’re back! I heard there was a disturbance in Steelmeld and got really worried it was you.\n  &5[It was, but things have settled. Let me fill you in.]\n  &6[Bhairavi]\n Please do!\n  You fill them all in on the events that occurred.\n  &6[Vargos]\n So your spirit friend did the same thing he seems to have done to Farr to the Monument? He really stood against the Teal\nspirit? This is incredible.\n  &5[Yeah. He genuinely is an ally here. He has his own goals, but we’re clearly aligned here.]\n  &6[Izzy]\n So what’s the next move?\n  &5[We need to meet Crimson at the Silver Tower. He wants to help us get back in to try and find the Silver Knight inside so we\ncan try and find out where Teal’s pedestal might be located.]\n  &6[Bhairavi]\n Are we sure we can trust him? Meeting him somewhere safe was fine, and he defended you... But the Tower seems sketchy. I'm\nsorry, but my trust of wool is low. I think we need some time to discuss all of this. Work out who is willing to go. If the risk\nhere is worth the potential reward. How much time do we have?\n  &5[I'm not sure. We shouldn't wait long.]\n  &6[Vargos]\n Then we will make this as quick as we can. Thank you for your contributions, [Player]. We are truly operating on borrowed time\nright now. Come back and see us soon. We'll have made a decision by then, I'm sure.  Table\n  BORROWED TIME COMPLETE\nLineBreak   Awarded 6 Ambrosia and 6 Hyper Crystalline Shards.\n", "reward": "rewards =* 6 Ambrosia\n* 6 Hyper Crystalline Shards\n"}