{"name": "Buried Blade", "information": "prerequisites = &3Bandit Troubles&r and took the bribe from Octavius\n NPC: Blackjack Stan Coords: -103, 96, -88\n King's Valley Nyr\nPOI: &3Overgrown Cave&r\n", "dialogue": "}} \n  WorkInProgress|\n* Missing the other end path (Corporal Rose can allegedly repair it)}} Table  AlignDefault ColWidthDefault AlignDefault \n Blackjack Stan \n  Coordinates: [-103, 96, -88] \n   &6[Blackjack Stan] \n Ahh, Octavius told me 'bout ya. Said you'd do just 'bout anything for the right price. Well, I've got somethings what need doin' and some coin, whadda ya say?  \n  &5[Make it a lot of coin.]  \n  &6[BlackJack Stan] \n Hah, well said. There's a cave in the nearby mesa where I keep my, ah, 'legally acquired' goods. But a gravel cave-in buried my goods and there's too many spiders down there! By now, most of my goods have rotted, but there's an antique sword still in there. Bring me that sword back and there's a bag o' loot in it for ya. Here, take this key, you'll need it to get in.  \n  &5[Take Key] \n  &5[Not now, I'm busy.]  \n  &6[Blackjack Stan] \n Then quit wasting my time and go bother someone else! I'm a busy man.  \n&o  [1/3]: Head to the   Link   Overgrown Cave Overgrown_Cave wikilink to being your search. \n&o  [2/3]: A cave-in caused gravel to block the way. Clear it out and find the sword. [158, 76, -29] \n&o  [3/3]: Once you find the blade return it to Blackjack Stan for your reward. There might also be an alternative NPC that would love to see it. \n If you return to Blackjack Stan: Table  AlignDefault ColWidthDefault AlignDefault \n Blackjack Stan AlignDefault \n  &6[Blackjack Stan]|[Corporal Rosie]}} \n Ha, ya found it! Guess they don't call you buggers adventurers for nuthin! Here ya go, some bags o' loot, just as promised.  \n BURIED BLADE COMPLETE! Awarded 192 Xp bottles. \n If you return to Corporal Rosie: Table  AlignDefault ColWidthDefault AlignDefault \n Corporal Rosie AlignDefault \n  &6[Corporal Rosie]}} \n Sorry, I'm a bit busy. Have to get these swords finished before tomorrow. Unless you've found something interesting I can work on...  \n  &5[Will you fix this old sword?]  \n  &6[Corporal Rosie]}} \n Yes, absolutely! This should be amazing polished up. Give me a second... \n  &6[Corporal Rosie]}} \n Tada! It's a beautiful sword, just like I thought, and well balanced. Use it well!  \n BURIED BLADE COMPLETE! Awarded the   Link   Hallowed Gladius Hallowed_Gladius wikilink  ! ", "reward": "rewards =\n* 192 Xp bottles\nor\n* &3Hallowed Gladius&r\n"}