{"name": "Burning Bright", "information": "prerequisites = None\n NPC: Suri Coords: -1580, 133, 134\n King's Valley Oceangate\nPOI: &3Toxin Lab&r\n", "dialogue": " Table\n Suri\n  Coordinates: [-1580, 133, 134]\n   &6[Suri]\n Perhaps if I reduce the input power by half and increase the speed of our cooling systems by 20%, we can save about 14% of the\ncurrently consumed coal... But if we do that, our systems will become unusable much faster and replacements will be required\nsooner... We might as well not even have a beacon at that point, huh?\n  &5[What's going on?]\n  &6[Suri]\n Oh, nothing, just trying to keep my sanity with all these calculations I have to run. The stupid questions are helping much.\n  &5[Well, perhaps, I can help somehow?]\n  &6[Suri]\n You? Help? Perhaps you can... see, the thing is, we're always running low on our coal supplies and it's hard to receive\nconstant shipments from Sierhaven.\n  &5[And you suggest..?]\n  &6[Suri]\n Well, I've heard the alchemists back into Sierhaven are, or at least were, looking into solving our problem here. Except I\nhaven't heard back on their progress in some time now. If you could head back to the Alchemist's Workshop and make sure they\naren't just twiddling their thumbs like morons, perhaps they can help with the reagent that's been worked on.\n  &5[What? Why?]\n  &6[Suri]\n Well, if you hadn't noticed, there are bandits roaming the sea and heavens know when we will be able to put a stop to them. I\neven heard they took an outpost near Sierhaven.\n  &5[Who are you? What is this place?]\n  &6[Suri]\n I'm Suri. I'm in charge of the light house. More questions?\n  &5[Yes, one more question, pretty please?]\n  &6[Suri]\n Just make it quick.\n  &6[Suri]\n Really? That's your question? I don't care and suggest you to leave me be this instant.\n  &6[Suri]\n If only I knew that question coming, I'd dismiss you right away. I don't care about that, I should go back to my work.\n  &6[Suri]\n Do you actually find it funny? Well, I don't and you just wasted my time. Happy now?\n  &5[No more questions.]\n  &6[Suri]\n Off you go then.\n  &5[Alright... I won't distract you anymore then.]  Plain &o  She quickly loses interest in you.\n  &6[Suri]\n Now, where was I...\n  &5[I'm sorry to interrupt your thinking genius, but...]\n  &6[Suri]\n No buts! If you can't suggest anything useful or at least keep your silence, then you shouldn't interrupt me.\n  &5[On the other hand, if you add additional fuel control systems to your control panel, perhaps you can store the surplus and\nreuse it? According to my calculations, this should save up to 9% of the amount of coal used daily...]\n  &6[Suri]\n You're talking nonsense, because, obviously, that'd require not just one qualified specialist who could modify our control\nsystem, but also a big amount of redstone sensors - observers. We simply don't have enough materials for that and even if we do,\nthat'd decrease our working capability by almost 43%! No way we sacrifice that!\n&o  Head to the Alchemy Hub in Sierhaven and ask for details regarding a special reagent. Table\n Head Alchemist\n  Coordinates: [-797, 115, -48]\n   &6[Head Alchemist]\n Welcome to the Alchemical Workshop! My associates and I sell the finest potions in the empire!\n  &5[I'm searching for a reagent, one that'll make coal last longer.. Have anything like that?]\n  &6[Head Alchemist]\n No, I'm not sure we have anything like that in stock.\n  &5[Perhaps you know where I can find it then?]\n  &6[Head Alchemist]\n Well.. If you're not afraid of being withered, or poisoned, or poisoned and withered at the same time, then, I believe there\nshould be something like that in the Toxin Lab. It's out in the sea, west of Sierhaven. I'm not sure what exactly happened\nthere, but it was abandoned awhile back. Stay on your guard.\n&o  [1/2]: The reagent is sealed in the   Link   Toxin Lab Toxin_Lab wikilink  . Head there and find your way into the Reagent\nVault.\n&o  [2/2]: Once you find the reagent, head back to Suri.\n In Toxin Lab, get to the elevator at [-1194, 34, 126].\n  Note: You can hit submit as many times as you want and it won't penalize you.\n Hit Change Color until the output color is Orange then press submit.\n Hit Change Color until the output color is Green (Not Lime/Light Green) then press submit.\n Hit Change Color until the output color is Purple (Not Magenta) then press submit.\n Hit Change Color until the output color is Lime (Not Green) then press submit.\n Hit Change Color until the output color is Brown then press submit.\n &o  The door to sealed part of the vault is now open!\n Enter and grab the quest item in the chest.\n&o  You grab the reagent and close the chest. Better get back to Suri. Table\n Suri\n  &6[Suri]\n Perhaps if I reduce the input power by half and increase the speed of our cooling systems by 20%, we can save about 14% of the\ncurrently consumed coal... But if we do that, our systems will become unusable much faster and replacements will be required\nsooner... We might as well not even have a beacon at that point, huh?\n  &5[About that reagent...]\n  &6[Suri]\n Hm? What reagent? Oh, its you. Did you find it yet?\n  &5[I did. It was sealed in the Reagent Vault in the Toxin Lab.]\n  &6[Suri]\n Well, cut to the chase. We have a work to do!\n  &5[*Give the reagent*]\n  &6[Suri]\n Well, let's see...\n  &6[Suri]\n Oh..!\n  &6[Suri]\n It's... it's the exact thing I need! Finally, I can sleep well at night and not worry about another supply shortage or missing\nshipments!\n  &5[You seem to be very excited about that.]\n  &6[Suri]\n Of course I am! Wouldn't you be as well? This may be a small step towards the safety of our vessels, but it's very important to\nour Empire.\n&o  She looks at the reagent once again.\n  &6[Suri]\n Simply beautiful! I suppose you deserve this, whoever you are. We can certainly spare this coal now.\n BURNING BRIGHT COMPLETE! Awarded Unstable Sparkler and 24 Coal Blocks!\n", "reward": "rewards =\n* &3Unstable Sparkler&r\n* 24 Coal Blocks\n"}