{"name": "Casting for Help", "information": "prerequisites = *&3Supply and Demand&r NPC: Melinda King's Valleytown = Sierhavenstarting_npc_coordinates = -614, 96, 12POI: &3Swamp Sinkhole&rrewards = *64 Experience Bottles\n*3 &3Healing Vial NPC: Melinda King's Valleytown = Sierhavenstarting_npc_coordinates = -614, 96, 12POI: &3Swamp Sinkhole&rrewards = *64 Experience Bottles\n*3 &3Healing Vialstarting_npc_coordinates = -614, 96, 12POI: &3Swamp Sinkhole&rrewards = *64 Experience Bottles\n*3 &3Healing Vial King's Valleytown = Sierhavenstarting_npc_coordinates = -614, 96, 12POI: &3Swamp Sinkhole&rrewards = *64 Experience Bottles\n*3 &3Healing Vialtown = Sierhavenstarting_npc_coordinates = -614, 96, 12POI: &3Swamp Sinkhole&rrewards = *64 Experience Bottles\n*3 &3Healing VialPOI: &3Swamp Sinkhole&rrewards = *64 Experience Bottles\n*3 &3Healing Vial", "dialogue": "&o  Visit Nurse Deidre to find a way to help Melinda's leg Table\n Melinda\n  Coordinates: [-614, 96, 12]\n   Color|ORANGE|[Melinda]\n Hello there, you caught me at a bad time. I normally would be happy to talk to you and try to figure out why you broke into my\nhouse, but I'm a bit preoccupied with my leg.\n  Color|purple|[What happened to your leg?]\n  Color|ORANGE|[Melinda]\n I was putting the finishing touches on my roof and fell off. My leg is surely broken now. I managed to make it to this chair\nafter much struggling, but that is about all I have been able to do.\n  Color|purple|[So you need a doctor?]\n  Color|ORANGE|[Melinda]\n I do, but Deidre would never let me hear the end of it. We were friends until she beat me in a baking contest. Her bragging got\non my nerves and I haven't spoken to her since. I will have to give in and crawl over there later, it won't be a very pleasant\ntrip.\n  Color|purple|[I could go see Nurse Deidre for you.]\n  Color|ORANGE|[Melinda]\n You would do that for me? Thank you. I will have to think of a way to thank you for your kindness.\n  Color|PURPLE|[Have fun with that!]\n  Color|Orange|[Melinda]\n I promise you I won't.\n  Color|purple|[So you need a healing potion?]\n  Color|orange|[Melinda]\n Sadly I have always been allergic to those. They don't heal me, and they make swell up a bit.\n  Color|purple|[You don't have anything worth stealing anyway.]\n  &6[Melinda]\n I'm not sure if I should be happy or very sad.\n&o  C: Visit Nurse Deidre to find a way to help mend Melinda's leg. Table\n Nurse Deidre\n  Coordinates: [-754, 107, -8], Tower Entrance: [-715, 108, -11]\n   Color|orange|[Nurse Deidre]\n If you're not feeling well, feel free to rest for a bit in one of the beds.\n  Color|purple|[A woman named Melinda fell off her roof and broke her leg.]\n  Color|orange|[Nurse Deidre]\n Melinda? I haven't spoken to her in years. Well obviously she needs to be taken care of immediately. Unfortunately we are\nrunning a bit low on supplies at the moment due to the bandits.\n  Color|purple|[What do you need?]\n  Color|orange|[Nurse Deidre]\n I have most of the things she will need, but we are out of materials to make casts. If her leg keeps moving it will never heal,\nso that is rather important.\n  Color|purple|[Can I help?]\n  Color|orange|[Nurse Deidre]\n If you could get 15 Spider Silk from the   Link   Swamp Sinkhole Swamp_Sinkhole wikilink north of   Link   Sierhaven Sierhaven\nwikilink I should be able to weave it into a cast for her to wear, but it will be very dangerous.\n  Color|purple|[I will head right there.]\n  Color|orange|[Nurse Deidre]\n Good luck, retreat if you get into trouble. Last thing we need is another person getting hurt.\n  Color|purple| [Hopefully you get supplies in soon.]\n  Color|orange| [Nurse Deidre]\n I'm sure Lowtide will send a shipment soon, but I worry about her leg setting wrong in the meantime.\n&o  C [1/2]: Collect 15 Spider Silk from the   Link   Swamp Sinkhole Swamp_Sinkhole wikilink\n&o  C [2/2]: Once you have 15 Spider Silk return to Nurse Deidre. Table\n Nurse Deidre\n  Color|orange|[Nurse Deidre]\n If you're not feeling well, feel free to rest for a bit in one of the beds.\n  Color|purple| [I have the Spider Silk.]\n  Color|orange|[Nurse Deidre]\n Wonderful! This goes here and that goes there... Okay it should be ready to go. I'll have to do the final fitting myself\nobviously, but I will have to grab some equipment before I head over. Take this cast and these crutches to her, and I'll meet up\nwith her as soon as I can.\n&o  C: Take the Cast and the Crutches back to Melinda Table\n Melinda\n  Color|ORANGE|[Melinda]\n Have you spoken to Nurse Deidre yet?\n  Color|purple|[I did. She gave me this cast and these crutches for you. She promised to come by in person as soon as she can.]\n  Color|ORANGE|[Melinda]\n I can't thank you enough. My mind is clouded by pain, but I think I left some money in my basement. Would you like to go check?\n  Color|purple|[Yes.]\n  Color|purple|[Not right now.]\n  &6[Melinda]\n Let me know when you are ready.\n&o  C [1/2]: Talk to Melinda, go to her basement, and open the chests.\n&o  C [2/2]: If you forget where to find Melinda, you can find her here.\n After opening the chest:\n&o  There is nothing in this chest. You should go talk to Melinda\n&o  C: Talk to Melinda. Table\n Melinda\n  Color|ORANGE|[Melinda]\n I'm feeling so much better now. Deidre came by while you were down there. Did you find any money down there?\n  Color|purple|[No, the chest was empty.]\n  Color|ORANGE|[Melinda]\n Oh dear, I completely forgot that I took my money with me when I bought building blocks. Sorry about making you go down there.\nHere is your reward. I'll throw in a few healing potions since I'm allergic to them anyway.\n  Color|purple|[No, but I found a strange book.]\n  Color|orange|[Melinda]\n Umm... Don't worry about that. Oh I had my money on me all along, silly me. Here is your reward, plus a few health potions to\nhelp you forget about what you saw.\n   Healing Vials]]!\nLink   Category:Quests Category:Quests wikilink\n", "reward": "rewards = *64 Experience Bottles\n*3 &3Healing Vial|Healing Vials&r"}