{"name": "Clucked Up", "information": "prerequisites = Have a &3Clucking&r item\n NPC: Master of Clucks Coords: -106, 97, -63\n King's Valley Nyr\n", "dialogue": "}} \n  WorkInProgress|The coords for the chickens in grove, Dialogue branch choosing [Uh, okay. Where can I get one?], }} \n To the start the quest you must be \"Afflicted by the Clucks\". \n This is just having an item with the cosmetic Clucking. This can be achieved in one of two ways. \n The first is by killing certain chickens found in the Grove where you will receive an item with Clucking or getting the arrow with Clucking from   Link   Voyage of Discovery Voyage_of_Discovery wikilink and not using it. \n The second is by either being splashed or splashing yourself with a Jar of Clucks. \n The potion can only be obtained by buying from another player or by completing the race unlocked by this quest. Table  AlignDefault ColWidthDefault AlignDefault \n Master of Clucks \n  Coordinates: [-106, 97, -63] \n   Color|ORANGE|[Master of Clucks]}} \n Oh my! You've been Clucked! \n  Color|purple|[Excuse me?] \n  Color|ORANGE|[Master of Clucks]}} \n You have the...   ong RawInline  color|red|CURSE... upon thee! Do you not   ong  FEEL its horrible influence hanging over thy head?   ong  THE NOISE! THE ENDLESS CLUCKING!?  \n  Color|purple|[Oh um. Yeah I guess I have noticed that.] \n  Color|purple|[How did this happen?]  \n  Color|ORANGE|[Master of Clucks]}} \n This is not a question I have answers to! SO! \n  Color|ORANGE|[Master of Clucks]}} \n Do you wish to rid yourself of this...   RawInline   Color|purple|[Yes!]  \n  &6[Master of Clucks] \n THEN LET US BEGIN! \n  Color|purple|[I mean, I suppose. It's fine I guess.]  \n  &6[Master of Clucks] \n Your level of enthusiasm concerns me, but WE SHALL BEGIN! \n  Color|purple|[Not now.]  \n  &6[Master of Clucks] \n INSANITY! Once you do, I will be here!  \n&o  Speak to the MASTER OF CLUCKS! Table  AlignDefault ColWidthDefault AlignDefault \n Master of Clucks AlignDefault \n  Color|ORANGE|[Master of Clucks]}} \n Now then! Next to me here you will see a POULTRYGEIST (ahh!)! You will not know true terror until you've tried to handle one of theses beasts.  \n  Color|purple|[I HAVE SEEN TRUE TERROR!] \n ** RawInline  Color|ORANGE|[Master of Clucks]}} THEN YOU KNOW WHAT WE MUST DO  \n&o  Speak to the Baron of All Bunnies, the Bunny Baron. Table  AlignDefault ColWidthDefault AlignDefault \n The Bunny Baron \n  Coordinates: [-131, 90, -121] \n   Color|ORANGE|[The Bunny Baron]}} \n WELCOME to the lair of the BUNNY BARON! \n  &5[Uh... hello?] \n  Color|ORANGE|[The Bunny Baron]}} \n Do YOU come seeking the CARROTS? Nay, mayhaps the BUNNIES THEMSELVES? Or do you seek the true treasure, my JEWELED BUNNY SLIPPERS?! \n  &5[Actually I'm here about an Easter Egg for the Master of Clucks. He told me you had one.] \n  Color|ORANGE|[The Bunny Baron]}} \n WHAT?! That scoundrel DARES send someone to me?  \n  &5[He needs it to interrogate a Poultrygeist!]  \n  Color|ORANGE|[The Bunny Baron]}} \n A POULTRYGEIST?! SCREW THOSE GUYS! Well then... I suppose I could part with an Easter Egg... if you do ONE SMALL FAVOR for me! \n  &5[Which is?] \n  Color|ORANGE|[The Bunny Baron]}} \n DESCEND within the cave behind me and do battle with the MIGHTY BEAST inside. Defeat it and return to me and mayhaps you shall be granted... AN EASTER EGG! \n  &5[You know, you two sound rather alike!]  \n  Color|ORANGE|[The Bunny Baron]}} \n HOW DARE YOU! Comparing the CLORIOUS ME to that circus dwelling no good CHICKEN?! BEGONE!  \n&o  Defeat the BEAST in the Bunny Barron's Warren to get an Egg from the Baron! \n  Don't worry about the fight at all. The Pig God is just a literal health stick. None of the attacks do damage. \n Start of fight: \n  color|red|OINK OINK!!! OINK OINK, OINK OINK, OINK!?!? \n  color|red|OINK OINK OINK! OINK OINK OINK, OINK OINK OINK OINK!!! OOIIINNNKKK!!! \n After lowering The Pig God's hp by 1 bar: \n  color|red|OINK. OINK. OINK OINK. \n  color|red|OOINK OINK. OINK OINK OINK. OINK OINK! \n  color|red|OINK OINK, OINK OINK OINK OINK. OOINKKKK!! \n  &6[Godly Clucking Spirit] \n Cluck Cluck! \n  color|red|OINK!? OINK OINK OINK!?! \n  &6[Godly Clucking Spirit] \n Cluck. Cluck Cluck Cluck Cluck. Cluck CLUCK!!! \n  Color|teal|Your curse of Clucking is suddenly brought out in power, making you feel extremely powerful! \n  Color|teal|You have gained OP AS CLUCK powers!! Cluck em' up \n  color|red|OINK!! OINK OINK OINK!!! OINK OINK!!!!!!! \n After you kill The Pig God: \n  color|red|OINK! OINK OINK! OINK OINK OINK OINK!?!?!? \n  color|red|OOOOOOIIIIIIINNNNNNNNNNKKKKKKKKK!!!!!!! \n  The Bunny Baron AlignDefault \n  Color|ORANGE|[The Bunny Baron]}} \n IT IS DONE! I heard the dreadful SCREAMS as you took down the BEAST! No more shall that horrible CREATURE in the form of one so porcine HAUNT US! Now quickly, take this Easter Egg and be on your way!  \n&o  Return to the MASTER OF CLUCKS with the Easter Egg. Table  AlignDefault ColWidthDefault AlignDefault \n Master of Clucks AlignDefault \n  Color|ORANGE|[Master of Clucks]}} \n You did it! Excellent. I'll just take that then... and we can head into the LAIR and begin the interrogation! \n  &5[The lair?] \n  Color|ORANGE|[Master of Clucks]}} \n YES! The LAIR! It's just down the ladder next to me. We've got quite a cushy basement set up, okay? Are you ready?  \n  &5[Let's do it!]  \n  Color|ORANGE|[Master of Clucks]}} \n ONWARD! \n  &5[Not yet.]  \n  Color|ORANGE|[Master of Clucks]}} \n Let me know when you are and we can begin!  \n&o  Speak to the MASTER OF CLUCKS to head to his supercool secret lair! Table  AlignDefault ColWidthDefault AlignDefault \n Master of Clucks [Lair] AlignDefault \n  Color|ORANGE|[Master of Clucks]}} \n Welcome to the LAIR [Player]! I think it is time to begin the interrogation! \n  &5[What can I do to help?] \n  Color|ORANGE|[Master of Clucks]}} \n Stand here, look intimidating, and feed me questions! I'll translate this FIEND'S answers! \n  &5[Sounds good!] \n  Color|ORANGE|[Master of Clucks]}} \n Now! ASK YOUR QUESTION!  \n  &5[How do I get uncursed?]  \n  Color|ORANGE|[Master of Clucks]}} \n He says \"You must travel atop the greatest tree in the forest and steal the Decluckifier from the Motherclucker herself!\" \n ** RawInline  Color|ORANGE|[Terrified Poultrygeist]}} BWAWKKK  \n&o  Speak with your fellow prisoner to try and escape the Motherclucker. Table  AlignDefault ColWidthDefault AlignDefault \n Imprisoned Poultrygeist AlignDefault \n  Color|ORANGE|[Imprisoned Poultrygeist]}} \n I can't believe the Motherclucker! She's going to De-Geist me! This is ABSURD  \n After you finish the race: \n&o  Return to the MASTER OF CLUCKS with your new knowledge! Table  AlignDefault ColWidthDefault AlignDefault \n Master of Clucks AlignDefault \n  Color|ORANGE|[Master of Clucks]}} \n You survived! I can't believe you've made it back! \n  &5[I've got a text that should let us break this clucking curse!] \n  Color|ORANGE|[Master of Clucks]}} \n How in the CLUCK did you get that?! \n  &5[The Poultrygeist! It gave it to me because the evil Motherclucker was going to de-geist him!] \n  Color|ORANGE|[Master of Clucks]}} \n AMAZING! Well, let me take that and I'll learn the ritual! With this in hand I can break any clucking curses! You've done amazing work!  \n CLUCKED UP COMPLETE MTHACLUCKAS!!! HAPPY APRIL FOOL'S DAY! Awarded access to decluckifying with the Master of Clucks, access to the Get The Cluck Out race at the top of the Hawk Fortress tree to get more Jar of Clucks, access to the Pig Boss Battle for fun and glory! ", "reward": "rewards =\n* Access to decluckifying with the Master of Clucks\n* Access to repeat the &3Get The Cluck Out&r race\n* Access to the Pig Boss Battle\n"}