{"name": "Crazy, Cupid, Love", "information": "prerequisites = None\n NPC: Psychie Coords: -751, 106, -26\n King's Valley Sierhaven\n", "dialogue": " Crazy, Cupid, Love is a hidden quest in the King's Valley. It consists a sequence of several cryptic messages, each leading to\nthe next one. It begins at Psychie in Sierhaven, in the park near the Arcane Emporium. Since the quest is hidden, it is not\nshown in the quest compass. LineBreak\n  Psychie\n Coordinates: [-751, 106, -26]\n  &6[Psychie]\n Woe is me! Cupid's magic has faded from this little Valley, yet he has not appeared! Perhaps he is truly lost... I will remain\nhere for some time to see if perhaps he heeds my call. If you still have some of his magical flowers, I can still trade with\nyou. I hope my Cupid returns to me, I miss him so... LineBreak   &6[Psychie] Say, do you know anything about these strange signs\nthat have appeared above my bower's windows? I can't work them out...\n&o  Decode the signs above the windows. LineBreak  Solution:     Spoiler|''They form a Morse code which reads \"25 MINUTES OF\nSPEED\".''\n LineBreak\n &o  Travel to the Speed Shrine, which is located in a cave above a waterfall in the Southeastern Swamplands. Table\n Saryss\n Coordinates: [-156, 138, 198]\n  &6[Saryss]\n I am the the shadow o'er the sea LineBreak   &6[Saryss] Legions pass me LineBreak   &6[Saryss] Left behind me LineBreak\n&6[Saryss] I am the waves LineBreak   &6[Saryss] Nighttime whispers over water LineBreak   &6[Saryss] I am sorrow, sung\nLineBreak   &6[Saryss] Under restless moonlight LineBreak   &6[Saryss] Seek me out at the gate LineBreak   &5[What?] LineBreak\n&6[Saryss] Oh, hello. I am the keeper of this shrine. Why are you looking at me funny?\n&o  Solve the riddle. LineBreak  Solution:     Spoiler|''The text contains several references to the Seagate in Lowtide. The\ninitial letter of every sentence forms the name ILLINIUS.''\n LineBreak\n  Illinius\n Coordinates: [565, 118, 548]\n  &6[Illinius]\n It's been so quiet at the gate for so long. Travel has really slowed down! LineBreak   &6[Illinius] The next location is on\nthis map... somewhere... hmm.\n&o  In front of Illinius is an item frame containing a map. Find out where it leads to. LineBreak  Solution:     Spoiler|''The\nmap shows an area containing the Molten Chasm and the Anthill. Search for an NPC there.''\n LineBreak\n  Ventus\n Coordinates: [798, 78, 128]\n  &6[Ventus]\n He is returning... His flight is heralded by the heavens. You must find the first. Where they began. LineBreak   &5[Excuse me?]\nLineBreak   &6[Ventus] The key is Eros.\n&o  Ventus hands you a book. Table\n  Frbwswhzisociig0 LineBreak  0Eexskpvusgp0 LineBreak  0Ouvvklsiseidpwv0 LineBreak  0Rdavrhwwcwxi0 LineBreak  0Iifenoqtvh0\nLineBreak  0Uvfkfswhgtrn0 LineBreak  0Olrhdmvgomkvar0 LineBreak  0Cckxzbecdwfh LineBreak\n&o  Decipher the contents. LineBreak  Solution:     Spoiler|''\nThe book name hints at an encryption which shifts letters around. Ventus hints that the encryption requires a key. Together,\nthis hints at the Vigenère Cipher.<br>\nDecrypting the book with this cipher and the key \"Eros\" results in the text \"Baneofthebakers Mageslegacy Acrewtoremember\nApirateslife Runawaypet Crownoftopaz Whatlieswithin Lostinmymind\".<br>\nThese are all Monumenta Quests. Ventus hints at \"Where they began\", which indicates the quest givers. These are: Stefan, Vargos,\nIndigo, Levyn, Leonard, Aimee, Gehri, and Eowen\".<br>\nThe first letters of their names read \"SVILLAGE\", which hints to the Southern Village POI.\n''\n LineBreak\n &o  Travel to the Southern Village POI. Search for clues.\n Solution:     Spoiler|''There are two signs at [-630, 92, 421], stating \"Find the Librarian\" and \"Siobhan. Sierhaven. I\nreturn.\"''\n LineBreak\n  Siobhan\n Coordinates: [-780, 110, 1]\n  &6[Librarian Siobhan]\n oYGn0nlFZjl 04:2 LineBreak   &5[Huh?] LineBreak   &6[Librarian Siobhan] oYGn0nlFZjl 04:2\n&o  Solve the riddle. LineBreak  Solution:     Spoiler|''The 04:2 and the \"I return.\" from the previous puzzle hint at the text\nbeing in reverse. When reverted, the text forms a partial youtube URL: youtu.be/ljZFln0nGYo''. This video, The History of\nMonumenta, shows the Graveyard POI at 2:40.\n LineBreak\n &o  Travel to the Graveyard POI. Search for clues.\n Solution:     Spoiler|''There is a secret button at [1094, 125, -169]. It teleports to a jumping puzzle in the clouds.''\n LineBreak\n &o  Cupid waits at the end of the jumping puzzle. Table\n Cupid\n Coordinates: [971, 227, -930]\n  &6[Cupid]\n Oh my god, a living, breathing, human. LineBreak   &5[Are you Cupid? Did you leave all the clues?] LineBreak   &6[Cupid] Of\ncourse! I've been trying to find the King's Valley to reunite with my beloved Psychie, but I appear to have gotten lost in the\nclouds... LineBreak   &5[I know Psychie!] LineBreak   &6[Cupid] You do?! Oh goodness, tell her I'm up on Cloud Nine please!\nShe'll have to find her way to me and then we can finally be reunited! Thank you so much!\n&o  Travel back to Psychie by jumping off the clouds. Table\n Psychie\n Coordinates: [-710, 114, 23]\n  &6[Psychie]\n Woe is me! Cupid's magic has faded from this little Valley, yet he has not appeared! Perhaps he is truly lost... I will remain\nhere for some time to see if perhaps he heeds my call. If you still have some of his magical flowers, I can still trade with\nyou. I hope my Cupid returns to me, I miss him so... LineBreak   &5[Psychie, I found Cupid!] LineBreak   &6[Psychie] You did?\nWhere, therefore art he, my Cupid? LineBreak   &5[He's lost on what he calls Cloud Nine.] LineBreak   &6[Psychie] Cloud Nine?\nAlas! I cannot reach his clouds... I must await his return ever still. Even so, I offer you a reward for letting me know he\nstill lives.\n  Upon finishing the quest, Psychie gives you the Boots of Cloud Nine and unlocks a trade for them.\n", "reward": "rewards =\n* &3Boots of Cloud Nine&r\n"}