{"name": "Dealbreaker", "information": "prerequisites = &3A Merchant's Woe&r\n NPC: Safar Coords: 222, 95, 30\n Celsian Isles Molta\n", "dialogue": "}} \n&o  Assist in retrieving The Ishnir Trade's goods Table  AlignDefault ColWidthDefault AlignDefault \n Safar \n  Coordinates: [222, 95, 30] \n   &6[Safar] \n Hmm... Are you, by any chance, [Player]?  \n  &5[Uh, stranger danger!]  \n  &6[Safar] \n Fine, the Trade didn't need your help anyways... \n  &5[Yeah... How do you know my name?] \n  &6[Safar] \n I have heard tale of your good deeds from Riaz in Rahkeri... \n  &5[Oh, it wasn't a big deal. Helping people is what I do.] \n  &6[Safar] \n Good, good... Well, the Trade requires your assistance. In a matter of business... \n  color|gray|He darts his eyes back and forth to make sure no-one is watching...}}  \n  &5[I'm actually quite preoccupied at the moment.]  \n  &6[Safar] \n Figures... \n  &5[Okay...What do you guys need help with?] \n  &6[Safar] \n Well you see, a client of ours is refusing to act on his end of a deal. We require you to retrieve our goods from him...  \n&o  C: Ask Safar what The Trade wants with you. Table  AlignDefault ColWidthDefault AlignDefault \n Safar AlignDefault \n  &6[Safar] \n Are you ready to begin?  \n  &5[No, I'm busy at the moment.]  \n  &6[Safar] \n Return to me once you're free... \n  &5[Yes, where should I go to retrieve your items?] \n  &6[Safar] \n A house towards the outskirts here has a basement, in that basement you should find our goods. Return them to us... Be careful [Player] - I am unsure what security measures the client has. \n  color|gray|He gives you a swift nod.}}  \n&o  C: Search for the client's house in Molta, once inside find the basement access hatch. Solve the puzzle and get the message inside. \n Link   Puzzle Solutions Guide/Dealbreaker Puzzle_Solutions_Guide/Dealbreaker wikilink \n &o  C: Return to Safar to see if he can decode the message. Table  AlignDefault ColWidthDefault AlignDefault \n Safar AlignDefault \n  &6[Safar] \n Have you found the Ishnir Trade's goods? \n  &5[Unfortunately not - the client didn't have them in his basement. However, he did have this.] \n  &6[Safar] \n Let me see that... \n  color|grayHe examines the book closely. \n  &5[So, does that help?] \n  &6[Safar] \n Yes, it helps tremendously, actually. This is an encoded set of coordinates to a location where our client has hidden a stash of supplies. \n  Color|gray|He looks up from the book.}} \n  &5[Oh! So where do they lead?] \n  &6[Safar] \n They appear to lead to an area named the \"Magmashroom Mines\". Look for some exposed stone bricks, which might indicate where the stash is. \n  &5[I'm on it!] \n  &6[Safar] \n Good luck, [Player].  \n&o  C: [1/2]: Travel to   Link   Magmashroom Mines Magmashroom_Mine wikilink in order to find the client's stash. Be on the lookout for stone bricks. \n&o  C: [2/2]: Once you have the stash return to Safar. Table  AlignDefault ColWidthDefault AlignDefault \n Safar AlignDefault \n  &6[Safar] \n So, have you retrieved the items? \n  &5[You bet!] \n  &6[Safar] \n Fantastic! [Player], you have been a great help to the Ishnir Trade. We will not forget what you have done to help us... \n  color|gray|He smiles at you.}} \n  &5[No problem!] \n  &6[Safar] \n We believe a reward is in order: here, take this... The Amulet here will allow you to be recognized by my superior.   AlignDefault \n  color|teal|'''DEALBREAKER COMPLETE!'''}} \n  color|teal|Awarded the [[Amulet of the Trade]] and the trust of the Ishnir Trade!  ", "reward": "rewards =\n* &3Amulet of the Trade&r\n* Trust of the Ishnir Trade\n"}