{"name": "Fabled Destiny", "information": "prerequisites = None NPC: Herriot the Loyal Celsian Islestown = Frostgatestarting_npc_coordinates = -1531 101 997  POI: &3Crystal Forest Grove&r NPC: Herriot the Loyal Celsian Islestown = Frostgatestarting_npc_coordinates = -1531 101 997  POI: &3Crystal Forest Grove&rstarting_npc_coordinates = -1531 101 997  POI: &3Crystal Forest Grove&r Celsian Islestown = Frostgatestarting_npc_coordinates = -1531 101 997  POI: &3Crystal Forest Grove&rtown = Frostgatestarting_npc_coordinates = -1531 101 997  POI: &3Crystal Forest Grove&rPOI: &3Crystal Forest Grove&r", "dialogue": "}} \n&o  Locate the destined blade for Herriot. Table  AlignDefault ColWidthDefault AlignDefault \n Herriot the Loyal \n  Coordinates: [-1531 101 997] \n   Color|orange|[Herriot the Loyal]}} \n Good day sir! How are you faring today? \n  Color|purple|[Pretty well!]}} \n  Color|orange|[Herriot the Loyal]}} \n That's good to hear! I, personally, have been waiting for destiny- destiny of the greatest legends! \n  Color|purple|[What kind of destiny are you, uh... destined for?]}} \n  Color|orange|[Herriot the Loyal]}} \n I am destined to wield a great blade in order to protect our Queen, Synnove Obregson, from the most dangerous of threats!  \n  Color|purple|[Sounds like a worthy destiny that will eventually come!]}}  \n  Color|orange|[Herriot the Loyal]}} \n Absolutely! \n  Color|purple|[Could I perhaps help to quicken the arrival of that destiny?]}} \n  Color|orange|[Herriot the Loyal]}} \n Well, I suppose you could assist in locating the fabled blade! \n  Color|purple|[So do you know where this blade is located?]}} \n  Color|orange|[Herriot the Loyal]}} \n Not exactly but I have an idea of who might be gifted with this information! Have a look in the Bazaar for Anette, she should know more!  \n&o  C: Visit Anette in the Bazaar and ask her where the fabled blade might be. Table  AlignDefault ColWidthDefault AlignDefault \n Anette \n  Coordinates: [-1472, 94, 901] \n   Color|orange|[Anette]}} \n Greetings! Welcome to the Frostgate Bazaar. I'm in charge of the traders that enter this place. \n  Color|purple|[Herriot said you know about a destined blade?]}} \n  Color|orange|[Anette]}} \n Ach, is he going on about his destiny again? I guess, if you do find it, it might shut him up for once. \n  Color|purple|[So do you know where it is?]}} \n  Color|orange|[Anette]}} \n Yes but, well, from all of the ancient scrolls I've read, the only thing that tells of this sword's location is a riddle... \n  Color|purple|[Hit me with it!]}} \n  Color|orange|[Anette]}} \n Alright, here it is: \"Tall doth stand the glowing trunks bending slight the bolete trove. On snow-strewn plains the crystal grove do hide the blade, of power drunk. Beware the crystals, oft attuned to icy grasps in the hidden shrine. But folly to the weak aligned 'tis sinister, destiny is hewn.\"  \n&o  C: Solve the riddle and travel to where it's leading you. (Anette can always tell you the riddle again). \n  The riddle is leading you to the PoI   Link   Crystal Forest Grove Crystal_Forest_Grove wikilink  . \n &o  C: [1/2]: Return to Herriot with the blade once you have retrieved it. \n&o  C: [2/2]: If you have lost the Blade of Destiny, you can find it in a cave in the PoI. Table  AlignDefault ColWidthDefault AlignDefault \n Herriot the Loyal AlignDefault \n  Color|orange|[Herriot the Loyal]}} \n Have you located the blade? \n  Color|purple|[Why yes I have!]}} \n  Color|orange|[Herriot the Loyal]}} \n Perfect! My destiny, it is being fulfilled at last! I feel the blade's power in my hand... So... magnificient... \n  color|gray|He gazes in awe at the sword.}} \n  Color|purple|[Herriot? Are you ok?]}} \n  Color|orange|[Herriot the Loyal]}} \n With all of this power... I feel UNSTOPPABLE! \n  Color|purple|[Herriot?!]}} \n  Color|red|Be ready for a fight!}} \n  Color|orange|[Herriot the Loyal]}} \n And you... will be the first to yield to its power  \n&o RawInline   color|red|''Herriot drops the sword and stumbles over by his desk.''}} \n&o  C:  Speak with Herriot to see if he is ok.'' Table  AlignDefault ColWidthDefault AlignDefault \n Herriot the Loyal AlignDefault \n  Color|orange|[Herriot the Loyal]}} \n I'm... not worthy... what... happened to me? I'm no knight. I do not deserve this title... \n  Color|purple|[Herriot, are you alright?]}} \n  Color|orange|[Herriot the Loyal]}} \n Yes, I believe so. That blade is too powerful for a mortal to wield- it's a good thing it broke in our scrap. I also may have forgotten that we're both protected in the city, so both of our blows wouldn't have done anything anyways. \n  Color|PURPLE|[Are you gonna be ok?]}} \n  Color|orange|[Herriot the Loyal]}} \n Yes, it appears my destiny has changed... Thank you again friend, you've made me see that.   AlignDefault \n  color|teal|'''FABLED DESTINY COMPLETE!''' \n  color|teal|Awarded 16 Compressed Crystalline Shards, and a [[Royal Shield]]!  \nLink   Category:Quests Category:Quests wikilink   Link   Category:Pages with broken file links Category:Pages_with_broken_file_links wikilink ", "reward": "rewards = *&3Royal Shield&r\n*16 Compressed Crystalline Shards"}