{"name": "Finished Business", "information": "prerequisites = * &3Clear as Glass&r\n* &3A Study in Crimson Part One&r\n* &3Time to Reflect&r\n* &3Shurima's Big Day Off&r\n* &3A Crew to Remember&r\n NPC: Taymian in the Sierhaven apartments. Coords: -826, 102, 39\n King's Valley Sierhaven\n", "dialogue": "&o  Complete an interview with your number one fan! Come on, you have a fan now! Table\n Taymian\n  Coordinates: [-826, 102, 39]\n   &6[Taymian]\n Oh my gods it's you! It's really you!\n  &5[Um, hello?]\n  &5[It's me! IT's really me!]\n  &6[Taymian\n I've been basically living here for weeks hoping you'd finally make an appearance, [player]. I can't believe we've never met\nbefore!\n  &5[I can, there's a lot of people out there.]\n  &6[Taymian\n I mean, yes, but I'm like, your biggest fan. Haven't you read my critically acclaimed novels?\n  &5[Novels? No, I prefer my lore books below 5 pages usually.]\n  &6[Taymian]\n Oh, that's unfortunate. They're quite popular! Of Shamans and Spells is doing really well right now!\n  &5[\"Of Shamans and Spells\"?]\n  &6[Taymian]\n Look, I can't just write them exactly like you did them. It sounded way better than \"Of Monks and Magic\" as well. Say, Atess,\ncan I do an interview with you?\n  &5[Um, Atess?]\n  &6[Taymian]\n Oh uh, sorry. That's what I named the protagonist in the books. I didn't just want to use your name without your blessing, see.\nSo, about that interview?\n  &5[I suppose.]  Header start_of_quest  Start of Quest\n&o  C: Speak with Taymian. Table\n Taymian\n  &6[Taymian]\n Hurrah! I'm working on a compendium of sequels to my latest, Ta'Eldim Ta'Encounters, and I hear from a reliable source that one\nof your adventures was uh... mostly in your head? What did they call it... Reflection Time? It's not a great name. I'm thinking\n\"Adventure Time\"!\n  &5[...It had a lot going on with mirrors and...]\n  &6[Taymian]\n Anyway, I wanted to get the story straight from the horse's mouth about a couple of your quests. Adventure Time, Study in\nScarlet, and Crewvengers Crewsemble are the working titles for the novels!\n  &5[I'm not even sure I know which of my adventures you're talking about anymore...]\n  &6[Taymian]\n Don't worry about it! You don't have to know, I just have to root around and find out.\n  &5[What?]\n  &6[Taymian]\n I followed up on one of your old adventures, Class Half Full, and found the ruins of Virus' machine that he'd kept Nellie in in\nreal life! It was crazy seeing the story pop off the page. Anyway, I spent some time reworking it a bit to be safe and figured\nhey, I'll strap you in and I can check out your memories for inspiration!\n  &5[Um... I'm feeling less and less sure about this by the second.]\n  &6[Taymian]\n Don't worry, it's totally safe, I promise! I'll mark where I'm renting space on your quest compass. I'm upstairs in Apartment\n230 upstairs. Come meet me there and we'll get started!\n&o  C: Speak to Taymian. They are upstairs in Apartment 230. Table\n Taymian (Apt. 230)\n  Coordinates: [-820, 119, 28]\n   &6[Taymian]\n Alright! Welcome to the Imaginarium Memorandum!\n  &5[Thank you for the uh, grand welcome... biggest fan.]\n  &6[Taymian]\n Oh my gods, I never told you my name, did I? I'm Taymian. I'm a famous author, telling tales of adventure across the King's\nValley and beyond! But you know all of that part. Sorry.\n  &5[It's fine. Definitely.]\n  &6[Taymian]\n Right, you're going to pick which adventure you'd like to relive, I'll get it queued up in the system, and we'll send you in to\nscope it out and make sure the details all look correct! Once you're done with that, bam! We've interviewed and I can get back\nto writing your amazing adventures!\n  &5[If you insist.]\n  &6[Taymian]\n Which memory would you like to visit?\n  &5[\"Adventure Time\".]\n  &5[\"Study in Scarlet\".]\n Note: Either path can be taken. After completing either task you be teleported back to the apartment and asked to do the other.\nHeader adventure_time  \"Adventure Time\" Table\n Taymian (Adventure Time)\n  &6[Taymian]\n So I understand that this adventures of yours was like, a recap episode, but with invisible jumping, right? I guess what I\nwanna see is your finishing of the last puzzle so I can really understand your psyche as you went through it! It's a great\ninvisible parkour course, with the reflections showing where to jump! You got this, Atess!\n  &5[This isn't right at all. It had a light-based puzzle and the blocks would appear and...]\n  &6[Taymian]\n Maybe I should put some lava under it in the novel!\n  &5[Please don't do that.]\n  &6[Taymian]\n I've gotta spice this up a bit! It'll at least be a good entry point for new readers!\n&o  C: Complete the barrier parkour course.\n Image   Orange squares = Barrier blocks. (Note some have height differences) Barrier_Parkour.png Orange squares = Barrier\nblocks. (Note some have height differences) LineBreak\n  Taymian (Study in Scarlet)\n  &6[Taymian]\n Right, so in this one you went into a bunch of memories and tried to solve a mystery right? The big one was some attack on\nFarr? I tried to recreate Farr. Haven't finished the effects on the sky and the forest though, so I've left a green screen for\nnow.\n  &5[A what? And wait, this is normal Farr... How do you even know all of this already?]\n  &6[Taymian]\n I had to scan your memories a bit to start building these stages in the system!\n  &5[I really don't understand.]\n  &6[Taymian]\n That's okay, I do! Now, go find the clues! You're entering the memories of... Watson? I think? Searching for what happened to\nthe Herring, yes? Go find the clues left around and work out where to travel after!\n&o  C: [1/4]: Search for clues. You need to find the Herring.\n&o  C: [2/4]: Search for clues. You need to find the Herring.\n&o  C: [3/4]: Search for clues. You need to find the Herring.\n&o  C: [4/4]: Search for clues. You need to find the Herring.\n  Invader of the Forest (Head)\n  Coordinates: [-2715, 159, -91]\n   &6[Invader of the Forest]\n How powerful you must be to defeat me. We shall have our revenge. Oh great conqueror, you have given me a noble death!\n  &5[They don't talk like that. Did you even try to be accurate?]\n  &6[Invader of the Forest]\n You shall never find what you are looking for. You shall down before our forces.\n   Serpensia Knot (Head)\n  Coordinates: [-2730, 157, -43]\n   &6[Serpensia Knot]\n HISS...meow.\n  &5[They are snake people. How did you get them confused with cats?]\n  &6[Serpensia Knot]\n Purr...\n   Serpensia Venomlord (Head)\n  Coordinates: [-2632, 155, -29]\n   &6[Serpensia Venomlord]\n Snake sounds.\n  &5[Did they just say \"Snake sounds\"? When has a Serpensia ever said that?]\n  &6[Serpensia Venomlord]\n Sad defeated snake sounds.\n   Serpensia Warrior (Head)\n  Coordinates: [-2648, 156, -76]\n   &6[Serpensia Warrior]\n ...\n  &5[Did you already run out of things for them to say?]\n  &6[Serpensia Warrior]\n Yes.\n  After every head was talked to:\n  &5[Why would I decide to check there?]\n&o  C: Head into the Sewer, you need to find the Herring!\n After clicking on the Sewer Grate:\n  &6[The Sewer Grate]\n \"You enter the sewers, following the trail of clues. Elementary!\"\n&o  C: Find the Herring and save the day! Table\n Taymian (Study in Scarlet Sewers)\n  &6[Taymian]\n And thus, with all your hard detective work, you found the Herring!\n  &5[Look, Taymian. I don't know how to tell you this. This is all wrong. This isn't even Farr's sewers.]\n  &6[Taymian]\n Wait really?\n  &5[Really. I *was* a man named Herring. I was looking for one of his Protegees, Minerva.]\n  &6[Taymian]\n I'm sorry, this seems like a lot of backstory my readers aren't prepared for.\n  &5[It's already available in a comic form anyway.]\n  &6[Taymian]\n Oh. I might skip writing this one then... Maybe once the second part is out! All done here!  Header after_both_paths  After\nBoth Paths\n&o  C: Speak to Taymian. They are upstairs in Apartment 230. Table\n Taymian (Apt. 230)\n  Coordinates: [-820, 119, 28]\n   &6[Taymian]\n Which memory would you like to visit?\n  &5[\"Crewvengers Crewsemble\".]  Header crewvengers_crewsemble  \"Crewvengers Crewsemble\" Table\n Taymian (Crewvengers Crewsemble)\n  &6[Taymian]\n Welcome! Now I believe in this one you were looking to chase the nefarious Calder to the Celsian Isles, so you gathered a crew!\nYou navigated the shady underbelly of Nyr to get into the sewers.\n  &5[That's uh... actually pretty close. I wasn't chasing Calder, I was just helping my friend Levyn, however.]\n  &6[Taymian]\n Awesome! Well, I hope this one gives you a real feeling of adventure. I made a few exciting changes.\n  &5[Taymian... Is that lava? Did you seriously actually put lava here?]\n  &6[Taymian]\n It was a great idea and I'm sticking to it. Go find your crewmate!\n&o  C: Get to the bar and find your crewmate! Table\n Taymian (Crewvengers Crewsemble at the Sewer Bar)\n  &6[Taymian]\n You made it!\n  &5[This is the same sewer you showed me during the other memory.]\n  &6[Taymian]\n Yeah, sorry... had some last minute budget cuts and... yeah. That's why the lava was here!\n  &5[I really don't understand why your memory machine isn't showing me my memories.]\n  &6[Taymian]\n Because I made some adjustments! I have to visualize what I'm going to write and let's be real. Your memories? Not gonna cut\nit. But that's not why we're here.\n  &5[Why are we here?]\n  &6[Taymian]\n This was all about your crew, right? With them through thick and thin! [Player], I want to join your crew.\n  &5[No.]\n  &6[Taymian]\n But -\n  &5[No. Get me out of here.]  Header the_end  The End\n&o  C: Speak to Taymian. They are upstairs in Apartment 230. Table\n Taymian (Apt. 230)\n  Coordinates: [-820, 119, 28]\n   &6[Taymian]\n I don't understand. I tell your stories. Why can't I come along with you and live them up close?\n  &5[Taymian, you're not telling my stories. You're telling your own, but stealing from mine while you do.]\n  &6[Taymian]\n What? No!\n  &5[I'm being serious. You've clearly got the drive to tell crazy stories, but you're holding yourself back. You're choosing to\nwrite fanfiction about... me... instead of letting your imagination do its best work.]\n  &6[Taymian]\n I ... You... You might be right... Oh my gods... I could have been writing my real stories all along.\n  &5[Exactly!]\n  &6[Taymian]\n I'll tell my publisher. She's going to be so confused. Oh gods, and my readers... I'll have to kill Atess in the books or\nsomething so people stop asking me about them... Goodness, you've made me feel so free, [Player]! Thank you!\n  &5[You're welcome.]\n  &6[Taymian]\n Well uh, I guess you can go now. Thanks for your time. Most heroes wouldn't have even stopped to talk to me, yet here we are,\nin a weird machine in the hotel room I broke into.\n  &5[You what?! Actually, you know what? I don't care. This isn't my problem.]\n  &6[Taymian]\n That's the spirit! I'll send you a copy of my next book, [Player]. Thanks for everything.\n  '''FINISHED BUSINESS COMPLETE!'''\n  Awarded a sense of satisfaction for helping that weird fanfiction author... Ugh.\n", "reward": "rewards =\n* Awarded a sense of satisfaction for helping that weird fanfiction author... Ugh.\n"}