{"name": "Fred's Bizarre Adventure", "information": "prerequisites = &3Grasp of AvaricePurple Dungeon&r Complete NPC: Fred Celsian Islestown = Steelmeldstarting_npc_coordinates = -442, 14, -497rewards = *&3City of Shifting Waters NPC: Fred Celsian Islestown = Steelmeldstarting_npc_coordinates = -442, 14, -497rewards = *&3City of Shifting Watersstarting_npc_coordinates = -442, 14, -497rewards = *&3City of Shifting Waters Celsian Islestown = Steelmeldstarting_npc_coordinates = -442, 14, -497rewards = *&3City of Shifting Waterstown = Steelmeldstarting_npc_coordinates = -442, 14, -497rewards = *&3City of Shifting Waters", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Fred AlignDefault \n  Color|orange|[Fred]}} \n Oh hello there. Sorry, I don't have much time to talk right now, I'm pretty busy. \n  Color|purple|[Where does this passage way lead?]}} \n  Color|purple|[Who are you?]}} \n  Color|orange|[Fred]}} \n Well, that's the question, now isn't it! You don't seem like you're from around here, mind if I ask who you are? \n  Color|purple|[My name is Player.]}} \n  Color|purple|[I do mind actually!]}} \n  Color|orange|[Fred]}} \nRawInline   Color|purple|[Is there something preventing you from going forward?]}} \n  Color|orange|[Fred]}} \n You mean besides the large iron bars and the obvious signs of structural foundation erosion? Yes actually, there's also a powerful seal keeping the area inaccessible. \n  Color|purple|[Would you like some help?]}} \n  Color|orange|[Fred]}} \n Hmm, I've not hired an assistant in a while... not since the accident that, uh... terminated my last one... So sure, why not! You're hired! \n  Color|purple|[So what's the plan?]}} \n  Color|orange|[Fred]}} \n Here's a little catch up on my research so far. After some careful study on the seal that prevents forward progress, I have found that it might be possible to counter the magical frequency using a Silvic Crystal. \n  Color|orange|[Fred]}} \n Since I'm sure you've brushed up on your geology like all good assistants do, you likely know that Silvic Crystals are exceedingly rare. In fact, the only place I even know they can be found is an area in the west known as the Crystalline Vault, though not many people are brave enough to attempt to enter. \n  Color|purple|[So in short, find the magic crystal in the dangerous vault?]}} \n  Color|orange|[Fred]}} \n As sharp as I would expect! Let us head there forthwith! \n  Color|purple|[Us?]}} \n  Color|orange|[Fred]}} \n Yes, us! Why would I not come with you? Have your previous employers sent you off to dangerous places on your own? How careless!  \n&o  Head to the Crystalline Vault with Fred. \n Retrieve the Silvic Crystal and talk to Fred. Table  AlignDefault ColWidthDefault AlignDefault \n Fred AlignDefault \n  Color|orange|[Fred]}} \n Fantastic, this is just what we need! Kinda... \n  Color|purple|[What do you mean 'kinda'?]}} \n  Color|orange|[Fred]}} \n Well, there's a catch. The Silvic Crystal is gonna need a bit of tuning before it can properly negate the magic from the seal. Luckily, I have just the device to do so! \n  Color|purple|[Well, that's eas-]}} \n  Color|orange|[Fred]}} \n That you are going to have to get working in dramatic fashion! \n  Color|purple|[Of course...]}} \n  Color|orange|[Fred]}} \n To the Stone Fred!  \n&o  Help Fred attune the crystal. \n Solve the puzzle by getting the water into the 4 exits and holding the pressure plate down for 10 seconds. Table  AlignDefault ColWidthDefault AlignDefault \n Fred AlignDefault \n  Color|orange|[Fred]}} \n Fantastic! The crystal is ready, go grab it and we can head out! \n  Color|orange|[Fred]}} \n Are you ready to head back to the structure? \n  Color|purple|[Yes, let's go.]}} \n  Color|orange|[Fred]}} \n Well, it's the moment of truth. We've got a perfect crystal, a ruined structure, and a whole lot of anxiet- I mean, luck. Go and place the crystal on the pedestal and let's see what happens.  \n Place the new crystal on the pedestal. \n Proceed through the POI and enter the dungeon entrance. Table  AlignDefault ColWidthDefault AlignDefault \n Fred AlignDefault \n  Color|orange|[Fred]}} \n Whew! What a journey! It seems like we've reached a safe point before the passage continues onward. I am so eager to find out what lies below here. \n  Color|purple|[What do we do now?]}} \n  Color|orange|[Fred]}} \n I've called in some assistance from some other researchers in Steelmeld. I'm sure they will be thrilled to see what we've discovered! But now, we only look forward, my faithful assistant. We've only just begun this bizarre adventure!    AlignDefault \n FRED'S BIZARRE ADVENTURE COMPLETE! SoftBreak  Awarded a   Link   Shifting Waters City_of_Shifting_Waters wikilink key, and access to The   Link   City of Shifting Waters City_of_Shifting_Waters wikilink dungeon.  ", "reward": "rewards = *&3City of Shifting Waters|Shifting City&r Key\n*Access to The &3City of Shifting Waters&r Dungeon Teleporter"}