{"name": "Harmonic Convergence", "information": "prerequisites = &3The Lost Empire&r NPC: Harmonious Spirit Celsian Islestown = Frostgatestarting_npc_coordinates = -1560, 95, 952rewards = *Pink Shulker Box\n*&3Harmonic Arboretum NPC: Harmonious Spirit Celsian Islestown = Frostgatestarting_npc_coordinates = -1560, 95, 952rewards = *Pink Shulker Box\n*&3Harmonic Arboretumstarting_npc_coordinates = -1560, 95, 952rewards = *Pink Shulker Box\n*&3Harmonic Arboretum Celsian Islestown = Frostgatestarting_npc_coordinates = -1560, 95, 952rewards = *Pink Shulker Box\n*&3Harmonic Arboretumtown = Frostgatestarting_npc_coordinates = -1560, 95, 952rewards = *Pink Shulker Box\n*&3Harmonic Arboretum", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Harmonious Spirit AlignDefault \n  Color|orange|[Harmonious Spirit]}} \n A utopia for but a few, or so they said. Yet here I am, stuck in my misery. Was I forsaken, or was I right all along? \n  Color|purple|[I'm sorry to interrupt your eternity of suffering, but what are you talking about?]}} \n  Color|purple|[Good luck with your problems, ghost.]}} \n  Color|orange|[Harmonious Spirit]}} \n ...You can see me? No one has been able to see me before... which is largely why I don't have to pay rent. \n  Color|orange|[Harmonious Spirit]}} \n Hm. Perhaps you have a strong connection to souls. My tale is long, do you wish for the entire story, or the short version? \n  Color|purple|[The short version.]}} \n  Color|purple|[The long version.]}} \n  Color|orange|[Harmonious Spirit]}} \n Well, you are getting the long version- I need to vent. \n  Color|orange|[Harmonious Spirit]}} \n My people lived in harmony with the world. We split into four groups, each aligned to a season. Part of our duty was to protect our greatest treasure, an item of immeasurable power. \n  Color|purple|[A wool?]}} \n  Color|purple|[What was it?]}} \n  Color|orange|[Harmonious Spirit]}} \n I really don't remember- none of us on the outside did. However, those inside knew, and every year they chose one person from each of the four groups to join them inside. Once inside, they would grant their people all sorts of wonderful gifts and blessings. It was an honor to be chosen... for most, anyway. \n  Color|purple|[Most?]}} \n  Color|purple|[So you weren't happy.]}} \n  Color|orange|[Harmonious Spirit]}} \n Indeed, I was happy in my village. I neither wanted to leave, nor did I trust those that had went before me. I can't really say why, but something felt off about the whole thing. There were too many unanswered questions. I fought against the system.  \n&o  1/4 - Visit the Spring Shrine. \n&o  2/4 - Visit the Summer Shrine. \n&o  3/4 - Visit the Fall Shrine. \n&o  4/4 - Visit the Winter Shrine. \n Once you completed all four shrines, return to the Harmonious Spirit. Table  AlignDefault ColWidthDefault AlignDefault \n Harmonious Spirit AlignDefault \n  Color|orange|[Harmonious Spirit]}} \n You return. Have you had success? \n  Color|purple|[I have visited all four shrines.]}} \n  Color|orange|[Harmonious Spirit]}} \n Yes, I detect the blessings upon you. You are now ready to enter the Arboretum. At one point, it served as a rite of passage for my people to travel to the Arboretum's doors, but I dare not guess what it is like now. \n  Color|purple|[Couldn't I have just broken inside?]}} \n  Color|orange|[Harmonious Spirit]}} \n No... I mean technically? However, if something dangerous had been in there, it might have been able to escape if you had gone about it that way. In addition you wouldn't have been recognized by the magic of the area and would find it difficult to attune the teleporters to get back out. Regardless, you will need to head through the Sealed Descent to get to the Arboretum.  \n&o  Go through the Sealed Descent to get to the Arboretum. Table  AlignDefault ColWidthDefault AlignDefault \n Harmonious Spirit AlignDefault \n  Color|orange|[Harmonious Spirit]}} \n You have arrived. This is the entrance to our most sacred of sites- I have built this area to serve as a sort of lobby for you. Please, enter the Arboretum and take what lies within, whatever that might be. Be on your guard, however- I died in there, after all.   AlignDefault \n HARMONIC CONVERGENCE COMPLETE! \n Awarded a   Link   Pink Harmonic_Arboretum wikilink Key, a Pink Shulker Box, and Full access to the   Link   Pink Harmonic_Arboretum wikilink Dungeon Trader.  \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *Pink Shulker Box\n*&3Harmonic Arboretum|Pink&r Key\n*Full access to &3Harmonic Arboretum|Pink&r Dungeon Trader"}