{"name": "His Faithful Servant", "information": "prerequisites = * None\n NPC: Cadeus Coords: -336 87 -719\n Architect's Ring Galengarde\nDifficulty = Medium\nLength = Very long\n", "dialogue": "  WorkInProgress|Missing dialogue at end. Could reword shrine part.\n&o  Search for Shrines across the Architect's Ring. Table\n Cadeus\n  Coordinates: [-336 87 -719]\n   &6[Cadeus]\n Ah, traveler. You're the newcomer the council has been meeting with.\n  &5[Yes.]\n  &6[Cadeus]\n Their interest in you is well-earned. I sense power in you, like that of this shrine I tend to.\n  &5[The shrine - what is it?]\n  &6[Cadeus]\n You truly have not been here long. These totems channel the gifts of Harrakfar. The pool grants us boons from him.\n  &5[Who is Harrakfar?]\n  &6[Cadeus]\n God. After our people fled the ruin of the Silvari empire, those of the wood showed us the true path - that walked by the Great\nWolf. Some more... primitive Dichen still follow the Gods of the Silvari, however.\n  &5[Ah. Tell me more about those boons you mentioned.]\n  &5[Who are the Gods of the Silvari?]\n  &6[Cadeus]\n This is a holy place. We will not speak of such.\n  &5[Ah. Tell me more about those boons you mentioned.]\n  &6[Cadeus]\n I am a purveyor of holy vessels, that capture the lifeblood of Harrakfar. Cast a vessel into the pool, along with materials\ntied to this land, and you will be given a gift - infused liquid, that can grant you greater power.\n  &5[Can I have some of those vessels?]\n  &6[Cadeus]\n You seem pious enough, for a newcomer. You may have three, and one of the materials. Partake of the Wolf's power, and see for\nyourself that he is great.\n&o  C: Throw a Vessel of Boons and a Fenian Flower into the Shrine Pool to receive a blessing. You can purchase Vessels of Boons\nfrom Caedus, and obtain Fenian Flowers from   Link   Wolfswood Wolfswood wikilink Delve POIS.\n After throwing in one Vessel of Boons and a Fenian Flower:\n&o  C: Partake of Harrakfar's power by drinking the blessing.\n After drinking the blessing: Table\n Cadeus\n  Coordinates: [-336 87 -719]\n   &6[Cadeus]\n Ah, you've been granted His boon. Now, you see his majesty?\n  &5[Yes. Thank you, Cadeus.]\n  &6[Cadeus]\n You're welcome newcomer. Oh - what is your name?\n  &5[Player]\n  &6[Cadeus]\n Welcome, [Player]. To the fold of the Great Wolf.\n&o  C: There has to be more than one   Link   Shrine Shrines wikilink in the Region, find another and return to Cadeus.\n (Boon of Silver Scales. Doesn't matter as it only changes the player's choice wording.) Table\n Cadeus\n  Coordinates: [-336 87 -719]\n   &6[Cadeus]\n Ah, [Player]. Now that you've received his boon, you should learn more about Harrakfar. His gifts only come to those who are\nworthy, yes? Come, I will teach you more.\n  &5[Yes, I'd like to learn more about Harrakfar.]\n  &6[Cadeus]\n Good. Harrakfar, eons ago, brought life to this land. He created people, like you and me, and where he walked the trees of the\nwood sprouted up behind him.\n  &5[You said he was a wolf. How could a wolf do that?]\n  &6[Cadeus]\n He showed himself to us, his people, as a wolf. But his form could shift. Either way, his body was massive, and taller than the\ntreetops. And of course, he had great power.\n  &5[Is he still alive?]\n  &6[Cadeus]\n Yes. While we believe his body was imprisoned, his formless spirit is all around us - the proof is in this pool. The totem\ndraws his power to this place, as you experienced.\n  &5[Imprisoned? How'd that happen?]\n  &6[Cadeus]\n Such theories are more... comparative, then you are like to understand. It combines some Silvari theology with that of the\nAradia - the people of the wood. Perhaps return once you've visited those peoples, though I expect it will take you quite a\nwhile.\n  &5[I have some experience with imprisoned gods.]\n  &6[Cadeus]\n Bah. You have power, but to have touched the soul of such an artifact... no, I refuse to believe you ever have.\n  &5[I found another shrine like this one.]\n  &6[Cadeus]\n Oh? Hm, perhaps in the Fen, where the Coven live? Or their less... violent cousins, our friends the Aradia? They erect totems\nlike these- taught us how to do so, in fact.\n  &5[No. Close to the black castle on the cliff. It had a statue of some sort of legged serpent on it.]\n  &6[Cadeus]\n Hm? Are you sure you're recalling correctly? Harrakfar's power is the only power in these woods. All others are dead and gone.\n  &5[I am. I saw it with my own eyes.]\n  &6[Cadeus]\n You seem so sure... yet I doubt you all the same. If these shrines exist, then where are their blessings? Bring back one to me,\nwith those bottles I gave you earlier - then I may believe.\n  &5[I'm out of bottles.]\n  &6[Cadeus]\n Fine. You may buy more from me if you wish - not even priests give everything for free.\n&o  C: Bring a Shrine Blessing to Cadeus. Table\n Cadeus\n  Coordinates: [-336 87 -719]\n   &6[Cadeus]\n [Player]. Have you brought a sample for me, of these supposed blessings?\n  &5[No. I'll get one.]\n  &6[Cadeus]\n Make haste. I don't enjoy doubting you, but these other shrines seem so impossible.\n  &5[Yes - here it is.]\n  &6[Cadeus]\n Oh Wolf... this liquid does pulse like that of my shrine. Yet its coloring is so different... could this truly be of another...\none like you? Or something other?\n  &5[I can search for more blessings like this if you'd like.]\n  &6[Cadeus]\n Yes... yes. I must know more. I will search the Dichen libraries, our books on theology should cover even these forgotten Gods.\nIf you can seek out the shrines and describe them to me, I should be able to identify them. Will you help me in this?\n  &5[I can't right now, I'm sorry.]\n  &6[Cadeus]\n Well. I'm disappointed, but if you change your mind, return to me. There's work that should be done here.\n  &5[Yes. I'll help you.]\n  &6[Cadeus]\n Oh thank you. Now go, look for more shrines. You can buy additional bottles from me, if you need them. Religious curiosity is\nnice, but rings sustain the mind that thinks, yes? Now, hurry on.\n&o  C: Find   Link   Shrines Shrines wikilink in the Architect's Ring, then return to Cadeus.\n (Dialogue after finding every shrine. You just need to find them, no need to get a boon.) Table\n Cadeus\n  Coordinates: [-336 87 -719]\n   &6[Cadeus]\n Ah, hello [Player]. Have you found any new shrines yet? My faith makes me wary, but my curiosity compels me to ask.\n  &5[No, I'd like to hear again about a shrine I already found.]  Plain  (Same dialogue as below, but for after you've already\nselected them.)\n  &5[Yes, I've found a new shrine.]\n  &6[Cadeus]\n Ah! Thank you. Describe it to me, yes?\n  &5[It was on the far end of a broken bridge. It felt like the stars were everywhere...]\n  &6[Cadeus]\n Ah. I know of this bridge. It was built by the ancient predecessors to the Silvari, and led to a grand fortress at the top of\nthe Ring, between the Eastern and Western continents. The fortress has been empty for thousands of years, and the bridges were\nbroken in a war. I don't know of these stars you speak of though. If a new power is emerging there I'd be quite interested. It's\nsaid that the fortress was the throne from which the gods of the Silvari controlled the entire Ring... heresy, of course, but\nsuch information is tantalizing.\n  &5[It was in a church next to the slums in the Keep, and in front of a knight statue.]\n  &6[Cadeus]\n Mmm, yes, a known god. The Silver Knights. I do not wish to speak of them much. They are the gods of the Ashkii, and the\nSilvari before them. Beings clad in Iridium armor. Brutal and violent, the sworn enemy of Harrakfar. You may learn more about\nthem from the Ashkii, if you wish, but I am sworn to the Great Wolf, and therefore must decline to teach you more.\n  &5[It was close to the black castle on the cliff. It had a statue of some sort of legged serpent on it.]\n  &6[Cadeus]\n Ah, I need not look through books for this shrine. The Silver Knights are often associated with images of dragons, this must be\na shrine to them. You likely know of them already if you've been on the Ring for long. Ancient beings, clad in suits of iridium\narmor. They occupied the forest eons ago, and the Ashkii still worship them. The true connection between the knights and dragons\nis unknown though. More study may be required here.\n  &5[It was secluded in a cave near the Mycelia camps, and was made of oily dark stone.]\n  &6[Cadeus]\n Let me look through these papers for a moment...\n  &6[Cadeus]\n Hmm. Yes. This ancient Coven tome seems to have some answers. This god is something more... otherworldly. A Coven leader was\napparently entranced by this god, and departed with her sect of the Coven to find him. The text mentions the cultural\nimplications more than the theology though. The nature of the god itself seems cryptic. If its power has begun to reemerge...\nthat is most disturbing.\n  &5[It was near where the Coven live, but there was no totem - only a menacing red pit.]\n  &6[Cadeus]\n Ah, this is a more modern, and dismissable, 'God'. Occasionally the Coven's great hex becomes... temperamental. It harnesses\ngreat energy, and when that discharges, it can create malignant life: growing from nothing, and subsisting off of pure mana.\nThis... pit, was one of those creatures. But as for who would worship it, I know not. Perhaps some living on the fringes in the\nFen. The Coven does not control all of that vile swamp.\n  &5[It was deep in a cave, surrounded by glowing crystals.]\n  &6[Cadeus]\n Let me see...\n  &6[Cadeus]\n Ah, the Mycelia. These observations the Aradia conducted on their religion are revealing. It seems these crystals are excellent\nat absorbing mana, which the Mycelia have great need of. They make pilgrimage to the caves to harvest the mana in the crystals,\nand to worship them it seems. Them, or some greater God of crystal they believe to be the source of their growth. As for what\nthe Mycelia need so much distilled mana for, I do not know.\n  &5[It was underneath a stone structure in the Keep, and there was a strange, but friendly creature watching over it.]\n  &6[Cadeus]\n Hm. Let me look at these papers...\n  &6[Cadeus]\n There is no record of such a shrine here. Whatever God this is, it must be a more modern development. I have heard tales from\nacross the Ring about similar creatures to those that you describe however. Perhaps once you explore those lands, you may figure\nout more.\n After having visited and asked about every shrine: Table\n Cadeus\n  Coordinates: [-336 87 -719]\n   &6[Cadeus]\n [Player], I don't know whether to thank you or to denounce you. Harrakfar was the only God in these woods. The emergence of\nthese other powers is distressing to say the least. But my faith is still strong.\n  &5[Why worship Harrakfar when there are so many other Gods like him?]\n  &6[Cadeus]\n Has this journey taught you so little? I worship Harrakfar not because I do not know of any other, but because Harrakfar is my\nGod. Just as he owns me, I own a bit of him. Harrakfar is alive in the stories I tell, in the forest I live in, and in the\nculture I am from. Other Gods may be reemerging, yes, but there is no other God who is mine.\n  &5[Hm. I feel that I can understand that.]\n  &6[Cadeus]\n I'm glad. And thank you for your help. I'd offer you more vessels but... these do not come cheap! To hold the essence of a God,\none needs quite strong materials, yes? Ha! {...}\n  &5[I don't see what you're saying, but thank you for your help.]  Plain  (Missing)\n  He pauses for a moment.\n {...}\n  &6[Cadeus]\n ... Ah, but I suppose your insight on these powers must be worth something. Hm... Very well. Just this once, I will give you\nthese vessels as a gift. Use them well, friend.\n  '''HIS FAITHFUL SERVANT COMPLETE!'''\nLineBreak   Awarded [[Wolf's Rosary]] and 3 Vessels of Boons!\n", "reward": "rewards =\n* &3Wolf's Rosary&r\n* 3x &3Vessel of Boons&r\n"}