{"name": "Into the Woods", "information": "prerequisites = * Either &3Ring Around the Rose&r\n* or &3The Tomb of Time&r\n NPC: Dockmaster Hromae Coords: -471 40 -802\n Architect's Ring Port Manteau\nDifficulty = Medium\nLength = Long\n", "dialogue": "&o  Listen to the instructions to find   Link   Galengarde Galengarde wikilink  .\n&o  C: What a beautiful port town! There has to be a dockmaster or someone who can help you figure out where to go next. Table\n Dockmaster Hromae\n  Coordinates: [-471 40 -802]\n   &6[Dockmaster Hromae]\n Salu! You seem like a fresh face around here. Who are you?\n  &5[I'm [Player]. Where exactly am I?]\n  &6[Dockmaster Hromae]\n You're in Port Manteau, the gateway to the Architect's Ring. How exactly did you come to be here?\n  &5[I stepped through a strange portal I found under the Celsian Isles and found myself in a cave nearby.]\n  &6[Dockmaster Hromae]\n Oh, the usual magic stuff then. I assume you found another of the old Silvergates then. Seems to be how a lot of folks get\nhere. Anyway, welcome. I suppose I could send you in the right direction to get acquainted with the area then.\n  &5[My crewmates and I traveled here following a lead from a professor named Walthan.]\n  &6[Dockmaster Hromae]\n Oh... Yeah, I know that name. He didn't come with you, did he? Caused quite a ruckus the last time he was around... Anyway,\nwelcome. I suppose I could send you in the right direction to get acquainted with the area then.\n  &5[That would be lovely.]\n  &6[Dockmaster Hromae]\n You're free to spend some time in the Port here, but we don't get too many ships. We do plenty of fishing though, if that's\nsomething you're into. More importantly though, if you follow the dirt path along the coast to the west, it'll lead you up the\nhill to the Dichen capital of Galengarde.\n  &5[Dichen?]\n  &6[Dockmaster Hromae]\n Unn... Yes, Dichen. That is what we are. Do you really know nothing of this place?\n  &5[Not a thing.]\n  &6[Dockmaster Hromae]\n Wild. Well, head along the path then. When you get to Galengarde, it's going to be a bit overwhelming. Feel free to wander\naround, but you're going to need to find the Customs Office at some point. They'll set you straight. Nice meeting you.\n&o  C: Head to the Customs Office and find someone to help you. Table\n Customs Officer Linea\n  Coordinates: [-374 79 -728]\n   &6[Customs Officer Linea]\n Take a number.\n  &5[What?]\n  &6[Customs Officer Linea]\n From the dispenser. Take a number and wait your turn.\n  &5[Um okay... I guess I've got number 90451.]\n  &6[Customs Officer Linea]\n Great.\n  &5[How long will this take?]\n  &6[Customs Officer Linea]\n Couldn't tell you. We're very busy.\n  &5[So am I! Don't you know who I am?]\n  &6[Customs Officer Linea]\n I do. You're ticket number 90451.\n  &5[Ugh... Bureaucrats...]\n  &6[Customs Officer Linea]\n Enjoy your wait. There's some seats you can wait in nearby. Just swing at them and they'll let you sit...\n&o  C: Take a seat and... wait?\n  You sit down to wait. Too much time starts to pass and you begin to doze off... {...\n }\n  Hail, hero... Pray thee hear me. I have been... trying so hard... to reach out... Harrakfar is... in... danger... and so... am\nI...\n  {...  } Table\n Customs Officer Linea\n  Coordinates: [-374 79 -728]\n   &6[Customs Officer Linea]\n Number 90451! Number 90451!\n  &5[That's me!]\n  &6[Customs Officer Linea]\n Step up please. State your business.\n  &5[I was sent up here by Dockmaster Hromae in what I'm starting to think was an elaborate joke.]\n  &6[Customs Officer Linea]\n It was not a joke. All newcomers to Galengarde are required to present at the Customs Office. Again, what is your business\nhere?\n  &5[I came through a portal in the Celsian Isles and wound up here.]\n  &6[Customs Officer Linea]\n I see. What do you intend to do here?\n  &5[I came here following a potential lead from a Professor called Walthan.]  Plain  (Missing)\n  &5[Hopefully find somewhere to set up with my crew and begin exploring the area.]\n  &6[Customs Officer Linea]\n This seems acceptable to me. You need space for your crew you said? And who exactly are you?\n  &5[Wait, I thought you said you knew who I was.]\n  &6[Customs Officer Linea]\n I was being facetious. Who are you?\n  &5[My name is [Player]. I've been gathering Wool from across the world and have been involved in major events in the King's\nValley and the Celsian Isles in various ways.]\n  &6[Customs Officer Linea]\n Oh, you're a hero. I see. It's concerning to hear mention of Wool, but perhaps you can be of help to the Primirium eventually.\nI accept your application to enter the Architect's Ring. That will be 8722 Archos Rings.\n  &5[Excuse me? What are those?]\n  &6[Customs Officer Linea]\n Oh my stars, you don't even have currency?\n  &5[Do you accept Hyperexperience or Hyper Crystalline Shards?]\n  &6[Customs Officer Linea]\n No.\n  &5[Oh.]\n  &6[Customs Officer Linea]\n You can work your debt off. Head to the center of the city and find the Centralized Contract Office up one of the\nwindlaunchers. They'll have some work for you and your little crew and perhaps can help you set up a base of operations as well.\n  &5[Thank you?]\n  &6[Customs Officer Linea]\n Welcome to Galengarde, 90451.\n&o  C: Head to the Centralized Contract Office to start working off your debt. Table\n Agent Naomi\n  Coordinates: [-319 91 -633] (Way up is by TP Hub. [-307 81 -644])\n   &6[Agent Naomi]\n Welcome to the Centralized Contract Office in the great city of Galengarde. How may I be of assistance?\n  &5[Hi, I'm [Player]. I was sent here by Linea with the intent of finding a base of operations for my crew... and paying off\nsome debt?]\n  &6[Agent Naomi]\n Wonderful, I can do both of those things for you. I received word from Linea while you were on your way here. Why don't I get\nyou started on some work around town while I negotiate a place for your team and a meeting with the Primirium for you?\n  &5[Oh, yes. That is way easier than I was expecting it to be.]\n  &6[Agent Naomi]\n Linea has a lot going on, I know. Feel free to look around the Central Plaza here if you'd like. It should have plenty of\nresources desired by anyone known for heroics. However, once done, I'd like you to head to the outskirts of the city to meet\nwith one of our farmers, Abell.\n  &5[What can I do for him?]\n  &6[Agent Naomi]\n He's been having trouble with his farming storage operation, The Joure Barns. He needs some help with his sorting mechanism.\n  &5[I am on it.]\n  &6[Agent Naomi]\n Return to me when you're all done.\n&o  C: Head to The Joure Barns and assist Abell. Table\n Abell\n  Coordinates: [-257 73 -691]\n   &6[Abell]\n Salu friend! You must be from the Contract Office! I'm Abell, a farmer for Galengarde. This area of the city grows crops and\nhelps distribute them to the inhabitants to keep this place running. Without us, we'd be fending for scraps in the depths of the\nWolfswood.\n  &5[Hi Abell. I'm [player]. Naomi sent me over.]\n  &6[Abell]\n Indeed! I need help getting my sorting machines functioning properly.\n  &5[Happy to help. Let's get started.]\n  &6[Abell]\n Thank you!\n  Sort 15 items. Just hit left or middle if it matches left or middle. Otherwise hit right.\n  After finishing:\n  &6[Abell]\n Ay, you've done it! Hourrah, merce! I'll send word to Naomi, with my thanks. Just press that button by the ladder to open the\ntrapdoor.\n&o  C: Head back to Naomi for your reward! Table\n Agent Naomi\n  Coordinates: [-319 91 -633] (Way up is by TP Hub. [-307 81 -644])\n   &6[Agent Naomi]\n I hear you were a great help to Abell. Wonderful.\n  &5[So, does that pay off my debt?]\n  &6[Agent Naomi]\n Ha! No. There's plenty more to be done, ami. Warden Dredsen in the Marketplace needs some help making some deliveries next.\nCould you go meet him there please?\n&o  C: Help Dredsen make deliveries in the Galengarde Marketplace. Table\n Warden Dredsen\n  Coordinates: [-292 83 -659]\n   &6[Warden Dredsen]\n Greetings. You must be the grunt sent to help me with today's deliveries. I need a hand getting packages to the various shops.\nI'm working a solo today and can't leave the crates here to go bring them to the merchants.\n  &5[So this is where I come in?]\n  &6[Warden Dredsen]\n This is where you come in. I hand you the packages, you bring them to the merchants. You come back once you're all done. Ready\nto work?\n  &5[I am.]\n  &6[Warden Dredsen]\n Bein. Let's do it.\n Talking again: Table\n Warden Dredsen\n  Coordinates: [-292 83 -659]\n   &6[Warden Dredsen]\n Did you lose the packages?\n  &5[Yes.]\n  &6[Warden Dredsen]\n Worry not, I have extra.\n  &5[No.]\n  &6[Warden Dredsen]\n Then hurry and deliver them! The merchants are waiting for their goods.\n  Weapons Crate - [-264 78 -648] LineBreak  Food Crate - [-272 80 -656] LineBreak  Block Crate - [-252 83 -674] LineBreak  Arrow\nCrate - [-291 90 -687] LineBreak  Magic Supplies Crate - [-280 89 -678] LineBreak\n  After completing deliveries: Table\n Warden Dredsen\n  Coordinates: [-292 83 -659]\n   &6[Warden Dredsen]\n Alos, there we are then. All done. Will let Naomi know you did your job well.\n&o  C: Head back to Naomi for your reward? Table\n Agent Naomi\n  Coordinates: [-319 91 -633] (Way up is by TP Hub. [-307 81 -644])\n   &6[Agent Naomi]\n Great work out there [Player]. I've nearly got a place secured for you, I think. For now, I think I've got one last major task\nfor you. It's a bit of an ask, but I think you can handle it.\n  &5[What is it?]\n  &6[Agent Naomi]\n I'm sure you've noticed the windlaunchers around the city. There's one leading to my office! However, the central windlauncher\nthat leads to the upper reaches of the tree isn't functioning, and the air current at the top needs a refresh. The windjar I'll\nbe giving you won't stay contained for long though. You'll have to get to the top quickly. Plan out a route and move\nefficiently!\n  &5[I'll need a bit to plan a route.]\n  &6[Agent Naomi]\n That's okay. Let me know when you're ready.\n  &5[I'm ready.]\n  &6[Agent Naomi]\n Alright, here's your windjar. May the winds be with you!\n After completing the race:\n  &6[Agent Naomi]\n YOU DID IT! HOP BACK DOWN AND LET'S CHAT!\n&o  C [1/2]: That must be enough work by now. Go ask Naomi for your reward.\n&o  C [2/2]: Well, at least Naomi said that was the last task. It's time to talk to the Primirium. Table\n Agent Naomi\n  Coordinates: [-319 91 -633] (Way up is by TP Hub. [-307 81 -644])\n   &6[Agent Naomi]\n You did it, wonderful. I think it's about time you got to talk with the Primirium. If you jump back up the windlauncher you\njust activated, their office is ahead. You've earned your meeting for sure.  Table\n Primirium Tybale\n  Coordinates: [-316 181 -672]\n   &6[Tybale]\n Welcome, traveler. We've heard of your arrival and believe this meeting will be fruitful. I'm Tybale, Master of Economy.\n  &5[Hello, I'm [Player]. You three must be in charge of this island?]\n  &6[Conquort]\n Not the entirety of the Ring, no. Just Galengarde at the moment. I'm Conquort, Master of Defense. And Offense. Battle, really.\nI'm particularly good at planning the movement of the troops, so perhaps Master of Troops? {...}\n  &6[Verdanne]\n You're the Master of Defense, Conquort. No need to add more titles. I am Verdanne, Master of Policy. According to substatute\n103.55d of Galengarde common law, I will now recite the traditional welcoming dirge of the Dichen people— {...}\n  &6[Tybale]\n Thank you, Verdanne. You can do that when we're finished with our current business. We brought you here to discuss what role\nyou and your crew will play in the Architect's Ring.\n  &5[I'm not really sure of that myself.]\n  &6[Verdanne]\n We understand that you've arrived here less by purpose and more by chance, but based on your history in the Celsian Isles and\nthe Kaulsland, you seem to have at least some parting knowledge of the Silver Knights and their prisoners.\n  &5[Um, yes. What do you know?]\n  &6[Verdanne]\n This area is steeped in the history of the Silver Knights. We don't really have all day for a history lesson, but just know\nthat the people of the Architect's Ring are well familiar with the damage the Silver Knights and the prisoners can do. {...}\n  &6[Conquort]\n Now, we have a task we'd like to propose to you. You can do it for the goodwill and partnership we offer here, but we'll also\npay you for this task to lower your debt to the city, which I'm sure will help sweeten the deal, right? You hero types tend to\nbe very money focused...\n  &5[What's the task?]\n  &6[Conquort]\n I've received intel that the Coven has requested a meeting with the Mycelia.\n  &5[Huh?]\n  &6[Conquort]\n The Coven are our primary enemies here in the Wolfswood. They are vile witches, casting a mighty curse on these lands. We seek\nto destroy them, take the Favor of the Wolf, and claim dominion over their home base, the Tree of Life. The Mycelia are, for\nlack of a better descriptor, mushroom people. {...}\n  &6[Tybale]\n They're incredibly dangerous and have no allies in these lands, rejecting any who seek them. Intel pointing us to a meeting\nbetween our greatest enemy and the nastiest group in the Wolfswood is not exactly good news.\n  &5[I see. What's the Favor of the Wolf?]\n  &6[Verdanne]\n The Favor though... We're not entirely sure what form it takes. Many centuries ago lived a mighty god, the wolf, Harrakfar. He\nroamed these lands, bringing life to all he touched, and death to those that deserved it. It is where the name Wolfswoods came\nfrom.\n  &5[So where is he?]\n  &6[Verdanne]\n Harrakfar died in a great battle with the Silver Knights that freed these Woods from their control. The Coven claims they still\nhold his favor however, and the Hex they have cast lets them draw power from it.\n  &5[So what do you need me to do?]\n  &6[Conquort]\n As much as I'd love for you to go rain down hellfire on this meeting, we'd like you instead to travel to the area known as\nLocum Vernantia and spy on this meeting.\n  &5[I'm in. Anything I need to know?]\n  &6[Verdanne]\n Yes. Locum Vernantia is home to a cult of sorts, the Porphyry. They are male members of the Coven, gifted in darker, more\nearthen magics than the women that run the Coven. They will be dangerous foes as you infiltrate its deepest reaches. {...}\n  &6[Tybale]\n Return to us with any information you can gather. Should you be successful, perhaps I'll cook some nice fish for us to enjoy.\nI'll be heading back to Manteau until your return. The waters are inviting today...\n  &5[Will do. I don't usually get fed on these missions!]\n  &6[Verdanne]\n Good luck, [Player]. Go now, with the blessing of the Primirium at your back.\n&o  C: Infiltrate   Link   Locum Vernantia Locum_Vernantia wikilink so you can spy on the meeting between the Coven's Prophyry\nsect and the Mycelia. Table\n Quorent\n  Coordinates: [-747 35 -540]\n   &6[Quorent]\n Balsalm, is that you?\n  &5[No, sorry. I'm [Player]. What happened to you?]\n  &6[Quorent]\n The Mycelia... poison... It's always poison with them.\n  &5[Why did they poison you? How did they get here?]\n  &6[Quorent]\n Were you... not at the meeting? It should have gone well... We gave them what they asked for...\n  &5[What do you mean?]\n  &6[Quorent]\n By the Tree, you must be low ranking Porphyry. I'm blind, you fool. The talks went south and the cursed mushrooms attacked us.\nThey spewed poison into our ranks and killed our negotiators.\n  &5[What were... we... meeting with them for?]\n  &6[Quorent]\n The Ladies of the Council have need of a mighty extract only the Mycelia control. The Great Hex draws ever closer. There is so\nmuch power in the Tree of Life, and only Hycenea herself can claim it all for her great purpose.\n  &5[So we failed? The meeting was useless?]\n  &6[Quorent]\n Ha! Hahaha! Of course not. You think me weak? The fools brought some with them though. I got some. I got it! I, Quorent, did\nwhat none of the others could. I grabbed some, and before those beasts could stop me, I smashed the phial into my face. I feel\nit still, mixing deep into the humour of my eyes. Once the Council reaches me, they may take my eyes to get what they need. It\nis their right. I am theirs to take...\n  &5[I see.]\n  &6[Quorent]\n Even in this eternal darkness, I see more than ever before. It is my purpose to serve!\n  &5[Perhaps your purpose should end here [Kill him now]]\n  &6[Quorent]\n Yes... You do that, outsider. I know what you are. But you cannot stop the inevitable...\n  You run the Porphyry through, leaving him to perish.\n  There is no reply. The Porphyry witch is clearly dead. His corpse has begun to rot - small mushrooms creeping up his legs and\narms...\n  &5[I'll leave you to the darkness then [Let him die from his injuries]]   Plain  (Missing)\n&o  C: Report back to the Primirium with what you have learned... for your reward??? Table\n Primirium Tybale\n  Coordinates: [-316 181 -672]\n   &6[Verdanne]\n The hero returns!\n  &5[Hello, Primirium. I'm back with news.]\n  &6[Conquort]\n What did you find? Did you manage to thin the Porphyry troops as well? How many are surviving? I need to update my numbers.\n  &5[I have no idea... I found the aftermath of the meeting and managed to get information from a dying cultist.]\n  &6[Tybale]\n So, what did you find?\n  &5[First - did you bring fish?]\n  &6[Tybale]\n ...Yes.\n  &5[Okay, so I was told they were meeting with the Mycelia to obtain an extract, but the talks dissolved, the Mycelia poisoned\nand attacked them, and most of the cultists died.]\n  &6[Conquort]\n This is excellent news!\n  &5[But the dying cultist preserved some of the extract in his eyes, blinding himself...]\n  &6[Conquort]\n Oh lovely. Did you bring them?\n  &5[I... what?!]\n  &6[Conquort]\n You just left him where the Coven could find him?! This is a disaster, [Player]. They will find the corpse. They will find the\nextract. They WILL continue their Hex to drain the Tree of Life and they WILL use the power of Harrakfar to destroy us.\n  &5[And they're DRAINING the Tree of Life? No wonder you guys are at war. My crew and I are here to help in any way we can.]\n  &6[Verdanne]\n Thank you for your pledge, [Player]. We need all the help we can get. Let us sit on the news you've brought us and we shall\ncontact you when we have a plan. Thank you for all you have done. Your permit for a home base has been granted. Now, for the\nceremonial Pledge of Thanks for your assistance to Galengarde, as dictated by the Law per subheader Gratitude Payments. Let's\nsee here... Aha!\n  '''INTO THE WOODS COMPLETE!'''\n  Awarded a home base in Galengarde for your crew above the Food Shop, Shroombane, 4 Mungfish, 1 Hyperchromatic Archos Ring, and\n2000 Archos Rings... of your debt removed. Only 6722 left!\n", "reward": "rewards =\n* Awarded a home base in Galengarde for your crew above the Food Shop\n* &3Shroombane&r \n* 4 Mungfish\n* 1 Hyperchromatic Archos Ring\n"}