{"name": "Into Thin Air", "information": "prerequisites = &3Starriest Night&r\n NPC: Xenith Coords: -1609, 122, 17\n King's Valley Oceangate\nrelated_poi=&3Cloud Piercer&r, &3Cathedral of the Deep&r\n", "dialogue": "}} \n  WorkInProgress|Maybe missing some Xenith dialogue after you return from Cloud Piercer, }} Table  AlignDefault ColWidthDefault AlignDefault \n Xenith \n  Coordinates: [-1609, 122, 17] \n   &6[Xenith] \n If only we knew how dangerous this place was... Then, perhaps, I wouldn't be the only survivor... If only we were more careful... If only... \n  &5[What happened? Can I help you?] \n  &6[Xenith] \n I... I am sorry, I don't want to talk about it and I can't let another soul go to that wretched place, the damned Spire. Please, you should leave.  \n  &5[Sorry for disturbing you, then.]  \n  &6[Xenith] \n I am so sorry, I couldn't save you all... Meredith... Ogden... Yolen... Plain &o  A small tear rolls down his cheek, falling on the wooden floor. \n  &5[Spire? Do you mean [[Cloud Piercer]]?] \n  &6[Xenith] \n You... you know of it? You've been there?! But... you're still alive... \n  &5[I am, and I know how dangerous it can be. Let me help you.] \n&o  The man visibly hesitates, but after a few moments he decides to answer you. \n  &6[Xenith] \n Can you go there once more, please? And... I... Oh, goodness, am I really asking this..? C-could you, perhaps, recover their bodes? The bodies of my team? Or... whatever's left of them...  \n  &5[Sorry, but I am quite busy right now.]  \n  &6[Xenith] \n Just when I thought I finally had hope... Nevermind... Plain &o  The man looks towards the north-east, on the brink of tears yet again. \n  &5[I will help you.] \n  &6[Xenith] \n Really? You... you will? Oh, thank you! Thank you so much! Please, let me know when you're done, we... we can bury them together afterwards...  \n If you talk to Xenith again: Table  AlignDefault ColWidthDefault AlignDefault \n Xenith AlignDefault \n  &6[Xenith] \n When I sailed away from the island, I noticed a strange cave beneath the Spire... They have to be there... Some where... Damn it. \n  &5[What were you and your team doing there in the first place?] \n  &6[Xenith] \n We... We were on a small expedition. A self-appointed expedition. We were foolish enough to think that the fortress was long abandoned. We... I... I paid the price for that mistake. And so did my crew...  \n&o  Search for Xenith's crew beneath the Cloud Piercer. \n When you find their bodies: \n  &6[Nightseer] \n Just what do you think you're doing? \n  &6[Nightseer] \n You, peasant, dare to enter this sacred place! Just your presence is enough to desecrate it, fill it with filth. I can not allow you to leave, nor can I allow you to live. This was your last mistake! \n  &6[Nightseer] \n Accept death! Your body will server a great purpose. Stars! Lend me your strength, for your champion shall end this miserable soul! \n After you beat Nightseer: \n  &6[Nightseer] \n I... am... Defeated by a mere peasant?.. But... How?.. Stars, have you... given up on me? Given up... on your loyal... servant... \n&o  It seems that you have fatally wounded him. \n  &6[Nightseer] \n Forgive me... Aurora... for I... have failed... you... \n&o  A moment later, he collapses to the ground, dead. \n&o  As you're about to exit the sacrificial chamber, a white flash blinds you... \n  &6[Andromeda] \n What a fool..   RawInline  color|teal|his blind... worship was his... downfall... \n  &6[Andromeda] \n They... tore me apart...   RawInline  color|teal|Piece by piece... And you... did the same... \n  &6[Andromeda] \nRawInline  color|teal|Come find me... I... am dying beneath... the waves... \n  &6[Andromeda] \n Then... I shall..   RawInline  color|teal|grant you... enlightenment... \n&o  You've seen horrible things beneath the Spire. Xenith may not enjoy hearing about what you found... \n C:   &o  Return to Xenith and tell him the news. He probably won't like it... Table  AlignDefault ColWidthDefault AlignDefault \n Xenith AlignDefault \n  &6[Xenith] \n Y-you came back! Did you find... did you find them? What's left... of them..? \n&o  No matter how harsh your answer is, you are sure he will be strong enough to endure it.  \n  &5[I'm sorry, Xenith, but they're dead and I'm afraid we can't bury them properly either. Not in their... state.]  \n  &6[Xenith] \n N-no... Damn it! Damn it, damn it! I... Plain &o  He closes his eyes, as if trying to escape the visions of his crew. \n  &5[They were... were be- Sorry, Xenith, I can't say it. They are dead.]  \n  &6[Xenith] \n (MISSING) \n  &5[They were... beheaded. I found what's left of them in a sacrificial chamber beneath the spire.]  \n  &6[Xenith] \n (MISSING) \n  &6[Xenith] \n W-what a fool I am... \n  &6[Xenith] \n Please, tell me the whole story. I must know what happened. \n&o  He opens his eyes, his gaze set directly at you. \n  &5[(Tell him about Sacrificial Chamber, the battle with the Nightseer, and the visions of a comet.)] \n  &6[Xenith] \n So that's it... Crazy lunar fanatics, sacrifices, stars... and for what? Why would they do that?.. \n  &5[I don't know, Xenith, but I do hope we'll find answers soon.] \n  &6[Xenith] \n You're right, I hope we will. You... you mentioned a comet, right? Like a fallen star? Before we ventured in that damnable place, my crew and I sailed south and saw a giant hole beneath the water... If the stories are true, something strange lies beneath   Link   Aphelion Isle Aphelion_Isle wikilink  . Perhaps, you should seek answers there?  \n&o  Find   Link   Andromeda Andromeda wikilink in   Link   Cathedral of the Deep Cathedral_of_the_Deep wikilink beneath   Link   Aphelion Isle Aphelion_Isle wikilink  . \n After reaching the comet: \n  &6[Andromeda] \n Come...   RawInline  color|teal|Talk... to me... \n&o  Talk with Andromeda. Table  AlignDefault ColWidthDefault AlignDefault \n Andromeda AlignDefault \n  &6[Andromeda] \n Greetings...   RawInline  color|teal|[Player]...  \n  &5[You spoke to me before. You're Andromeda, right?]  \n  &6[Andromeda] \nRawInline  color|teal|That is the name... Your... cruel kind... gave me...  \n  &5[Cruel? What do you mean?]  \n  &6[Andromeda] \n Cruel... and hateful...   RawInline  color|teal|You take what does not belong to you...  \n  &5[I didn't mean to take the shard.]  \n  &6[Andromeda] \n Not the... shard...   RawInline  color|teal|A shard... you had... no choice... \n  &5[You're talking about the shard? I can return it!]  \n  &6[Andromeda] \nRawInline  color|teal|A part... of me... yes... but... It is too late...   RawInline  color|teal|I am beyond... repair... But you do not... need... to worry... \n  &5[Beyond... repair?] \n  &6[Andromeda] \n I am...   RawInline  color|teal|dying... Nothing can save me... but...   RawInline  color|teal|I appreciate... you trying... to help... You are... better... than other...   RawInline  color|teal|two... \n  &5[Do you mean to imply I'm not the first to talk to you?]  \n  &6[Andromeda] \n Not the first...   RawInline  color|teal|Not the second... \n  &5[What is this place? Where am I?]  \n  &6[Andromeda] \n This is...   RawInline  color|teal|my domain... I rest... with my... kin... It brings...   RawInline  color|teal|back... memories.. of times... before I...   RawInline  color|teal|was sent... there...  \n  &5[Sent there? It... It was you who destroyed Aphelion Isle?]  \n  &6[Andromeda] \n I... Answered...   RawInline  color|teal|The call... They... Showed me... the way... I...   RawInline  color|teal|followed... And... became... the source...   RawInline  color|teal|of life... \n  &5[The source of life? An entire island is gone because of you!] \n  &6[Andromeda] \nRawInline  color|teal|Do not... dare... to blame me... this is just... the way... I am...   RawInline  color|teal|Some... of you... are just.. as violent... Some... of you... are just... as broken inside...   RawInline  color|teal|careless... in their endless... search... for power... Who... are you... to...   RawInline  color|teal|judge me... \n  &5[What can you tell me about your kin?]  \n  &6[Andromeda] \n We are... the beings...   RawInline  color|teal|of pure... light... We are... the myriad of   RawInline  color|teal|glimmering... gems... in the... endless... broken... beyond... \n  &5[I've seen the blood on the way up here. I'm not the first to talk to you, am I?]  \n  &6[Andromeda] \n You... are not... a   RawInline  color|teal|long time... ago... two souls... visited... me... Each one... took a part... of me... \n  &5[Who?] \n  &6[Andromeda] \n They were... of your... kind   RawInline  color|teal|One bled... clinging... to life... the other...   RawInline  color|teal|Marked... by my... kin... Angry... Determined...  \n  &5[Tell me about the one who bled.]  \n  &6[Andromeda] \n The very...   RawInline  color|teal|first... soul... I met... in this... realm... he is known... by the name of...   RawInline  color|teal|Aphelios... \n  &5[Aphelios? He and his people lived on the Isle you destroyed.] \n  &6[Andromeda] \n I... just... answered... the call...   RawInline  color|teal|He... was desperate... on the... brink... of life... and death...   RawInline  color|teal|He was... the first... to tear me... apart... I... felt... sorrow... in his... soul... \n  &5[Tell me about the marked one.]  \n  &6[Andromeda] \nRawInline  color|teal|She came... after... Took another... part... of me... I felt fury... and...   RawInline  color|teal|resolve... in her... soul...   RawInline  color|teal|Aurora... \n  &5[How can I stop the Star Blight?]  \n  &6[Andromeda] \nRawInline  color|teal|Why would... you stop... my essence... my gift... to this... realm... \n  &5[It is not a gift Andromeda. The Star Blight is corrupting life!] \n  &6[Andromeda] \n You think... wrong... But you... don't need...   RawInline  color|teal|to worry... about... my gift... anymore... As you... took... the last of... me...   RawInline  color|teal|I can not... bestow... life... without my... essence anymore... \n  &5[Essence. Your essence. The Shards.] \n  &6[Andromeda] \n You...   RawInline  color|teal|are... correct... Parts of... me... still can...   RawInline  color|teal|grant life... one... still... spreads...   RawInline  color|teal|across... this world... \n  &5[You were summoned from above. How could someone do that?]  \n  &6[Andromeda] \n Those... bearing the...   RawInline  color|teal|mark... of The Stars... can... commune... we...   RawInline  color|teal|encourage... loyalty Enough... life force... gathered... and granted... to us... we... answered...   RawInline  color|teal|the call... \n  &5[So... Why am I here? You wanted us to talk?] \n  &6[Andromeda] \n Us... there is...   RawInline  color|teal|no us... Only... you... I am... on the verge... of oblivion...   RawInline  color|teal|My light... is... fading...}} and so... does... my life... \n  &5[There is absolutely nothing I can do?] \n  &6[Andromeda] \n You... can...   RawInline  color|teal|Find... her... the one... marked... by Stars... Let her...   RawInline  color|teal|widen... the crack... in the sky...}} so my brethren can...   ong RawInline  color|Red|feast... \n  &5[I am not going to do that, Andromeda.] \n  &6[Andromeda] \n You say this... but when the... time comes... will you think... the... same?... When... you took... a part of me...   RawInline  color|teal|The last... of my... essence... I felt... hope... But... would... hope alone... be enough...   RawInline  color|teal|Find her...}} See... for yourself... I shall... light... your way...   RawInline  color|teal|for the last... time... \n&o  Another vision flashes in your mind. You can see the door and the familiar face of Professor Marl. You instantly recognize this place. You've been there before. \n  &5[This... door. I recalled it being on a small isle near Sierhaven... What would I find there?] \n  &6[Andromeda] \n Time... will tell... you the... truth... of what she did...   RawInline  color|teal|I shall... grant you... the knowledge... and break... the seal for you... now... I fade... \n  &5[Thank you for helping me... even if I won't give you what you want.] \n  &6[Andromeda] \n Remember... [Player]...   RawInline  color|teal|Nothing... lasts forever... Even The Stars... can't be... eternal...  \n&o  A faint white light envelops you again, carrying you away from the Star... \n C:   &o  Head towards the beacon island and talk with Professor Marl. Table  AlignDefault ColWidthDefault AlignDefault \n Professor Marl AlignDefault \n  &6[Professor Marl] \n Ah, it is you again, young one. I'm afraid we've been here far too long... And still not achieved anything. I think it's time for us to depart and tell The King that our research failed. \n  &5[Professor, I think... I think I can open the door. This time, for real.] \n  &6[Professor Marl] \n Hm? Why would you be able to? We have been trying for weeks! \n  &5[(Tell him about your conversation with Andromeda)] \n&o  He listens to you carefully, hanging on to every detail. As you end your speech, he looks at the door and then at you. \n  &6[Professor Marl] \n This is, for the lack of proper words, bizarre... Dying comet? The seal? I doubt anyone could make that up, even if they wanted. That changes things, young one. What do we do?  \n  &5[On the other hand, I don't think we should ever open that door. Please, just move on with this expedition. It is not worth it.]  \n  &6[Professor Marl] \n Fine, young one. Have it your way. We'll be here for a while if you change your mind. \n  &5[I'm not sure, Professor, perhaps I should bring the Shard of Andromeda the-] \n&o  You both hear a sound of circling gears coming from inside the door. \n&o  The door opens before you. You can see a long staircase down. \n  &6[Professor Marl] \n How... What happened? Is this... real? I can't believe my eyes! I don't know what you did, but we finally made progress! Quickly, let's head down and see what we can find there! \n  &5[Maybe we should tell the others first? We don't know what to expect down there.] \n  &6[Professor Marl] \n Ah, come on, I've waited long enough! I'm sure the others heard us and will follow us down there.  \n  &5[Wait a bit, I just need to check something really quick.]  \n  &6[Professor Marl] \n Fine, young one. In the meantime, I'll make a winch, just so we can manipulate the door at will. Don't take too long! \n  &5[If you say so...] \n  &6[Professor Marl] \n Let's go!  \n&o  Talk with Professor Marl. Table  AlignDefault ColWidthDefault AlignDefault \n Professor Marl (Tomb) AlignDefault \n  &6[Professor Marl] \n This place is magnificent! I can't believe it has been under our noses for so many years! \n  &5[Where are we?] \n  &6[Professor Marl] \n If I had to guess, young one, I would say this is the tomb. Given your speech earlier, I assume this tomb belongs... to Aurora. There seems to be another door in this room. We should examine it...  \n&o  A loud voice echoes through the room. The air around you gets cold. \n  &6[Starseeker] \n ...Long time ago, a seal was created to contain what we thought was our greatest treasure. We fought so hard to keep it contained. Countless lives were lost, and a seemingly endless war grew fiercer... \n  &6[Starseeker] \n ...but we found our salvation in the hand s of our prophet - Aurora. She spoke to the stars themselves. No longer would we need to sacrifice our lives, sealed away from the world outside of time. She led us behind the seal, to a brighter future... \n  &6[Starseeker] \n ...We survived many hardships on our way home. Through the Jungle and Swamplands, through betrayal of our own kin. But in the end, we did what we must to ensure our safety... \n  &6[Professor Marl] \n [Player], hold them off while I go back to the surface for help! \n  &6[Starseeker] \n ...She claimed the shard of a fallen comet and soon it was time for us to depart. She picked the most devoted of us to follow her there, to her Tomb. Ever since then, we have guarded our prophet's resting place... \n&o  The air in the room gets even colder. \n  &6[Starseeker] \n ...Yet, as time goes on, people like you keep coming to this island. You can't just turn back, can you? Always so eager, always needing to seek the truth. Decide who's right and who's wrong... \n  &6[Starseeker] \n But right now, it doesn't matter. I can not allow you to disturb the plans of our prophet. I will cut down every living soul on this little island, just so her sleep remains undisturbed. This is the end of the line for all of you. Prepare to die. \n After beating Starseeker the first time: \n  &6[Starseeker] \n ENOUGH!!! I will NOT allow you to go any further! YOU WILL DIE HERE! I swear on the name of OUR PROPHET! This is the last time you see the light of day! STARS! Lend me your strength and watch as I destroy this FOOL! \n After beating Starseeker a second time: \n&o  He falls to the ground, blood trickling down his chest. \n  &6[Starseeker] \n Was this all for nothing?.. Aurora... I am sorry... I couldn't keep my promise... I am... Useless... \n&o  As the Starseeker's body is consumed by darkness, the vision dissipates around you and once again you find yourself in Aurora's Tomb. \n  &6[Starseeker] \n I... shall finally see... the... great... broken... beyond... \n C:   &o  Examine the Tomb. \n After grabbing the book from the chest: \n INTO THIN AIR COMPLETE! Xenith may want to hear your revelations regarding the cult. \n After leaving the tomb: \n&o  It seems that this nightmare is over. Now, you can return to Xenith and tell him everything you learned. Table  AlignDefault ColWidthDefault AlignDefault \n Xenith AlignDefault \n  &6[Xenith] \n Please, if you ever figure it out, let me know. I must know what my crew... my friends... died for. Until then, I'll remain here. \n  &5[I've learned a lot about these fanatics actually.] \n  &6[Xenith] \n You have? Please, do tell. \n  &5[Let me start with the husk of a dead star beneath Aphelion Isle...] \n&o  You tell him about your meeting with Andromeda, about a tomb, hidden behind the seal and Aurora herself. \n  &6[Xenith] \n So this is it. My friends died because of some power hungry monster... \n  &5[I am very sorry for your loss, Xenith. I can only hope they're at peace now.] \n  &6[Xenith] \n *sigh* Thank you. I'm eternally grateful for your help. Please, take this. I know, it isn't much, but you went through a lot to help me... I know Meredith wouldn't object... That I know...  \n You are given:   Link   Waterbound Medallion Waterbound_Medallion wikilink and 48 CXP. \nLink   Category:The Stars Category:The_Stars wikilink ", "reward": "rewards =\n* After talking to Xenith again:\n* &3Waterbound Medallion&r\n* 48 Cxp\n"}