{"name": "Long Way Down", "information": "prerequisites = None\n NPC: Guard Myra Coords: 402, 75, 687\n Celsian Isles Alnera\nPOI: &3Cinder's Roost&r\n", "dialogue": "}} \n&o  Travel to the   Link   Cinder's Roost Cinder's_Roost wikilink and return with a Ponike feather Table  AlignDefault ColWidthDefault AlignDefault \n Guard Myra \n  Coordinates: [402, 75, 687] \n   &6[Guard Myra] \n H-hello adventurer. Enjoy our beautiful c-city, but be careful not to f-fall. If you need h-help us guards are here to help you.  \n  &5[I will return if I need anything.]  \n  &6[Guard Myra] \n P-please do. \n  &5[Is something wrong? You seem scared.] \n  &6[Guard Myra] \n E-everything is fine. \n  &5[Are you sure?] \n  color|gray|Guard Myra lets out a long sigh. \n  &6[Guard Myra] \n W-who am I kidding? I never should have gotten myself in this situation.  \n  &5[Hopefully things get better for you.]  \n  &6[Guard Myra] \n I'm sure I'll be f-fine. \n  &5[What type of situation?] \n  &6[Guard Myra] \n I am from the nearby town of Molta. I worked there as a guard for several years without problems. Then, I learned that there was a position open here in Alnera. I jumped at the chance to move to the city, but when I got here I learned I had a fear of heights.  \n  &5[Sadly that isn't something I can really help with.]  \n  &6[Guard Myra] \n Unfortunately not, but it also isn't your job to. I'll get used to my p-patrol route eventually. \n  &5[Is there anything I can do to help you?] \n  &6[Guard Myra] \n You want to help me? Well I suppose there is one way... If I had the feather of a Ponike I could use the supplies I have on hand to create a pair of boots able to cushion myself from any unfortunate falls. They tend to nest at the top of the Cinders Roost. Their feathers are super light, so you shouldn't have trouble carrying them. I would go myself, but, you know- heights.  \n  &5[That seems a bit too dangerous for me.]  \n  &6[Guard Myra] \n Understandable. I shouldn't have asked a civilian to do something that dangerous. I'll be f-fine, don't worry about me. \n  &5[I will set out as soon as I can.] \n  &6[Guard Myra] \n Thank you! I will wait nervously for your return.  \n C:   &o  Find a Ponike feather high up on   Link   Cinder's Roost Cinder's_Roost wikilink  . \n When you reach the peak: \n  color|gray|As you approach the summit you notice a Ponike, and it notices you. You are going to have to defeat it to get a feather. \n  color|teal|''After the bird falls in battle you pluck a feather from its body. Somehow it is lighter than a feather and also takes up almost no room.'' \n C:   &o  Return to Guard Myra. Table  AlignDefault ColWidthDefault AlignDefault \n Guard Myra AlignDefault \n  &6[Guard Myra] \n H-hello again! Have you had any luck finding a Ponike feather?  \n  &5[I found one, but decided not to give it to you yet.]  \n  &6[Guard Myra] \n Wow. Just wow. \n  &5[I found one!] \n  &6[Guard Myra] \n Wonderful! Just give me a minute... Part A goes in slot B... oh dear that doesn't look right. \n  &6[Guard Myra] \n Oh wait I'm holding it upside down... \n  color|gray|After a long series of errors, Guard Myra finishes creating his new boots. He immediately puts them on.}} \n  &6[Guard Myra] \n I can't thank you enough. I can finally do my job without the fear of falling and the pain and the leg-breaking and the dying. As for your reward... My old boots were designed to resist fire. You can have them, along with this week's wages.   AlignDefault \n  color|teal|'''LONG WAY DOWN COMPLETE!'''}} \n  color|teal|Awarded 32 Crystalline Shards and [[Warm Crystal Boots]].  ", "reward": "rewards =\n* &3Warm Crystal Boots&r\n* 32 Crystalline Shards\n"}