{"name": "Lost in My Mind", "information": "prerequisites = None\n NPC: Eowen Coords: 601, 97, 181\n King's Valley Farr\n", "dialogue": " Table\n Eowen\n  Coordinates: [601, 97, 181]\n   &6[Eowen]\n This memorial should be beautiful. It's a lie...\n  &5[Excuse me?]\n  &6[Eowen]\n The attack on Farr 30 years ago. It killed so many. This memorial is a beautiful reminder of those who lost their lives. But\nit's a lie. My brother is still alive.\n  &5[Who is your brother?]\n  &6[Eowen]\n His name is Kurtis. It's right there on the memorial. I just have this overwhelming feeling he's still with us. He lived in a\nbunker outside town. He was sure something bad was coming. He prepared. There's no way he died.\n  &5[Could I help you find him?]\n  &6[Eowen]\n You could help, I suppose. I've been searching for him for 30 years though. Maybe some fresh eyes could find something I\ndidn't, I guess. It's been so long...\n  &5[Where is his bunker? I'm ready to go.]\n  &6[Eowen]\n You're serious about helping? I'll have to scrounge something up to pay you if you find something. Thank you.\n  &6[Eowen]\n His bunker is just outside the southern city gate, down a trapdoor. It should be unlocked. I'd go with you, but I can't bear to\nreturn there anymore. It just hurts too much. I miss him [Player]...\n  &5[I'll be back to help later.]\n  &6[Eowen]\n Okay.\n&o  Enter Kurtis's bunker, find evidence that he is alive, and return to Eowen.\n  Coordinates: [580, 101, 253]\n  After you enter the Bunker:\n&o  This looks new - but somehow familiar?\n Explore the house for a Clue to get into the safe room.\n  On the second floor in the \"Pantry\" there is a chest with a book.   Link   Safe Room Key Safe_Room_Key wikilink\n   The first lever is in the right bedroom on the second floor, it is above the door.\n The second lever is on the left side of the front wall of the first floor bedroom.\n The third lever is just right of the bed in the same room.\n The fourth lever is in the left bedroom on the second floor, it is behind the jukebox.\n The fifth lever is the same as the first and needs the fourth to be pulled.\n The sixth lever is same as the third.\n The seventh lever is same as the second and requires both the First and Fourth pulled aswell.\n The exit is in the middle of the front wall of the basement.\n  Grab the book   Link   A Deal A_Deal wikilink and return to Eowen.\n&o  Did I enter this ladder? I don't remember... Table\n Eowen\n  &6[Eowen]\n You've come back. Is it wrong of me to be surprised? Have you found anything?\n  &5[I think I have. I found this book inside a hidden Safe Room.]\n  &6[Eowen]\n Let me see it... Hm... I... I don't know what to say. This is real? For real? He's really alive?\n  &5[That's what it seems.]\n  &6[Eowen]\n Where is this warehouse? Who did he make a deal with? I don't understand.\n  &5[I have the same questions. Do you have any ideas about the warehouse?]\n  &6[Eowen]\n Not off the top of my head. Did you see anything that might help?\n  &5[There was a banner in the safe room all over. It was brown, with a white stripe and a red circle in the center.]\n  &6[Eowen]\n ...The Freetraders' banner? What was it down down there?\n  &5[The Freetraders?]\n  &6[Eowen]\n They were a group of mercenaries operating out of Sierhaven's now defunct Apartments before the attack. Kurtis did work for\nthem in the past. But they broke up before the attack, so why would their banner be in this safe room? And he mentions Maren,\n'The Shady Trader'... Could something be going on in Sierhaven? This seems like a long shot though...\n  &5[I'll go poke around. Here's hoping it works.]\n  &6[Eowen]\n I'm really hoping so.\n&o  Try and find Kurtis; the Shady Trader might be able to lead you to him. Table\n Shady Trader\n  Coordinates: [-837, 101, 84]\n   &6[Shady Trader]\n H-hello there!\n&o  The man struggles to smile, but his eyes start back and fourth.\n  &5[Hello.]\n  &6[Shady Trader]\n Would you like to purchase some spectacular items?\n  &6[Shady Trader]\n They asked me to sell to you, and I'm sure you'd love our amazing replicas.\n  &5[Replicas?]\n  &6[Shady Trader]\n Yes, Replicas of items you've found on your travels! They are the finest money can buy, they told me to tell you.\n  &5[Sure, I'm interested.]\n  &5[I'm not interested.]\n  &5[I'm not interested.]\n  &6[Shady Trader]\n I hope you'll come back soon.  Table\n Kurtis\n  Coordinates: [-2102, 74, 619]\n   &6[Kurtis]\n Please buy from me? I was the first, why can I not leave yet?\n  &5[You're Kurtis, aren't you?]\n  &6[Kurtis]\n Yes! Are you here to buy from me?\n  &5[No, I'm here because your brother has been searching for you. For 30 years.]\n  &6[Kurtis]\n I don't have a brother. I don't have a life beyond my sales. Not until I have finished.\n  &5[Are you sure? Eowen said a man named Kurtis used to live in Farr, in a bunker, before a massive attack on the city. He\nthought you were dead.]\n  &6[Kurtis]\n Eowen...? My... brother? He... he's been trying to find me?\n  &5[Yes. He's not given up for decades. He knew you were alive.]\n  &6[Kurtis]\n They came to me... I was trapped... I was offered a deal...\n  &5[And you took it. But we found you!]\n  &6[Kurtis]\n I can't leave. I'm trapped. But Eowen isn't. He can live his life still. I still remember when we were just boys, playing by\nthe banks of the river outside Farr. I fell in. I couldn't swim. He jumped in and save me, nearly drowning in the process. He\nsaved my life. I owe him the chance to keep living his, not hunting for me.\n  &5[I...]\n  &6[Kurtis]\n Here. I've spent a long time writing down what happened the day of the attack. Eowen needs to know. I can't stay though. I must\nsell.. They told me... Quickly, take this, before I forget again. Memory is tough here...\n  &6[Kurtis]\n Please buy from me? I was the first, why can I not leave yet?\n&o  Take   Link   Kurtis' Journal Kurtis'_Journal wikilink back to Eowen. Table\n Eowen\n  &6[Eowen]\n You are back! Do you have any news? Why are you looking at me like that? Is something wrong?\n  &5[I found him. He gave me his journal to give you. It isn't an easy read.]\n  &6[Eowen]\n You actually found him? Let me see that! Plain &o  Eowen looks at the journal, his eyes full of hope and optimism. As he flips\nthrough the pages his eyes begin to dim. As he reaches the last page his eyes are like the void, absent of the light he started\nwith.\n  &6[Eowen]\n He... is in this much pain? He felt that much guilt? He is the only reason I'm alive today, my home was leveled to the ground.\nI only survived since I ran and hid like a coward. I should be the one with guilt for leaving the town to die, not him.\n  &6[Eowen]\n Sadly I can't honor his request. He doesn't deserve this fate, no one does. I have much research to do.\n  &6[Eowen]\n In the mean time though have the reward I promised you. Thank you for showing me the path I must take.\n  &5[I haven't managed to find your brother yet.]\n  &6[Eowen]\n There is something you are keeping from me and I don't know why. Please let me know if you find out anything.\n LOST IN MY MIND COMPLETE! Awarded 2   Link   Royal Crystals Royal_Crystals wikilink\n", "reward": "rewards =\n* 2 &3Royal Crystals&r\n"}