{"name": "Mage's Legacy", "information": "prerequisites = None\n NPC: &3Vargos&r\n &3King's Valley&r &3Sierhaven&r\nPOI: * &3Mage Tower&r\n* &3Witch Village&r\nDifficulty = Easy\nLength = Long\n", "dialogue": "  WorkInProgress|Out-of-date, gloop section doesn't exist instead sent to nyr\n&o  Head to the Mage Tower north of the city and look for some research notes.\n From completing   Link   Prologue Prologue wikilink  : LineBreak &o  C: Vargos will want to speak to you. Ask him about the\nskull on his desk. Table\n Vargos\n  Coordinates: [-735, 154, 117]\n   &6[Vargos]\n Welcome to my office. Is there anything I can do for you?\n  &5[Just looking around]\n  &6[Vargos]\n Well then, if you have not chosen your class I advise you to head downstairs and do so. Otherwise, I find the libraries to be\nquite enjoyable here.\n  &5[Learning about the academy]\n  &6[Vargos]\n There is much to learn. It is a large and noble building, with a fascinating history.\n  &5[What can I do here?]\n  &6[Vargos]\n Here in the Academy you may choose which path you will travel down: Warrior, Mage, Alchemist, Scout, Cleric, or Rogue, and\nlearn techniques along your chosen path. Explore around and I'm sure you'll see what I mean.\n  &5[Who built it?]\n  &6[Vargos]\n The Academy was the second major building constructed here, after Castle Narsen. King Johannes laid the first stone himself.\n  &5[Whose skull is that?]\n  &6[Vargos]\n ... A bold question. It is a daily reminder, and not a pleasant one at that. I will tell you, but only if you do something for\nme as well.\n  &5[Agreed]\n  &6[Vargos]\n  Years ago, High Mage Ezariah was driven mad, and retreated to his Mage Tower northeast of Sierhaven, stealing important notes\nabout the Blackroot Jungle. I would go myself, but... Anyway, when I read the notes, you will get answers.\n  &5[Never mind then]\n  &6[Vargos]\n A wise choice. Chasing memories and ghosts is my folly, no sense in making it yours too.\n  &5[Who are you?]\n  &6[Vargos]\n I am known as the Cerulean Blademind, Fourth Archmage of the Grand Council, and Dean of this Academy. But please, just call me\nVargos; I dislike titles.\n&o  C: Climb the   Link   Mage Tower Mage_Tower wikilink in search of some old research notes. Be careful, Ezariah's apprentices\nwere well-trained.\n After killing the elite mob \"Silent Master\" and getting the research notes:\n&o  C: Once you find the research notes return to Vargos. Table\n Vargos\n  &6[Vargos]\n You found the notes? Tell me, is Ezariah... Never mind, I don't think I want to know.   &o  He flips through the notes. Of\ncourse, they're in Tlaxan. He did always love that language.\n  &6[Vargos]\n You're going to have to find a translator. There was a skilled translator named Armece, although he left the city years ago. He\nwas a bit reclusive, so perhaps he lives somewhere in the swamp?\n&o  C: Find a reclusive translator in the southern swamp to help. He may have some... odd requests. Table\n Hermy the Hermit\n  Coordinates: [-321, 93, 340]\n   &6[Hermy the Hermit]\n *sniff* I smell dat book, dat's in Tlaxan! I can translate it fer ya, fer a price. You go squish dem gloopadoops southwest o'\nhere in dat witchy village and bring me a bit o' gloop and I'll do it!\n&o  C: The translator wants gloop, squish dem gloopadoops to find some.\n  Goto   Link   Witch Village Witch_Village wikilink southwest of Hermy the Hermit and kill some of the slimes in the center of\nthe village. There is no need to break the slime spawners. Only one \"Gloop\" item is required.\n &o  C: Once you have some gloop return to the translator. Table\n Hermy the Hermit\n  Coordinates: [-321, 93, 340]\n   &6[Hermy the Hermit]\n Mah gloop! I'll be eatin' good tonight. Here's yer book, all translated. Now get outta my tower!\n&o  [1/2]: Bring the Encrypted Notes back to Vargos in the academy and he'll tell you his story.\n&o  [2/2]: Should you lose the Encrypted Notes, speak to Hermy for another copy. Table\n Vargos\n  &6[Vargos]\n So he goes by Hermy now, interesting. That aside we can read this book now! Oh... with Ezariah and his spells, I should've\nknown it wouldn't be this easy. The notes are encrypted when not in Tlaxan. Ezariah's old office is on the roof. If you can\nfigure out which levers to pull and push the button on his desk, it should cast a decryption spell on the book. You should be\nable to find cluse in the library on the ground floor.\n  &6[Vargos]\n I won't make you do that, however- I can handle it myself, but I will leave you with a copy of the encrypted notes if you would\nlike to try to decrypt them yourself.\n  &5[Can you tell me about the skull now?]\n  &6[Vargos]\n Of course, a deal is a deal... Allow me a moment to steel my mind, and then I will tell you about the skull.\n  &6[Vargos]\n Twelve years ago, I was appointed to the High Council of Mages, granted this honor by my brother, Valgus, the Archmage. Those\nwere exciting times, as we had very recently recovered and repaired an ancient spell brought with the Empire from the Abeliar\nDominion.\n  &6[Vargos]\n It was a spell that we were able to use to destroy a barrier, revealing a Monument for the Wools - magical artifacts of\nunimaginable power. Five years ago, we deciphered the spell, keeping it and its power secret, keeping the Monument disguised\nbeyond the outpost of Highwatch.\n  &6[Vargos]\n One of the Council members, Calder, believed we should share this knowledge, but it was too dangerous. The argument was heated,\nand we discussed booting Calder from the Council. But he struck first...\n  &6[Vargos]\n Calder killed many of the Council that day, including Valgus, and escaped with a spell we'd found within the Monument... My\nbrother's skull... sits here with me, making sure I forget neither him, nor the peril we all face with Calder still free. After\nhis attack you see, he found a Wool for himself...\n  &5[Do we know where Calder is now?]\n  &6[Vargos]\n We believe he escaped the Valley recently. We're keeping ears to the ground, but it will be difficult to track him down.\n  &6[Vargos]\n Don't worry about Calder though [Player], we'll catch him soon enough. I think you deserve this for the assistance you've given\nme. You're certainly talented - perhaps you should seek out a fellow Councilmember, Bhairavi, in Nyr? She could use your help.\nI'll also put in a good word with the City Planners so you can get yourself a place to stay out at the Plot Island.\n   Color|teal|MAGE'S LEGACY COMPLETE! LineBreak    Awarded [[Morphic Shield]] and the ability to purchase a Plot!\n", "reward": "rewards = *&3Morphic Shield&r\n*the ability to purchase a Plot\n|starting_npc_coordinates = -735, 154, 117"}