{"name": "Mechs Machina", "information": "prerequisites=* &3Keeper Agents&r\n* Completion of &3Coven's Gambit&rstarting_npc_name=Machine God's Heraldregion=Architect's Ringtown=New Antiumstarting_npc_coordinates=-446 181 -86related_poi=&3Arx Spirensis&rstarting_npc_coordinates=-446 181 -86related_poi=&3Arx Spirensis&rregion=Architect's Ringtown=New Antiumstarting_npc_coordinates=-446 181 -86related_poi=&3Arx Spirensis&rtown=New Antiumstarting_npc_coordinates=-446 181 -86related_poi=&3Arx Spirensis&rrelated_poi=&3Arx Spirensis&r", "dialogue": "}} \n&o  Go tell the Praetor and the High Priest about the Machine God's Herald Table  AlignDefault ColWidthDefault AlignDefault \n Machine God's Herald AlignDefault \n  Color|orange|[Machine God's Herald]}} \n Behold citizen. I am the Herald. I am here to announce perfection. \n  Color|purple|[Excuse me... Who are you and where is the Quest Guide ?]}} \n  Color|orange|[Machine God's Herald]}} \n You stand in the presence of the Herald of the Machine God . In his mighty benevolence, It has sent me to foretell Its coming and prepare the inhabitants of this weak city city that their Emperor shall soon return. \n  Color|purple|[What are you talking about ? Are you another one of those machines ?]}} \n  Color|orange|[Machine God's Herald]}} \n I am crafted flesh, given my form by the Machine God itself. I have told you why I am here. Hear ye this : If you join the Machine in peace, it will be far easier for you all. Tell your leaders to lay down their arms. Neo Antium is nearly here. Utopia is coming. \n  Color|purple|[So you're the ones who have been sabotaging New Antium. Where do you come from ?]}} \n  Color|orange|[Machine God's Herald]}} \n I have told you. Neo Antium. I will tell you again if I must. \n  Color|purple|[Less cryptically, please.]}} \n  Color|orange|[Machine God's Herald]}} \n The Machine God has decreed me here. It is coming, and Neo Antium comes with it. The Emperor will soon return and reclaim his throne. Lay down your arms and accept our power. \n  Color|purple|[Pelias is back ? I thought he vanished.]}} \n  Color|orange|[Machine God's Herald]}} \n The former war was flawed. The Machine God know| this now. It has found a greater purpose and is ready to unveil its Utopia for you all. Accept Its gift. Tell your leaders immediately to prepare for Its great arrival. \n  Color|purple|[I guess I will then...]}} \n  Color|orange|[Machine God's Herald]}} \n At last. Tell them Neo Antium is coming. The Emperor waits for your surrender at the Tree of Life.  \n&o  C [1/2]: Go tell the Praetor about the Machine God Herald's arrival in New Antium... \n&o  C [2/2]: ... Or speak with the High Priest first instead. Table  AlignDefault ColWidthDefault AlignDefault \n The Praetor AlignDefault \n  Color|orange|[The Praetor]}} \n You ! My friend, oh hero ! Come forth. I am quite pleased to see you, [Player]. What brings you back to my humble office?  \n  Color|purple|[I'm wandering around at the moment, seeking more battles.]}}  \n  &6[The Praetor] \n Surely you are sent to us by the Architect Himself. My nights remain relatively restful; for that you deserve eternal graciousness. \n  &5[I'm glad I could help.] \n  &6[The Praetor] \n Soon, I hope, we will find answers together and you can help even further. \n  &5[I hope so.] \n  &6[The Praetor] \n You are always welcome in New Antium, celebrated in full decorum, [Player]. Your arrival here is fortunate and surely a sign of things to come. My people have always been plagued by misfortune, I swear to you. First the collapse. The Empire squandered in a night. The shades devouring those left behind. Then these dreams that you have lessened now. Now you've given us hope. A source to the Shades could be what we need. Thank you for your help thus far. \n  Color|purple|[Praetor, I think New Antium is under attack.]}} \n (If you speak to the Praetor first) LineBreak RawInline  Color|purple|[Praetor, I think New Antium is under attack. The High Priest sent me to speak to you.]}} (If you speak to High Priest first.) \n  Color|orange|[The Praetor]}} \n Under attack? Where? I hear no clash. \n  Color|purple|[The Guide has vanished and has been replaced by a mechanical being and the High Priest and I discovered another replacement a few days ago.]}} \n  Color|orange|[The Praetor]}} \n Shades? \n  Color|purple|[No, machines. Several other citizens have gone missing with no replacement as well.]}} \n  Color|orange|[The Praetor]}} \n Who then could be striking such attacks at the heart of this city? Who is responsible? \n  Color|purple|[The Herald called it the 'Machine God' said the Shades were a flawed attempt at what it's doing now, and that the Emperor is returning.]}} \n  Color|orange|[The Praetor]}} \n I apologize, but whatever does any of that mean ? \n  Color|purple|[That's exactly how I felt. It doesn't make any sense.]}} \n  Color|orange|[The Praetor]}} \n When you and I last spoke. I told you of the fall of Antium, yes ? How Pelias' madness and endless search for an ancient Serebrian artifact caused the vanishing of thousands ? \n  Color|purple|[You did, perhaps not in the same words. What does Serebrian mean ?]}} \n  Color|orange|[The Praetor]}} \n I apologize, that is theway that we Ashkii describe that of the ancient Silver-clad Emperor who served the Lord Architect. Now, as I had been saying, Pelias wanted an artifact. It has been long assumed he failed to overcome its defenses and some vile trap had caused the Shades. But should what this Herald is saying be true, we must confront the possibility that Pelias found what he was seeking. It could even be that he was involved. \n  Color|purple|[The Herald did say that 'Neo Antium' is coming and that a Utopia was coming as well.]}} \n  Color|orange|[The Praetor]}} \n We will not take this sitting down. Nay, I ask you to begin searching for solutions. Did you get any further information ? \n  Color|purple|[That the Emperor will be waiting at the Tree of Life. I don't get why though. That's all the way in the Wolfswood.]}} \n  Color|orange|[The Praetor]}} \n Indeed it is. The garrison site of those nasty Coven witches. While I should ask you to travel there post haste and seek the veracity of claims of the Emperor lurking again, instead. I posit I must extend the branch to my fellow advisor of New Antium. Please visit the High Priest and ascertain his thoughts as well. \n (Continuation if you spoke to the High Priest first) \n  &5[I'll travel to the Tree immediately then. Any idea where I should look?] \n  &6[The Praetor] \n I'd start below the roots. Pelias always was one to dig to the depths.  Table  AlignDefault ColWidthDefault AlignDefault \n The High Priest AlignDefault \n  Color|orange|[The High Priest]}} \n The Architect's blessings upon you Player. What can I do for you ?  \n  Color|purple|[Have you discovered anything about more imposters among us?]}}  \n  &6[The High Priest] \n I have not. Have you? \n  &5[Not yet anyway.] \n  &6[The High Priest] \n My eyes and my prayers are at the ready. If this Machine God is truly imminent, we must be prepared. \n  Color|purple|[Anything interesting happening?]}}  \n  &6[The High Priest] \n I did receive a message from the Proprietor. She said she was glad to hear you survived her challenge and that you were welcome back. Also that she's opened a \"Way\" back if you jump at the painting behind me. I've tried and it didn't work, so I imagine an old man like me isn't welcome. \n  Color|purple|[High Priest, I think New Antium is under attack.]}} \n (If you speak to the High Priest first.) LineBreak RawInline  Color|purple|[High Priest, I think New Antium is under attack. The Praetor sent me to speak to you.]}} (If you speak to Praetor first.) \n  Color|orange|[The High Priest]}} \n Oh holy Architect, lend me your divine insight... Child, I must pray to the Lord Architect. I know your words to be true after the discovery of the mechanical one. What has happened thus? \n  Color|purple|[The Guide has been taken and replaced with someone calling themself the Herald of the Machine God.]}} \n  Color|orange|[The High Priest]}} \n Truly a folly. The Guide is invaluable for new travelers to our city. \n  Color|purple|[It also said the Emperor is returning, a \"Neo Antium\" is coming, the Machine God is coming too, and New Antium needs to lay down arms and welcome it all. Insanity.]}} \n  Color|orange|[The High Priest]}} \n Truly it is. The Architect must interced if his divine servants are to continue their goals. Perhaps... perhaps you are his intervention, Player? You have come to me with a warning. I would be a fool not to heed it. \n  Color|purple|[I don't think I'm that important.]}} \n  Color|orange|[The High Priest]}} \n Humility is a virtue my dear friend. One deserving of such praise. Now, tell me. We've found these machines taking my people. Out in the wilds of the Keep we have Shades taking lives. What more folly could befall us ? \n  Color|purple|[I think actually those two are connected.]}} \n  Color|orange|[The High Priest]}} \n Hmm? Why do you say such things ? \n  Color|purple|[The Herald said something to that effect.]}} \n  Color|orange|[The High Priest]}} \n Fascianting... I can see the connections, I suppose. The taking of the soul alone could be quite troublesome. I cannot imagine what this Machine God wants with us. \n  Color|purple|[Utopia. Neo Antium. Total domination ?]}} \n (Continuation if you speak to the High Priest first.) \n  &6[The High Priest] \n I think you need to visit the Praetor. He commands the strike force of our nation. I hate to say this, but I do not feel like I alone will be enough to handle this situation. Perhaps it's time to set aside our conflicts as Dux Civitatis of New Antium and unite to stand firm against this Machine God. \n (Continuation if you speak to the Praetor first.) \n  Color|orange|[The High Priest]}} \n Something nefarious, that has been brewing for many years, it would seem. You said you've spoken to the Praetor already? Good. He commands the strike force of our nation. While he and I, as Dux Civitatis of New Antium, disagree much, we must be united here. Do we have any actionable plan, from him ? \n  Color|purple|[We spoke of trying to find where Pelias supposedly is. The Herald said at the Tree of Life, but that's in the Wolfswood, not in the Keep at all.]}} \n  Color|orange|[The High Priest]}} \n If the Architect wills you be there. I suggest you travel there. There are no mistakes, only ways to be more prepared. Travel well, prepare for a trap. I fear we cannot trust anyone.  \n&o  C: Visit the Tree of Life in the Wolfswood and search the roots to investigate this so called return of the Emperor Table  AlignDefault ColWidthDefault AlignDefault \n Ageratina \n  Hint : Under the Entrance of Cover Fortress LineBreak  Coordinates: [-539, 109, -376] \n   Color|orange|[Ageratina]}} \n You have been within Ravenna, yes. You have seen the Covensteads. You have seen the fall of the chains. You, I will commune with. Bring me remnants of the Coven's failure and I will offer you power beyond words. \n  Color|purple|[I'm actually looking for someone. Has anyone been around the Tree of Life recently ?]}} \n  Color|orange|[Ageratina]}} \n The majority of the Coven lives through here. Of course there have been beings traveling this great tree. \n  Color|purple|[I was told an Emperor was waiting at the Tree of Life by a herald of the 'Machine God'.]}} \n  Color|orange|[Ageratina]}} \n You're at the wrong Tree of Life, you ignorant child. You have seen much of the Wood, but not much of the world, I find. \n  Color|purple|[I'm sorry, what do you mean wrong Tree of Life ? Isn't there just one ?]}} \n  Color|orange|[Ageratina]}} \n The Tree of Life is far too large to sprout in just one place. This entire Ring contains her roots. This very Tree is merely a sapling, growing from the great mother Tree below the Mountain. No Machine God lurks here. We serve no Emperor here. You are not in the right place. \n  Color|purple|[Then where do I go ?]}} \n  Color|orange|[Ageratina]}} \n How would I be expected to know that? Though I suppose I could offer you passage in this dark place to somewhere darker still. The depths of the earth hold the darkest secret. The roots tell stories, yes. \n  Color|purple|[I need to hear these stories then.]}} \n  Color|orange|[Ageratina]}} \n Yes you do, outsider. Perhaps you should visit the roots yourself and learn of the magic that flows beneath this land... Let me show you. \n  Color|purple|[Okay.]}} \n  Color|orange|[Ageratina]}} \n Yes... Come, meet he of the roots.  Table  AlignDefault ColWidthDefault AlignDefault \n The Saothraiche AlignDefault \n  Color|orange|[The Saothraiche]}} \n Oh my. It is you. The storied. Dancing in the darkness of the roots, with me ? Incredible. Don't you see? \n  Color|orange|[The Saothraiche]}} \n This darkness below it all... nothingness... becomes something else when give the right influence. \n  Color|orange|[The Saothraiche]}} \n But there is not just one more Tree. There are many more. For each power that has taken up residence in the Architect's playground, another one sprouts... \n  Color|orange|[The Saothraiche]}} \n Follow them if you must. But know that the power is not easily trifled with. \n  Color|orange|[The Saothraiche]}} \n Find your Emperor. This knowledge should not come so freely in the future, child. I will let you walk the right path this time, yes. Next time the cost will be greater. A thread might be needed then, yes. A whole fate even... \n  Color|orange|[The Saothraiche]}} \n Now go. Leave me with these reaching roots. Find your shriveling tree and your Emperor in the place called Arx.  \n&o  C: Return to the Keep, find the Tree of Life within   Link   Arx Spirensis Arx_Spirensis wikilink and look around for the Emperor. \n After conquering   Link   Arx Spirensis Arx_Spirensis wikilink  : Table  AlignDefault ColWidthDefault AlignDefault \n Machine God's Herald AlignDefault \n  Color|orange|[Machine God's Herald]}} \n Greetings fleshling! You have st|pped your first step into the sacred Utopia of Neo Antium! SoftBreak RawInline  Color|purple|[Um, hello? Why are you here ? I thought you were heralding over in New Antium.]}} \n  Color|orange|[Machine God's Herald]}} \n I am everywhere I must be! You are a guest of honor , Player. Are you here to accept the gifts of the Neo Architect? \n  Color|purple|[The Neo Architect? Is that what the Machine God is named ?]}} \n  Color|orange|[Machine God's Herald]}} \n That is not Its name, but that is Its title now. As It rises from the depths of the Cradle, It shall usurp the Architect and become the worshiped one across the Ring. \n  Color|purple|[I'm not sure I want that to happen. Doesn't seem like a good thing.]}} \n  Color|orange|[Machine God's Herald]}} \n Did you not travel here to join the Emperor and receive Utopia ? \n  Color|purple|[No I traveled here to stop you. Where is the Emperor ?]}} \n  Color|orange|[Machine God's Herald]}} \n He is busy preparing Utopia. This place was only made possible due to the glorious Emperor Pelias disrupting the cruel barrier the Silver Emperor placed around our God. \n  Color|purple|[You're not bothered by me wanting to stop you ?]}} \n  Color|orange|[Machine God's Herald]}} \n There is no way you can, fleshling. Emperor Pelias found the Silver Barrier and disrupted it with hiw weak flesh, pressing the power of the Tree of Life from outside, in. This granted the Neo Architect newfound power. It took the Keep entirely. It has been seeking to take the rest of the Ring and turn it into a beautiful Utopia. Flesh is weak. The Machine is forever. Now, your last chance. Join the Utopia, Player. Decline and you wille be forcibly assimilated \n  Color|purple|[That doesn't dound like Utopia to me.]}} \n  Color|orange|[Machine God's Herald]}} \n Utopia must be made absolute. Do you accept our offer? \n  Color|purple|[No.]}} \n  Color|orange|[Machine God's Herald]}} \n Then I must take you to be processed. I will see you soon enough, when you have joined the great Machine.  Table  AlignDefault ColWidthDefault AlignDefault \n Neo Garmon AlignDefault \n  Color|orange|[Neo Garmon]}} \n You! You were the one investigating the food stores. I didn't get your name before, what was it ? SoftBreak RawInline  Color|purple|[Player]}} \n  Color|orange|[Neo Garmon]}} \n Player! As you can see, the situation is dire, we are trapped here, and our bodies... are no longer what they once were. \n  Color|orange|[Neo Lanora]}} \n We've been left here land have yet to be fully \"processed\". The guards are in a frenzy, seemingly in preparation for some grand event. \n  Color|orange|[Neo Gorm]}} \n We've all maintained a sens of self... but others who feel prey are beyond saving. Vile contraptions. \n  Color|orange|[Neo Garmon]}} \n Surely you don't seek to venture further? We were fortunate, but you Player, may not be. \n  Color|purple|[I do.]}} \n  Color|orange|[Neo Garmon]}} \n Regardless, the door is sealed shut... \n  Color|orange|[Neo Garmon]}} \n Perhaps this device on the floor could be used to gain access? The panels look like they can be rotated. \n  Color|orange|[Neo Garmon]}} \n Mm... defeat this unearthly mechanism then I'll guide. \n  Color|orange|[Neo Garmon]}} \n If you truly wish to delve deeper, I will not stop you. Please be careful, and for the sake of New Antium, good luck.  \n&o  C: Solve the strange mechanism on the floor to hopefully find an escape for your allies and a way forward for yourself. \n After completing the puzzle and going forwards: \n&o  C: Talk to Neo Gorm. Table  AlignDefault ColWidthDefault AlignDefault \n Neo Gorm (Brown Lobby) AlignDefault \n  Color|orange|[Neo Gorm]}} \n Mm... You did it, Gorm is impressed. Let's meet a little further ahead, I'll catch up. \n  Color|orange|[Neo Gorm]}} \n This is the place. Others have left for New Antium already, I will catch up to them shortly. Good luck, you have support of the Ashkii. \n  Color|purple|[Thank you Gorm.]}}  \n  Color|Teal|'''MECHS MACHINA COMPLETE !'''<br>\nAwarded [[Pelias' Last Step]], a Brown Wool Key, 1 [[Hyperchromatic Archos Ring]], and access to the shortcut to [[Arx Spirensis]] and [[Submerged Citadel]]!}} ", "reward": "rewards=* &3Pelias' Last Step&r\n* a Brown Dungeon Key\n* Access to Brown Wool Teleporter\n* 1 &3Hyperchromatic Archos Ring&r\n* Access to a Shortcut to &3Arx Spirensis&r and &3Submerged Citadel&r"}