{"name": "Missing Soldiers", "information": "prerequisites = &3Bandit Troubles&r and reported to Captain Murano\n NPC: Sergeant Sigrun Coords: -137, 100, -96\n King's Valley Nyr\nPOI: &3Southern Jaguar Village&r, &3Northern Jaguar Village&r\n", "dialogue": "  WorkInProgress|Missing compass content Table\n NOTE: If the player has accepted Octavius's bribe in   &o Link   Bandit Troubles Bandit_Troubles wikilink  , this quest will be\nconsidered non-canon to the playthrough, and no rewards will be given. A warning issues as follows:\n    Table\n Sergeant Sigrun\n  Coordinates: [-137, 100, -96]\n   &6[Sergeant Sigrun]\n Hello adventurer, Captain Murano told me to keep an eye out for you. For good reasons of course; he called you a 'paragon of\nvirtue.' Care to put that virtuousness to good use?\n  &5[What do you need help with?]\n  &6[Sergeant Sigrun]\n Scout Corporals Davis and Redmond were spying on the Jaguar Warrior village across the river, southeast of here. They can\nhandle themselves, but should be back by now. If you could head over there and make sure they're... doing well, it would put me\nat ease.\n  &5[Sorry, I need to get going]\n  &6[Sergeant Sigrun]\n Alright, that's no problem. You're not a soldier, you have no obligation to help. Perhaps one of the local hunters will help\nout...\n Head to   Link   Southern Jaguar Village Southern_Jaguar_Village wikilink  .\n  Redmond's Cap can be found in the furnaces at [14, 88, 94]\n Davis's Cloak can be found in the furnaces at [45, 83, 95]\n  Once you have gotten the items return to Sergeant Sigrun.\n If the quest is non-canon, the quest compass will only read \" &o  Do you really expect a compass to assist you with a\nhallucination?  \" Table\n Sergeant Sigrun\n  &6[Sergeant Sigrun]\n ...Yep, that's their gear. Damn it, what happened?\n  &5[They were eaten.]\n  &6[Sergeant Sigrun]\n ... Well. I think I'll call in the cavalry and burn that entire village to the ground\n  &5[I, um, I'm not sure...]\n  &6[Sergeant Sigrun]\n *sigh* You're an awful liar. I guess I'll find out when we go and burn that village to the ground.\n  &6[Sergeant Sigrun]\n I'll start seeing how many troops we have available, but while I do that, there's another jaguar warrior village we had under\nsurveillance to the east. Sergeant Kim was observing it, see if she's still alive.\n Head to   Link   Northern Jaguar Village Northern_Jaguar_Village wikilink  .\n  Kim's Sword can be found in the furnaces at [336, 103, 32].\n  Sergeant Sigrun\n  &6[Sergeant Sigrun]\n ...I guess I'm writing three letters tonight. Here, this bow was Kim's. Take it, and kill any of those jaguar curs you run\ninto.\n  &6[Sergeant Sigrun]\n I can't say I'm happy about what you found, but thank you for your help.\n MISSING SOLDIERS COMPLETE! Awarded   Link   Steelsiege Steelsiege wikilink  .\n", "reward": "rewards =\n* &3Steelsiege&r\n"}