{"name": "Of Mushrooms and Magic", "information": "prerequisites = * &3Into the Woods&r\n NPC: Primirium Verdanne Coords: -317 181 -663\n Architect's Ring Galengarde\nDifficulty = Long\nLength = Hard\n", "dialogue": "&o  Prepare for a diplomacy mission with the Primirium. Table\n Primirium Verdanne\n  Coordinates: [-317 181 -663]\n   &6[Verdanne]\n Thank you for your assistance thus far, [Player]. You've done well.\n  &5[Can I ask a few questions?]\n  &6[Verdanne]\n Sure, what do you want to know?\n  &5[Can you tell me about the Favor of the Wolf?]\n  &6[Verdanne]\n Like I mentioned earlier, we're not entirely sure what form it takes. Many centuries ago lived a mighty god, the wolf,\nHarrakfar. He roamed these lands, bringing life to all he touched, and death to those that deserved it. He died in a battle with\nthe Silver Knights a very long time ago. The Coven claims they still hold his favor however, and the Hex they have cast lets\nthem draw power from it.\n  &6[Verdanne]\n Yes actually. We want you to go on an important mission for us - diplomacy.\n  &5[I'm usually more of the smash and fight kinda person.]\n  &6[Verdanne]\n Diplomacy is not without its dangers. Trust us, you’re uniquely suited for this errand.\n  &5[Maybe later.]\n  &6[Verdanne]\n Okay then.\n  &5[Alright, I'm listening.]\n  Prepare for a diplomacy mission with the Primirium.\n  &6[Verdanne]\n We want to send you on a mission to the Mycelia village to try and make a positive contact with them. With them clearly having\nissues with the Coven right now, perhaps this is the best time to step in to try and make peace.\n  &5[That's an interesting proposal. Why don't they like you right now?]\n  &6[Verdanne]\n I imagine you don't know much of how the Dichen arrived here. Around 70 years ago, we fled the Silvari castles further inland\nfollowing a catastrophe. We were in danger and the Ashkii people who lived there did not welcome our presence any longer. We\nleft for the safety of this coast, but our people knew little of the ways of the Wolfswood. We didn't realize that as we\nexpanded, we were chopping down Mycelia shroomgardens.\n  &5[They hate your people because you cut down their garden?]\n  &6[Verdanne]\n Not their garden. Them. Living Mycelia mushrooms, who walk and speak.\n  &5[Oh.]\n  &6[Verdanne]\n Yes. As we cut down what turned out to be their developing newborns, they responded in turn. They used a fungal weapon to\ndestroy one of our first villages. Since then we've made a tenuous peace, but our relations are still frosty at best.\n  &5[So I'm here to try and patch up a feud entirely because they hate someone else now?]\n  &6[Conquort]\n Yes! Or die trying! We have some gifts for you to bring to them. Carved rifles, mana crystals.\n  &5[I'd rather not be dying for this.]\n  &6[Verdanne]\n We'd rather that too, [Player]. Worry not. We've been making offers of peace to the Mycelia for years, but face to face\nmeetings have never been possible. They refuse to leave their towns, and we refuse to walk into a trap. You seem to be tough\nenough to... deal with them, if they do try to take you captive.\n  &5[You want me to fight with these things? Their issues sound pretty fair.]\n  &6[Tybale]\n Ah, don't worry. Mycelia regrow if cut down. They're an interesting species to say the least. Of course violence should be a\nlast resort, but if you must defend yourself, you can do so without a guilty conscience.\n  &5[When do you want me to go?]\n  &6[Verdanne]\n Now, if you're ready. We have the gifts in a cart, and a small group of pikemen to accompany you.\n  &5[I'd like to prepare for a bit.]\n  &6[Verdanne]\n That's fine. Come back to me when you're ready to go.\n  &5[I'm ready. Let's go.]\n  &6[Conquort]\n Of course you're ready! A good soldier is always ready. Good luck, we're depending on you.\n&o  C: Talk to Captain Lauden. Table\n Captain Lauden\n  &6[Captain Lauden]\n Ah, bonure! I have the gifts from the council for you to deliver initially. We're going to wait back here, guerre. The rest are\nin the cart.\n  He hands you one of the rifles and a crystal.\n  &5[What do you think of the Mycelia?]\n  &6[Captain Lauden]\n Enn... not my place to say. You should go, they're waiting for you there I'm sure. They have scouts everywhere in this part of\nthe woods.\n  &5[I insist.]\n  &6[Captain Lauden]\n If I must... well, I think same as most really. Why give to them when they give nothing to us? We've been trying to make a real\npeace for years, ever since Verdanne rose to power. Nothing has worked.\n  &5[Verdanne seemed to think there was some progress. Peace even.]\n  &6[Captain Lauden]\n Verdanne thinks too much of what's only words. Talks of outreach and such. All I know is, these things don't think like you and\nI. If they did, we wouldn't have that poor mess under our city.\n  &5[The infected village?]\n  &6[Captain Lauden]\n Oue, though those are lighter words for it than I'd use. An abomination that is. You should probably go in now though. Wouldn't\nwant to ruin your peace talk before it's even started.\n  &5[Yes, I'll go in now.]\n  &6[Captain Lauden]\n Good luck to you then. If it goes sour, give a signal and we'll get the goods out. No point risking more lives.\n&o  C: Speak to the Voice of the Godspore (by smacking the giant Mushroom!) Table\n Voice of the Godspore\n  &6[Voice of the Godspore]\n Ah. New slave, Dichen have.\n  &5[I am not a slave.]\n  &6[Voice of the Godspore]\n Mmm. Council, them you bow to, yes? All are slaves. All but those of nature.\n  &5[Do the other Mycelia not follow you?]\n  &6[Voice of the Godspore]\n All free to act as wished. We guide, nudge. Not demand.\n  &5[I’m not here to talk philosophy.]\n  &6[Voice of the Godspore]\n Ah, but here to bargain. Deal. Such is of the mind, no?\n  &5[Perhaps. Perhaps I just wanted to see you myself. I'm new to the area.]\n  &6[Voice of the Godspore]\n Mmm. Crafty one. We watch. Everywhere, we are.\n  &5[Then you know we have gifts for you. The Dichen want to make peace.]\n  &6[Voice of the Godspore]\n Ah, the latest bowing. What have you for me?\n  &5[Carved rifles and mana crystals.]\n  &6[Voice of the Godspore]\n This is all? You come here for this?\n  &5[There are more in the cart outside.]\n  &6[Voice of the Godspore]\n You fail language. Rifle, carved from wood. Wood born from trees. Trees born from lands that are ours. Mana crystals too,\nstolen from our caverns, our homes.\n  &5[All they did was cut down some plants decades ago. How can you hate them?]  Plain  (Missing)\n  &5[I know. They regret what they did, and they want to apologize.]\n  &6[Voice of the Godspore]\n Too late to return. Too late for such. Seventy years too late.\n  &5[Then what do you want them to do?]\n  &6[Voice of the Godspore]\n Oh we do not want from them. We have no need here. We thrive here. But these slaves, meetings… needed not. No changes to\nhistory can be. Your death, message it will send. Conkats, allender, por Mycelia!\n&o  C: Survive the Godspore's assault!\n  &6[Voice of the Godspore]\n Hm, skill you have. Change fate, it will not. Rise, seeds!\n  You hear a woman's voice within your head.\n  &6[Mysterious Voice]\n That fool Verdanne... your men are safe. Time to get you out of there! Get ready!\n  &6[Voice of the Godspore]\n Qu magic... Aradia ferdus! Perde!\n After surviving:\n&o  C: Speak to Elder Lytania. Table\n Elder Lytania\n  &6[Elder Lytania]\n Verdanne will never learn... She could settle for the Abello clans, but no, she must have the larger prize...\n  &5[Who are you? What's going on?]\n  &6[Elder Lytania]\n Lytania, of course. We are both associates of the Primirium. I was watching your little meeting and while you seemed like you\ncould handle yourself, I figured I'd bring you out before you had to... prune, more Mycelia. They don't tend to like that.\n  &5[Thank you.]\n  &6[Elder Lytania]\n Yes, yes. Don't mention it. Though friendlier with my people than the Dichen, the Mycelia aren't fond of either. I took no\ngreat risk.\n  &5[Who are your people?]\n  &6[Elder Lytania]\n The Aradia. You're one of Verdanne's, so it seems you can be trusted... We are a silent network within the Coven, working to\nundermine the strength of the Council that leads them. More recently, we have found common ground with your friends, the\nPrimirium. We have mutual goals, one might say.\n  &5[Verdanne didn't tell me about you.]\n  &6[Elder Lytania]\n She wouldn't. You haven't been with them long, or we would've caught wind of you already. The relationship between my people\nand the Dichen is not one the Ladies of the Council would be happy hearing of. Hence the sealed lips.\n  &5[But the Mycelia... they must know after that.]\n  &6[Elder Lytania]\n Sure, they'll know. They've likely known for years, but the Mycelia and the Council have never been close friends. After that\ndreadful meeting between them and the Porphyry? No, our little secret will be perfectly safe.\n  &5[So why am I here, other than stopping me getting beaten up?]\n  &6[Elder Lytania]\n I wanted to meet Verdanne's new pet soldier. Perhaps bring you into the fold of what we do here. The secrecy is oh so hard to\nhold on to. It's nice to share...\n  &5[Share what?]\n  &6[Elder Lytania]\n The words of our goddess, Hycenea. You have heard her voice, yes? She is reaching out, at last. Breaking free from the chains\nof those TRAITORS. The Ladies of the Council have been lying for centuries.\n  &5[What do you mean?]\n  &6[Elder Lytania]\n You're an outsider, so I imagine you don't know much of the Coven. Let me show you... Travel up the river, where you will find\na watery cave. I will show you the history of our movement.\n&o  C: Travel up the river to discover the Aradian Covenstead. Interact with the 7 other Lystania's projections in the cave to\nlearn the history of the Wolfswoods. Table\n Lystania's Projection\n  &6[Lytania]\n Welcome to the Covenstead of the Aradia. This is the original site at which we, the Aradia, offered worship to Hycenea and her\nlove. Here we have crafted the history of the region and our Goddess, of which I would like you to visit each.  Table\n Lystania's Projection\n  &6[Lytania]\n Hycenea was the original witch, a dryad imbued with great gifts from the land and from Harrakfar, the great Wolf, himself. She\nbecame his lover and the two commanded these lands apart from the might of the Architect and the Silver Knights. She soon found\nher love being torn from her by the Silver Knights.\n  &5[And she got him back?]\n  &6[Lytania]\n Following this event, she went on the warpath, forming the ancient Coven and launching attacks to reclaim the prison the Wolf\nwas trapped inside. She succeeded, and retreated below the Wolfswoods to keep him safe. The Coven claimed she defends him\nagainst the Knights and their followers to this day, but the truth is more insidious.\n  &5[The Coven held her captive.]\n  &6[Lytania]\n Indeed. The Coven decided they didn't want Harrakfar free again, and as we now know, Hycenea is held captive beneath the Tree\nof Life, left to rot, merely a length away from the prison that holds her Harrakfar.  Table\n Lystania's Projection\n  &6[Lytania]\n The Coven has set up a home in the Tree of Life towering over the Woods. This Tree is a mighty symbol of Harrakfar and they\nhave perverted it into a sign of death instead. Many have sought its power over the centuries, but few have been able to find\nit. There is magic around the Ring that keeps many away, and the witches keep the rest from ever leaving. The Tree is a source\nof powerful magic, tapping into something primordial indeed.  Table\n Lystania's Projection\n  &6[Lytania]\n Harrakfar, the Blue Wolf. A being from beyond the annals of history, Harrakfar was attuned to the land and the cultivation of\nlife itself. His presence in these woods caused great growth and flourishing. The Silver Knights, of course, could not let this\nstand. They are vile beings, tasked only with destruction for a purpose known only to themselves. They came for the Wolf. They\nimprisoned him in a mockery of his power. Hycenea reclaimed him, but was never able to set him free again. The Coven saw to\nthat.  Table\n Lystania's Projection\n  &6[Lytania]\n The Coven was founded by the dryad Hycenea and her allies, impossibly long ago. She had a lover, Harrakfar, the Wolf of the\nWoods. Their futures were entwined, so when the Silver Knights took her love, she swore to never rest until he returned to her.\n  &5[Harrakfar is in a wool?]\n  &6[Lytania]\n I'm not sure what that means, but he was imprisoned. She claimed his cage back, but could not free him. She granted 12 members\nof the Coven great power and assigned them as the Ladies of the ancient powers. They in turn betrayed her, imprisoned her deep\nbelow the Wolfswood, and used her and the power they could siphon from Harrakfar's prison to establish their strength.\n  &5[Who is the current Council?]\n  &6[Lytania]\n Lady Nalatia is the mistress of air and night, with her adherents Isovel and Serafina. Grandmother Laurey is the mistress of\nmorn and earth, with her adherents Voisin and Old Rosheen. Mad Molldyer is the mistress of noontime and the flames, with her\nadherents Ellyvere and Maddelena. The Vedha is the mistress of sundown and water, with her adherents Hecatie and Ensolla.\nTogether they comprise the Council of the Coven.  Table\n Lystania's Projection\n  &6[Lytania]\n I don't know much of the Knights themselves, nor the Architect they serve. They are enforcers of his rule, but have been absent\nfor many generations. Perhaps their goals have led their attention elsewhere. They rain down destruction wherever they tread and\nwill not stop until their goal is met. There is no negotiation with a Silver Knight. Only their victory.  Table\n Lystania's Projection\n  &6[Lytania]\n It wasn't long ago that a few of our number received a vision from Hycenea. In it, she claimed she was reaching out at last -\nher chains had been loosened somehow by a burst of power. She was imprisoned by the Council and our worship had reached her\nears. Our group's purpose shifted from adherents of Hycenea's ways to brewing a rebellion within the Coven. We want to overthrow\nthe Council, free Hycenea from her chains, and create a peace across the Wolfswood.\n  &5[And the Primirium agree.]\n  &6[Lytania]\n The Primirium agree. Our negotiations have succeeded, we are aligned, and soon the battle will begin. The Coven must fall,\ntheir control of the Tree of Life must end, and the Hex must be shattered.  Table\n Lystania's Projection\n  &6[Lytania]\n The Hex, cast above the Wolfswoods, was formed by the Coven and is, in part, used to keep Hycenea captive, we understand. We\nalso believe it is draining the life from Harrakfar in his cell, and is being used to try and consolidate power and claim\ndominion over the entirety of the Woods.\n&o  C: Speak to any of Lystania's Projections now that you've heard all the history she has to tell. Table\n Lystania's Projection\n  &6[Lytania]\n Now you have seen our history. Return to me at the Village.\n&o  C: Speak to Elder Lytania again. Table\n Elder Lytania\n  &6[Elder Lytania]\n Thank you for joining me up there. I hope you see why this is so important.\n  &5[So what do you need me for?]\n  &6[Elder Lytania]\n You have much power, all contained within a singular body. Our power is spread across many, yet what I hear of you is that you\nare a conqueror of might. You are the tool that will break the Council open, [Player]. Now, I have an ask of you.\n  &5[What can I do?]\n  &6[Elder Lytania]\n We wish to commune with Hycenea one last time before we breach the Tree of Life and free her. The best way to do this is to\nstep into the realm of Dreams and reach out. Could you travel back to the Amanita Colony from whence I saved you? A surprise\nattack will help your soldiers escape if they have not already. More importantly, I need several ingredients for this magic,\nfound in their encampment. I seek Blue Lotus, Divinorum Extract, and Fanged Valerian. Gather these and return.\n  &5[You can count on me.]\n  &6[Elder Lytania]\n Return when you have found them all.\n Head back to   Link   Amanita Colony Amanita_Colony wikilink  .\n&o  C [1/3]: Find the Blue Lotus.\n&o  C [2/3]: Find the Fanged Valerian.\n&o  C [3/3]: Find the Divinorum Extract.\n (Compass will lead you to each one.)\n After collecting every ingredient:\n&o  C: Bring the ingredients back to Elder Lytania. Table\n Elder Lytania\n  &6[Elder Lytania]\n Ah, I can tell you have been successful. My thanks. I hear your Dichen associates got out safely as well. Do you wish to join\nthe dream with me and my fellow Aradia?\n  &5[Yes.]\n  &6[Elder Lytania]\n Splendid. Let me prepare these toxins then and off we shall go... {...}\n  &6[Hycenea]\n Hail again, hero. I tried... to reach out... before. You have met... my kin. It soon will... be the hour of the witch. {...}\n  &6[Elder Lytania]\n Hail, o queen of the woods. We have found a hero, a vessel of all ye stand for in thy light. {...}\n  &6[Hycenea]\n I am familiar, Lady Lytania. I am preparing... for your arrival. At last, to be... reunited... with my Harrakfar. At last...\n{...}\n  &6[Elder Lytania]\n My goddess, we cannot wait to at last prostrate in your presence and receive thy blessings. {...}\n  &6[Hycenea]\n I hope your hero knows the consequences of their actions here.\n  &5[I do.]\n  You try to speak, but nothing comes out.\n  &5[I DO!]\n  Still nothing but silence. The darkness seems to be gazing at you, waiting for an answer. {...\n }\n  &6[Elder Lytania]\n Perhaps the dream is too heavy for them here. They know what must be done. The Coven, executed. The Hexes, destroyed. The\nPrison, a gift for you, my goddess. {...}\n  &6[Hycenea]\n Excellent. Then the time of the Aradia approaches, my adherents. We will bring forth peace and Life, at last...\n&o  C: Speak to Elder Lytania. Table\n Elder Lytania\n  &6[Elder Lytania]\n Thank you for your time with us, [Player]. I am sure we will see you soon enough.\n  &5[Well, I should be going back to Verdanne. I doubt she'll be happy to hear the outcome of my meeting with the Mycelia...]\n  &6[Elder Lytania]\n Hm. How sad. Well, I wouldn't want to have Verdanne too sullen. You should tell her this - the time is right, and the hour of\nour Lady is almost upon us. Goodbye.\n&o  C: Return to Primirium Verdanne. Table\n Primirium Verdanne\n  Coordinates: [-317 181 -663]\n   &6[Verdanne]\n Excellent, you return at last. The pikemen told me what happened and how you got magicked away. I assume... a mutual friend was\ninvolved?\n  &5[She was.]\n  &6[Verdanne]\n I suppose that saves us sending you to meet them then. Are you still in? Did she send news?\n  &5[I'm still in. She said \"The hour of our Lady is almost upon us\".]\n  &6[Conquort]\n Splendid! I'll ready the troops posthaste! {...}\n  &6[Verdanne]\n \"Almost\", Conquort, \"Almost\". Prepare them, but do not assemble. The Coven will notice. We need to be prepared. [Player] here\nwill be integral in helping us break down defenses and accessing the Tree of Life itself. I can barely believe it's all so\nclose. I will await word from Lytania, and will call you when it is time to begin. {...}\n  &6[Tybale]\n Thank you for all your assistance thus far. We're all very glad you didn't die. Take this, for your troubles. We'll talk soon!\n  &5[Thank you.]\n  '''OF MUSHROOMS AND MAGIC COMPLETE!'''\n  Awarded a Hyperchromatic Archos Ring, the Mycelian Crescent, and 4000 Archos Rings... of your debt removed. Only 2722 left!\n", "reward": "rewards =\n* a Hyperchromatic Archos Ring\n* &3Mycelian Crescent&r\n"}