{"name": "Out With A Bang", "information": "prerequisites = None\n NPC: Ebonee Coords: -1760, 132, -51\n Celsian Isles Wispervale\nPOI: &3Frigid Laboratory&r\n", "dialogue": "}} \n&o  Find Ebonee's wand and learn more about today's plans. Table  AlignDefault ColWidthDefault AlignDefault \n Ebonee \n  Coordinates: [-1760, 132, -51] \n   &6[Ebonee] \n Oh no, don't tell me I've lost my wand... This can't be happening right now, I need it for my plans later on! \n  &5[What'cha lookin' for?] \n  &6[Ebonee] \n My wand! I can't believe I've been such an idiot as to misplace it today of all days!  \n  &5[What's so special about today?]  \n  &6[Ebonee] \n Hm, how do I know you won't tell someone else? I can't exactly trust you at the moment. \n  &5[Can't you just magic your wand into your hand or something?]  \n  &6[Ebonee] \n I would need a wand to do that in the first place... \n  &5[Maybe I could help?] \n  &6[Ebonee] \n Oh! That would be marvelous. Could you go check my quarters? I might've left it there. \n  &5[But I'm not a student, I don't think I can enter them...] \n  &6[Ebonee] \n Oh, I'm sure there's a secret passage somewhere- an old academy like this has gotta have some!  \n&o  C: Search for a way in to the quarters so you can find Ebonee's wand. \n  Go through the painting in the lowest floor of the academy at Coordinates: [-1812, 131, -65] then move and parkour through the quaters. \n   color|teal|You've found the wand! Head back to Ebonee now. \n&o  C: [1/2]: Return to Ebonee with the wand. \n&o  C: [2/2]: If you have misplaced Ebonee's wand you will need to get it back. Table  AlignDefault ColWidthDefault AlignDefault \n Ebonee AlignDefault \n  &6[Ebonee] \n Oh thanks! You've found it! \n  &5[No problem! Now that I've done a favour for you, do you trust me enough?] \n  &6[Ebonee] \n Well... yeah, I suppose I could let you in on it. So, a couple of us are planning on pranking the teachers by letting off a ton of fireworks in the academy! \n  &5[Sounds exciting!] \n  &6[Ebonee] \n Yup! It'll be hilarious to see the looks on their faces! But, well... the problem is that we can't transfigure any fireworks at the moment. \n  &5[Why's that?] \n  &6[Ebonee] \n Well, the supplies for that are locked away in a secure wing in the Academy. It's got tons of magical seals on it to repel students... \n  &6[Ebonee] \n BUT! Perhaps you'll be able to access it since you're not a student! Have a look around the the lower floors, there might be an entrance there.  \n&o  C: Search for the entrance to the confiscated storage wing and find the item for Ebonee inside it. \n  The confiscated storage wing is just at the very bottom of the Academy staircase. \n   Parkour your way across to the coords [-1794, 99, -100] and grab the firework star in the chest. \n &o  C: Return to Ebonee once more. Table  AlignDefault ColWidthDefault AlignDefault \n Ebonee AlignDefault \n  &6[Ebonee] \n Awesome! You've got it! Now, this stuff gives our fireworks their boom, but we'll still need one more ingredient so we can make this prank a reality. \n  &5[Which is?] \n  &6[Ebonee] \n An Incendiary Charge so that we can give our fireworks a longer flight time! \n  &5[Where would I find that?] \n  &6[Ebonee] \n Check the old   Link   Frigid Laboratory Frigid_Laboratory wikilink outside the city. This stuff sounds right up their alley!  \n&o  C: [1/2] Search for the Incendiary Charge inside the   Link   Frigid Laboratory Frigid_Laboratory wikilink  . \n&o  C: [2/2] Once you have the Incendiary Charge return to Ebonee. Table  AlignDefault ColWidthDefault AlignDefault \n Ebonee AlignDefault \n  &6[Ebonee] \n Oh, hey, you found some! Oh, this is gonna be soooo great! I can't wait to see the looks on their faces... \n  &5[Alright, so are we just about ready to get this prank rolling?] \n  color|gray|She jumps up and down excitedly!}} \n  &6[Ebonee] \n Yeah! Thankfully, because of magic, it makes setting up this whole thing real easy. I'll contact my friends really quickly, but let's make our way there right now!  \n  &5[Give me a sec.]  \n  &6[Ebonee] \n Alright, let me know when you're ready then. \n  &5[Alright, let's go!] \n  &6[Ebonee] \n Sweet, so I believe this is the right incantation... EXPECTO WARPONUS! \n  color|gray|You feel a rush of wind around you as the world falls away and goes dark... \n  color|teal|Ebonee and her friends cast a few incantations and the room is filled with fireworks! \n  color|teal|As the students finish their prank you feel the same sensation as before. You open your eyes next to Ebonee.  \n&o  C: Talk with Ebonee about the prank you've just witnessed. Table  AlignDefault ColWidthDefault AlignDefault \n Ebonee AlignDefault \n  &6[Ebonee] \n Oh my gosh, that was so good! That'll leave a few scorch marks in the lobby for sure! Hey, thanks for helping us out with this. Couldn't have done it without you! \n  &5[No problem!] \n  &6[Ebonee] \n Here, take this... It's some Bewitched Fireworks we used in the prank. Have some fun with those!   AlignDefault \n  color|teal|'''OUT WITH A BANG COMPLETE!''' \n  color|teal|Awarded 32 [[Bewitched Firework]]s and 16 Compressed Crystalline Shards!  ", "reward": "rewards =\n* 32 &3Bewitched Firework&rs\n* 16 Compressed Crystalline Shards \n"}