{"name": "Outer Demons", "information": " NPC: Helring King's Valleytown = Lowtidestarting_npc_coordinates = 722, 70, 523rewards=*Access to the &3Azacor the Dark SummonerAzacor&r boss fight\n*Teleports in and out of the &3Azacor’s Grovestarting_npc_coordinates = 722, 70, 523rewards=*Access to the &3Azacor the Dark SummonerAzacor&r boss fight\n*Teleports in and out of the &3Azacor’s Grove King's Valleytown = Lowtidestarting_npc_coordinates = 722, 70, 523rewards=*Access to the &3Azacor the Dark SummonerAzacor&r boss fight\n*Teleports in and out of the &3Azacor’s Grovetown = Lowtidestarting_npc_coordinates = 722, 70, 523rewards=*Access to the &3Azacor the Dark SummonerAzacor&r boss fight\n*Teleports in and out of the &3Azacor’s Grove", "dialogue": " Table\n Helring SoftBreak  Coordinates: 722, 70, 523\n  Color|orange|[Helring]\n Hi, I'm Helring. I curate the mystical and arcane section of the library. It can all be quite interesting knowledge when used\nin moderation.\n  Color|purple|[I am a great adventurer, do you have a quest for me?]\n  Color|purple|[Knowledge used in moderation?]\n  Color|purple|[Tell me about yourself.]\n  Color|orange|[Helring]\n A quest? Well perhaps it wouldn't be that grand, but I lost my diary a few years back and haven't been able to bring myself to\nretrieve it. Could you do that for me?\n  Color|purple|[Sure, I can find your diary for you.]\n  Color|purple|[That sounds beneath me.]\n  Color|orange|[Helring]\n Thank you so much. I left it in the study of an outpost I was stationed at. It lies down the stream that goes through the\nCursed Forest. The journey should be simple and the monks there should help you find my old desk.\n&o  Retrieve Helring's diary at 1467, 174, 101 Table\n  Color|orange|[Ghostly Whisper]\n You would be wise to go no further. Visitors aren't welcome. SoftBreak &o  After retrieving the diary.\n  Color|orange|[Ghost]\n I thought I told you to stay away, but it seems the monk I spared has sent you to retrieve her diary.\n  Color|orange|[Ghost]\n Here's your adventurer back. Do not return.\n  Color|orange|[Helring]\n How could he still be around?\n  Color|purple|[Who was that?]\n  Color|orange|[Helring]\n That... that was Azacor. But Aesir killed him... I don't understand.      Color|purple|[Stop him? What is he doing?]\n  Color|purple|[Well he seems angry, I probably shouldn't go back there.]\n  Color|orange|[Helring]\n Azacor is a wicked summoner who... who did some terrible things in the past, It's why I was stationed in the Grove while I was\nwith the Axtans.\n  Color|purple|[What can I do?]\n  Color|orange|[Helring]\n We must investigate further. I need to know how he managed to cling on to this world. Furthermore, he still seems dangerous,\neven as a ghost. He had a mansion near the back of the grove where you may find out more.\n  Color|purple|[I'll go back and explore Azacor's mansion.]\n  Color|purple|[I really don't want to go back.]\n  Color|orange|[Helring]\n Thank you so much. I'll need to prepare... mentally... before returning to that place.\n&o  1/2 - Find a way into Azacor's ritual room\n 2/2 - Find a way to get past the barrier in Azacor's ritual room. Table\n  Color|orange|[Azacor]\n Congratulations, you've gone from nuisance to problem. Looks like I'll need to deal with you more... personally.\n  Color|orange|[Azacor]\n I'll show you just how much of a nightmare I can truly be.\n  Color|orange|[Azacor]\n No no, your torment is not quite over yet.\n  Color|orange|[Azacor]\n How about we clean you off a little.\n  Color|orange|[Azacor]\n You are in my territory now.\n  Color|gray|As your vision goes black, you feel as if a hand is reaching out to you.\n  Color|orange|[Helring]\n Oh thank goodness you are okay.\n  Color|orange|[Helring]\n Thank goodness I found you      Color|purple|[Thank you for saving me!]\n  Color|purple|[You got here just in time!]\n  Color|purple|[This is getting serious, what's our next move?]\n  Color|orange|[Helring]\n While looking for you I found Azacor's ritual room beneath the mansion as well, and it seems he was hiding the secret to his\ndemise. We need to get to the Undergrowth to trap him in Ancient Wyrmwood.\n  Color|purple|[How does that work?]\n  Color|purple|[Alright let's go.]\n  Color|orange|[Helring]\n I'll meet you there!\n&o  You need to trap Azacor in Ancient Wormwood in the Undergrowth. Get there and survive.\n Click on the button at 1480, 42, 118. Table\n  Color|orange|{[Azacor]\n I see you stumbled upon the source of the Wyrmwood. Of course, you don't really expect me to let you leave this location alive,\ndo you?\n  Color|orange|[Helring]\n Don't worry, I'm here to help! With the spell we found at his mansion we can bind Azacor to the Wyrmwood, and limit the damage\nhe can bring to the Valley. Just keep him distracted for a little while!\n  Color|orange|[Helring]\n I got him! The fiend is now bound to this sanctum!\n  Color|orange|[Azacor]\n What foolish magic is this? No! You cannot keep me here forever! I will be unbound, and I shall destroy everything and everyone\nyou care about! You will never rid the Valley of me!\n  Color|orange|[Helring]\n We did it! Thank you for helping me put my past to rest. Azacor won't be able to cause trouble anymore, but he still isn't gone\nfor good. Speak with me later and we can move forward with taking the fight to him.\n Outer Demons Complete SoftBreak  Awarded access to the   Link   Azacor Azacor_the_Dark_Summoner wikilink boss fight and\nteleports in and out of the   Link   Grove Azacor’s_Grove wikilink via Helring.\n", "reward": "rewards=*Access to the &3Azacor the Dark Summoner|Azacor&r boss fight\n*Teleports in and out of the &3Azacor’s Grove|Grove&r via Helring."}