{"name": "Overdoomed", "information": "prerequisites = None\n NPC: Archivist Saanavi Coords: -1826, 127, -83\n Celsian Isles Wispervale\n", "dialogue": "  WorkInProgress|Poison Cypress Ending\n&o  Aggressively reclaim an overdue book for Archivist Saanavi.\n Archivist Saanavi can be found in the library section of the Academy. The library section is at the bottom of the staircase.\nTable\n Archivist Saanavi\n  Coordinates: [-1826, 127, -83]\n   &6[Archivist Saanavi]\n Welcome, welcome to the grand library, the greatest archive of knowledge in all of the Isles. Is there anything I can help you\nwith?\n  &5[I'm looking for adventure!]\n  &6[Archivist Saanavi]\n I see. You are experienced in the arts of war and combat, correct?\n  &5[Not particularly.]\n  &6[Archivist Saanavi]\n Ah. Such a shame.\n  &5[Very experienced, yes.]\n  &6[Archivist Saanavi]\n Perfect. There is a student of the academy, as skilled as he is arrogant. His book is overdue. Kill him.\n ...\n ...\n Or, just get the book back. Either way.\n  &5[This seems excessive. I'm out.]\n  &6[Archivist Saanavi]\n Excessive!? Books are serious business.\n  &5[Get the book, maybe murder someone. Got it.]\n  &6[Archivist Saanavi]\n I knew I could count on you. He goes by Cypress. Like most of the older, more arrogant students, you won't find him in either\nclass or the library. Perhaps check the bar in town, that sounds precisely where book-hoarding scum would hang out.\n&o  C: Find Cypress at the bar and ask him where the book is. Table\n Cypress\n  Coordinates: [-1784, 133, -20]\n   &6[Cypress]\n Wha, whach you want?\n  &5[Who are you?]\n  &6[Cypress]\n Meee? I'm Cypressssh, the soon to be most famous mage in the worlllddddd!\n  &5[Saanavi says you have an overdue book.]\n  &6[Cypress]\n Book? Pshhhh, I lost that weeeeeks ago. Vanished while adventuring, true, true shhtory.\n  &6[Cypress]\n I shupposeeee I could just tell you where the book isss, but I like games. If you can outdrink me, Cypresssh, the best mageee\nin the world, I'll tell you where. Deal?\n  &5[You're on!]  Plain  (Starts the Drinking Minigame)\n  &5[Or I could just kill you.]\n  &6[Cypress]\n Heh, good luck. Whisshpervale's got the best wards around! No punchesss, magic, knives, nothin'! Can't even sshlap people. I'm\ncompletely immortallll! Unlesssh, like my drink is poisoned or ssshomething, heh...\n The barkeeper has some hints and advice.\n Link   Puzzle Solutions Guide/Overdoomed Puzzle_Solutions_Guide/Overdoomed wikilink\n   &6[Cypress]\n *Hurkk* Alright, you win. I lossht the book in the Mountain Market, to the sshoutheassht. It'ss yours, jussht leave me to my\nhangover...\n&o  C: [1/2] Retrieve the book from the   Link   Mountain Market Mountain_Market wikilink  .\n&o  C: [2/2] Once you have the book take it to Saanavi. Table\n Archivist Saanavi\n  &6[Archivist Saanavi]\n Welcome, welcome to the grand library, the greatest archive of knowledge in all of the Isles. Is there anything I can help you\nwith?\n  &5[I got the book.]\n  &6[Archivist Saanavi]\n Wow! I knew I could count on you get the book! Shame you couldn't make an example of that scumbag though. Maybe someone else\nwill be willing to help instill fear into the hearts of students...\n    Header if_you_poison_cypress  If you poison Cypress:\n Cypress dies and drops the Market Flag. The book is still found at the Mountain Market. The reward is   Link   Tome of Lost\nTime Tome_of_Lost_Time wikilink and 96 Compressed Crystalline Shards.\n", "reward": "rewards =\n* &3Tome of Lost Time&r\n* 48 or 96 Crystalline Shards\n"}