{"name": "Primeval Creations II", "information": "prerequisites = &3Primeval Creations I&r\n NPC: &3Abandoned LibraryThe Abandoned Library POI&r Coords: \n Celsian Isles Alnera\n", "dialogue": "}} \n  WorkInProgress|Coordinates, puzzle solutions, and double checking.}} \n Solution to puzzles:   Link   https://monumenta.wiki.gg/wiki/Puzzle_Solutions_Guide/Primeval_Creations_II https://monumenta.wiki.gg/wiki/Puzzle_Solutions_Guide/Primeval_Creations_II  \n C:   &o  You found another one of Selari's journals. Journey back into his workshop and see what you can find. Remember to bring some uncharged tesseracts with you. \n After entering the orange room: \n  color|teal|THE POWER OF BODY \n  color|gray|After Soul comes Body, the physical manifestation of everything that we are, the shell with which we interact with the world. And like the soul, all bodies are different, each harboring its own strengths and weaknesses. Through a unique formation of various creatures, one may concentrate the very power of Body itself. \n After completing the puzzle: \n  color|gray|With the body comes fortitude, and through fortitude comes strength. The absolute and total control over the physical self - this is the true power of the Aspect of Body. However, this experiment was ultimately a failure. The power of Body alone was not what I required, thus it was time to progress onwards. \n After entering the Magenta room: \n  color|teal|THE POWER OF PESTILENCE \n  color|gray|And after Body comes Pestilence, the corruption that engulfs the body and shifts it away from equilibrium. All diseases carry with them a small portion of that power and, through infecting isolated creatures with exactly one disease, that power can be collected. \n After completing the puzzle: \n  color|gray|Pestilence spreads relentlessly, rooting its corruption to the core of that which it has infected until it ceases to exist. That is the true power of the Aspect of Pestilence. As before though, this experiment has resulted in failure. The power of Pestilence alone is not what I require, thus it is time to progress onwards. \n PRIMEVAL CREATIONS II COMPLETE! SoftBreak  Awarded a   Link   Tesseract of the Body Tesseract_of_the_Body wikilink and a   Link   Tesseract of Pestilence Tesseract_of_Pestilence wikilink  . ", "reward": "rewards =\n* &3Tesseract of the Body&r\n* &3Tesseract of Pestilence&r\n"}