{"name": "Primeval Creations VI", "information": "prerequisites = &3Primeval Creations V&r\n NPC: &3Magmortic AtheneumThe Magmortic Atheneum POI&r Coords: ~(584, 11, -408)\n Celsian Isles Alnera\n", "dialogue": "}} \n  WorkInProgress|Exact book coords, puzzle solutions, and double checking}} \n Puzzle Solutions:   Link   https://monumenta.wiki.gg/wiki/Puzzle_Solutions_Guide/Primeval_Creations_VI https://monumenta.wiki.gg/wiki/Puzzle_Solutions_Guide/Primeval_Creations_VI  \n C:   &o  [1/2]: You found another one of Selari's journals. Journey back into his workshop and see what you can find. Remember to bring some uncharged tesseracts with you. \n C:   &o  [2/2]: If you lost the journal from the Alnera Archives, you can find another one there. \n After you enter the cyan room: Table  AlignDefault ColWidthDefault AlignDefault \n Distant Voice AlignDefault \n  &6[Distant Voice] \n Welcome back, Selari. It has been some time. \n  &6[Distant Voice] \n Would you like to play a game? \n  &5[Who's speaking?] \n  &6[Distant Voice] \n Have you forgotten me already? \n  &6[Distant Voice] \n I am an artificial mind, created by your hand. \n  &5[Uh... right. And why did I do that again?]  \n  color|teal|THE POWER OF MIND \n  color|gray|Mind... A power one would assume is related to Knowledge, yet its applications do not lie in simply wisdom. Mind is the inherent root of reason, and without reason, one would simply lose their sanity. This machine must push the limits that reason in order to truly concentrate this power... \n  &6[Artificial Mind] \n To unlock the power of Mind, we shall face off in a battle of will. As such, these shall be the rules for our game:  Plain  Turns shall be taken one at a time. I shall make the first move, followed by your's, and so on. Plain  A piece shall be moved across this screen by turns, and can never return to a position it has already held. Plain  Position changes can only be made in L-shaped movements. That is, in movements of 2x1 or 1x2. Plain  The loser of a round is determined when a move can no longer be made. If you are trapped and cannot progress, you have lost. Plain  You must defeat me in this game 3 consecutive times. Only then will the power of Mind be unlocked. \n After beating the AI: \n  color|gray|I was incorrect, reason is not the underlying nature of Mind, but merely a part. The ability to clearly perceive the world, the true nature of all things around you, and the reason by which to put that understanding into perspective - that is the true power of the Aspect of Mind. However, it is an unstable power, difficult to control. It's usefulness is yet to be seen. \n After entering the purple room: \n  color|teal|THE POWER OF EMOTION \n  color|gray|Another aspect that seemingly draws from human nature, though Emotion would not have been a power I would have expected previously. I was hoping that I would be able to continue on without more test subjects, but it seems I will need them. I must create a way to force emotion upon them... Table  AlignDefault ColWidthDefault AlignDefault \n Caged Citizen AlignDefault \n  &6[Caged Citizen] \n Hey, you! Get me out of here! Please!  \n  &5[How did you get here?]  \n  &6[Caged Citizen] \n I... I don't know! I went to sleep one night, and when I woke up, I was here. There was this strange man, as well. Kept mumbling something about emotions. Proper creep. \n  &5[This cage doesn't seem to have a gate. Do you know of any way I can get you out?] \n  &6[Caged Citizen] \n No idea. This machine may have something to do with it. Maybe if you fire it up, it'll open? \n  &5[The configuration it wants doesn't seem mathematically possible.]  \n  &6[Caged Citizen] \n Gah, are you saying I'm stuck here?! \n  &5[Do you happen to know anything about this machine?] \n  &6[Caged Citizen] \n Not really, it seemed liked that guy was pretty much done with it, so I've never seen it used... OH, I do remember him saying something though... It was a number... What was it... 102? Yeah that sounds right. Maybe that means something?  \n Rules of the puzzle:  Plain  Two vessels for energy exist in this room - one can hold 5 units, the other, 3 units. Plain  In order to properly send energy to the subject, exactly 4 units of power must be transferred. Plain  However, the smaller vessel is unable to submit power to the subject, so all 4 units must come from the lager vessel. Plain  5 chages of power exist within the system for consumption. \n After completing the puzzle: \n  color|gray|I understand it now, 'emotion' is simply a poetic term. The ability to take that which lies within, that which is intangible, and bring it to the surface, manifested into our realm of existence. That is the true power of the Aspect of Emotion. Only one more power now lies ahead of me... \n PRIMEVAL CREATIONS VI COMPLETE! SoftBreak  Awarded   Link   Tesseract of the Mind Tesseract_of_the_Mind wikilink and   Link   Tesseract of Emotions Tesseract_of_Emotions wikilink  . ", "reward": "rewards =\n* &3Tesseract of the Mind&r\n* &3Tesseract of Emotions&r\n"}