{"name": "Primeval Creations V", "information": "prerequisites = &3Primeval Creations IV&r\n NPC: &3Shroom SpiresThe Shroom Spires POI&r Coords: \n Celsian Isles Alnera\n", "dialogue": "}} \n  WorkInProgress|Coordinates, puzzle solution, and double check.}} \n Puzzle Solutions:   Link   https://monumenta.wiki.gg/wiki/Puzzle_Solutions_Guide/Primeval_Creations_V https://monumenta.wiki.gg/wiki/Puzzle_Solutions_Guide/Primeval_Creations_V  \n C:   &o  You found another one of Selari's journals. Journey back into his workshop and see what you can find. Remember to bring some uncharged tesseracts with you. \n After entering the gray room: \n  color|teal|THE POWER OF DEATH \n  color|gray|Death... The looming inevitability that threatens all who dwell in the world. I know its effects far too well. That said, what power can death itself generate? Does more death produce a higher energy output? The fact that I must ask these questions bothers me greatly, but I believe if I can direct a beam of energy into a block of obsidian, I can generate the answers I require. \n After completing the puzzle: \n  color|gray|My knees buckle slightly at the thought of what I just did, killing a man for my own research and advantage. Would the old me have done that? In my heart, I do not know, but in my mind, I see the bigger significance. The ability to sever metaphysical connections and retool them to your whim - this is true power of the Aspect of Death. How astonishing... \n After entering the light gray room: \n  color|teal|THE POWER OF LIGHT \n  color|gray|In contrast to a power like Balance, the power of Light is the very definition of visualizable. It is something we interact with daily, for if we did not, we could never see the path ahead of us. By compressing light and dispersing it, I believe I can form the power I need with relative ease. \n After completing the puzzle: \n  color|gray|The ability to see, to observe the world around us. This is but a trivial application of this power. No, what lies here is the ability to see further than that - the ability to look beyond what is physical, to pierce into the darkness of fate itself. This is the true power of the Aspect of Light. I must admit, I've not felt as if I was this close to an answer in a very long time... \n PRIMEVAL CREATIONS V COMPLETE! SoftBreak  Awarded the   Link   Tesseract of Death Tesseract_of_Death wikilink and   Link   Tesseract of Light Tesseract_of_Light wikilink  . ", "reward": "rewards =\n* &3Tesseract of Death&r\n* &3Tesseract of Light&r\n"}