{"name": "Pyromania", "information": "prerequisites = None\n NPC: Carbocius Coords: 608, 101, 156\n King's Valley Farr\nPOI: &3Molten Chasm&r, &3Fire Cave&r, &3Volcano&r\n", "dialogue": " Table\n Carbocius\n  Coordinates: [608, 101, 156]\n   &6[Carbocius]\n Welcome, welcome. I can sell you items of a particularly pyromaniacal nature, but first, a question! Look behind me at my\ncollection, and tell me - what am I missing?\n  &5[More rocks?]\n  &5[Sanity?]\n  &5[Umm...]\n  &6[Carbocius]\n Ha, brilliant! Of course, I didn't hear you, but I'm sure it was a fine guess. The answer is, of course, new samples! My\ncollection of pyroclastic flows is drying up, and requires new samples from the geologic features nearby. What do you say, old\nchum, think you could dig up three fresh magma samples?\n  &5[Sure, I like geology.]\n  &5[I don't think so.]\n  &6[Carbocius]\n Ah ha, I think I just heard an enthusiastic \"yes\"! Brilliant, old chap, it's great to see that passion for geology still runs\nrampant! Three magma samples from three different geologic features. Bring them here quick before they harden, chop chop.\n&o  [1/4]: Carbocius needs magma samples. Retrieve one from the Blackroot Jungle's   Link   Molten Chasm Molten_Chasm wikilink\n, just east of Farr.\n&o  [2/4]: Carbocius needs magma samples. Retrieve one from the Jaguar Tooth Mountains'   Link   Fire Cave Fire_Cave wikilink  ,\nnorth of Farr.\n&o  [3/4]: Carbocius needs magma samples. Retrieve one from the Korbar Highlands'   Link   Volcano Volcano wikilink  , just west\nof Highwatch.\n&o  [4/4]: Return to Carbocius once you have all three magma samples.\n After gathering all three magma samples: Table\n Carbocius\n  &6[Carbocius]\n Ha, brilliant! Look at those dolerite inclusions, simply beautiful. Here, have these. It occurs to me you might have preferred\nthis before acquiring these samples, but look at these extrusive patterns!\n PYROMANIA COMPLETE! Awarded the   Link   Geomantic Dagger Geomantic_Dagger wikilink and 128 XP!\n", "reward": "rewards =\n* 128 Enchanting Bottles\n* &3Geomantic Dagger&r\n"}