{"name": "R is for Reprisal", "information": "prerequisites = &3Bleeding Proof&r\n&3Rapacity&r\n NPC: Wilhelm Coords: -1295, 130, 467\n Celsian Isles Nightroost\n", "dialogue": "  WorkInProgress|make puzzle solutions look right, missing npc coord, missing compass line Table\n Wilhelm, Diplomat of Chillwind\n  Coordinates: [-1295, 130, 467]\n   Color|Orange|[Wilhelm]\n (Player)! There is trouble brewing. Have you noticed there are more mage hunters around?\n  Color|Purple|[I have. What's wrong?]\n  Color|Purple|[Their patrols seem normal to me, even if they are more frequent.]\n  Color|Orange|[Wilhelm]\n Their frequency is what is causing the people to worry. I wish for this place to be peaceful again, and ridding the town of all\nof these hunters is the fastest way to do so. But if you think that those patrols seem normal I will not bother you further.\n  Color|Orange|[Wilhelm]\n There have been whispers that mage hunters have found a way to infiltrate Wispervale.\n  Color|Purple|[Oh, that's not good.]\n  Color|Orange|[Wilhelm]\n It isn't. Listen carefully, I have a contact in Wispervale that I'm worried about. I can't tell you who they are right now, but\nI want to make sure they're alive. The hunters seem to be keeping a close eye on me. If you can confirm that they are okay...\nTell the beautiful lady that Wilhelm will bring her a big bouquet of roses soon.\n  Color|Purple|[Leave it to me.]\n  Color|Purple|[I don't think I can...]\n  Color|Orange|[Wilhelm]\n I understand that it is dangerous. I'm sorry for asking you to do something so risky.\n  Color|Orange|[Wilhelm]\n I knew I could count on you.\n ''Investigate the academy library in Wispervale and try to decipher the hint Wilhelm gave you.'\n After finding the book   Link   Belladonna Belladonna wikilink  :\n  Color|Grey|You recognize this name! Belladonna - she helped you during your adventure to find the Palace of Mirrors!\n&o  Find Wilhelm's contact and your ally, Belladonna, in her house in Wispervale. Table\n Belladonna\n  Coordinates: [-1720, 135, -77]\n   Color|Orange|[Belladonna]\n (Player)? What brings you here?\n  Color|Purple|[Wilhelm said he would bring you a big bouquet of roses soon.]\n  Color|Orange|[Belladonna]\n ...He told you then? I suppose we need all the help we can get. Though, if it's you, then I'm sure we will succeed.\n  Color|Purple|[How can I help?]\n  Color|Orange|[Belladonna]\n Let me bring you up to speed on the current situation. Somehow, mage hunters have brute forced their way into the town. I don't\nknow who they are, but it's making things difficult for me...\n  Color|Purple|[Why?]\n  Color|Orange|[Belladonna]\n I've been trying to strengthen the magical barrier that surrounds Wispervale but I'm afraid of getting caught by a hidden mage\nhunter. If I don't do it soon, the barrier protecting this city will disappear. But it's too risky to do anything right now.\n  Color|Purple|[What should we do then?]\n  Color|Orange|[Belladonna]\n I don't think I can easily sneak around at night without getting caught. Could you take these magic crystals and set them at\nfour points in the town?\n  Color|Purple|[Okay, leave it to me!]\n  Color|Purple|[I don't think I can do it.]\n  Color|Orange|[Belladonna]\n I know it's risky. Let me know if you change your mind.\n  Color|Orange|[Belladonna]\n I knew I could count on you! We only have a small window of time to get this right so let me know when you're ready!\n&o  R is for Reprisal: Talk to Belladonna and find out what help she needs. Table\n Belladonna\n  Coordinates: [-1720, 135, -77]\n   Color|Orange|[Belladonna]\n Are you ready to help me?\n  Color|Purple|[Yeah! Let's do it!]\n  Color|Purple|[I need some more time...]\n  Color|Orange|[Belladonna]\n Alright, let me know when you are ready.\n  Color|Orange|[Belladonna]\n Very well, let's go.\n&o  Find the 4 locations in Wispervale and place the crystals.\n&o  Place down the 4 crystals across Wispervale. Belladonna can give you more if you lose them.\n  - By fountain [-4441, 132, 628]\n - By southern gate [-4433 140 700]\n - Campfire on ridge [-4374 138 612]\n - By Wispleaf tree [-4430 139 567]\n  After placing the crystal on the fountain:\n  Color|Cyan|You place the crystal on the edge of the fountain. It hums quietly.\n  Color|Cyan|You hear some Mage Hunters talking loudly in the house nearby...\n  Color|Orange|[Mage Hunter Kyle]\n Man, this is so boring! I can't see any mana threads and everyone is so scared of us. It's impossible to pinpoint who is a mage\nand who isn't!\n  Color|Orange|[Mage Hunter Amanda]\n Don't worry, the Grand Hunter himself said the barrier around this town was weakening. Those scummy mages will eventually have\nto come out of their hiding place to restore the barrier or it will fade away.\n  Color|Orange|[Mage Hunter Kyle]\n Really? Then we can strike when the opportunity arises! Do you think we can catch them before the meeting?\n  Color|Orange|[Mage Hunter Amanda]\n Shhh! Don't talk about the meeting! It's supposed to be a secret, what are you going to do if someone hears us and finds out!\n  Color|Orange|[Mage Hunter Kyle]\n What's the worry? Everyone here knows about the curfew. How would they be able to get to Frostgate without us knowing anyways?\n  Color|Orange|[Mage Hunter Amanda]\n I guess... Table\n Belladonna\n  Coordinates: [-4390, 135, -581]\n   Color|Orange|[Belladonna]\n Excellent work, I'll quickly restore the barrier. We should be safe for now.\n  Color|Purple|[I found out something that I think you should know.]\n  Color|Orange|[Belladonna]\n Oh? Did you learn something?\n  Color|Purple|[The mage hunters were ordered by someone called the Grand Hunter. They're holding a meeting in Frostgate soon.]\n  Color|Orange|[Belladonna]\n This is definitely helpful information, thank you. Hmm... I think that we need to find out more about this mysterious Grand\nHunter.\n  Color|Purple|[How should we go about that?]\n  Color|Orange|[Belladonna]\n Hmm... We should try to infiltrate this meeting that is going to be held. I'll try to find out more about it, and you should\nput together a disguise. Your face is too recognizable though... Can you find a way to change your face? I'll take care of the\nrest, meet back here when you've got a disguise for your face.\n&o  Figure out a way to change your face - again. The Mother of Faces did predict your return... Table\n Spirit of the Forge\n  Coordinates: [-4517, 177, 433]\n   Color|Orange|[Spirit of the Forge]\n I knew you'd return to me. I have an idea of what you need from me, but humor me. How may I help you?\n  Color|Purple|[I need a disguise so I can enter a meeting secretly.]\n  Color|Orange|[Spirit of the Forge]\n Already? You must hurry back when you can. Go.\n  Color|Purple|[I need to leave.]\n  Color|Orange|[Spirit of the Forge]\n Ho ho, you enjoy meddling in affairs that are far bigger than all of us don't you? Help me, and I will help you. My collection\nof faces grows large. Help me organize them and I'll grant you what you ask.\n   :Puzzle_Solutions_Guide/R_is_for_Reprisal\n   Color|Lime|You hear mechanical grinding in the distance as the configuration becomes complete. Table\n Spirit of the Forge\n  Coordinates: [-4517, 177, 433]\n  You feel your face tingle.\n  Color|Orange|[Spirit of the Forge]\n Excellent work. I've given you a face that many will see, but none will remember.\n  Color|Purple|[Thank you.]\n  Color|Orange|[Spirit of the Forge]\n Don't. Not yet at least. Now go.\n&o  With your new disguise, return to Belladonna. Table\n Belladonna\n  Coordinates: [-1720, 135, -77]\n   Color|Orange|[Belladonna]\n (Player)? Judging by your face, you were successful. Here are robes I stole from a mage hunter. I cleaned them for you. I did\nsome more digging and found out the meeting will be held at the Frostgate cathedral. With your disguise you should be able to\nget in.\n  Color|Purple|[Got it. What do I do if they don't let me in?]\n  Color|Orange|[Belladonna]\n Well... You will probably have to find an alternative way in then. Do your best and I'll meet you there!\n&o  Find a way into the Frostgate cathedral to infiltrate the meeting.\n  Enter the sewers at the broken sewer grate at [-1487, 95, 978] Swim through the exit hole marked with two redstone torches at\n[-4351, 147, 433]. Exit the sewers at waters at [-4375, 146, 430] by swimming up.\n &o  Now that you've infiltrated the meeting, listen in and try to blend in. Table\n Belladonna\n  Coordinates: ???\n   Color|Orange|[Belladonna]\n (Player)! You made it! Thank god, I was worried about you. Shhh! We aren't alone. Let's go in now.\n  Color|Orange|[Belladonna]\n Look- the Grand Hunter!\n  Color|Orange|[Elite Hunter ???]\n Nashor! You haven't kicked the bucket it seems.\n  Color|Orange|[Elite Hunter Nashor]\n I see you're still as insufferable as ever Edlynn.\n  Color|Orange|[Elite Hunter Edlynn]\n If I wasn't, you'd be too lonely dealing with the rest of these boring bookends. Anyways, how goes the hunting?\n  Color|Orange|[Elite Hunter Nashor]\n Hunting is as good as always. Mages can't hide their mana trails. It's like tracking a bleeding deer on a snowy day—too easy.\n  Color|Orange|[Elite Hunter Edlynn]\n Just don't hog all of the good ones, okay? I haven't had any mages put up a good fight yet. Most of them just cry and beg for\nmercy before they die.\n  Color|Orange|[Elite Hunter Shirley]\n Most of them don't even know they're sinners. It's normal for them to be like that. The ones you need to be wary of are the\nones who know what they are.\n The Grand Hunter removes his hood.\n  Color|Orange|[Belladonna]\n *Gasp* Is that- the Royal Advisor?!\n  Color|Orange|[Grand Hunter Ridnan]\n My comrades, we are close to cleansing this country of the filth that is magic. It is thanks to your efforts, and your\nsacrifice, that we were able to rid the land of so many mages. But we have one final hurdle to overcome before we can celebrate.\nAshton, tell them what you have discovered.\n  Color|Orange|[Elite Hunter Ashton]\n There are a great number of mages hiding in Wispervale. But a magical barrier stops us from seeing the mana trails we would\nnormally be able to see. I have an inkling of who is responsible for this, so soon we will go and slaughter the rat that has\nturned that lovely town into a dirty sanctuary for sinners.\n  Color|Orange|[Grand Hunter Ridnan]\n Well said Ashton. Once we take that barrier down, we will be able to find all of those abominations and make an example for all\nto see what happens when you try to hide from a hunter.\n  Color|Cyan|You hear Belladonna whimper next to you.\n  Color|Orange|[Grand Hunter Ridnan]\n Let us move on to our next point of discussion. There has been a pain in our side that has been killing our hunters, and they\nhaven't been quiet about their identity. That exiled mage from the Vall-\n  Color|Red|Ridnan's pendant glows. You feel a strange ripple, as if Reality has shifted around you. All eyes turn to you as the\nmagic on your face melts off.\n  Color|Orange|[Belladonna]\n Wha-\n  Color|Orange|[Grand Hunter Ridnan]\n (Player)?! You-\n  Color|Purple|[Advisor Ridnan! You're the Grand Hunter?!]\n  Color|Orange|[Grand Hunter Ridnan]\n I am. It is a great honor to serve her Majesty as both the Royal Advisor and the Grand Hunter.\n  Color|Purple|[You're the member of the Masked hiding in Chillwind!]\n  Color|Orange|[Grand Hunter Ridnan]\n And? Even if I must use unsavory methods, everything I do is for the future of our country.\n  Color|Purple|[Why would you work for a murderer like Calder?!]\n  Color|Orange|[Grand Hunter Ridnan]\n Why not? Aren't you a murderer as well? What makes the life you took different from the life he took? In the end we are all\nkillers. But mages, they are far worse than that. To steal the mana, the lifeblood of nature, from the earth itself and use it\nfor their own selfish purposes. They eat away at the land and make it harder for the rest of us! Even if they don't know they're\nmages- their mere existence is a plague upon these lands!\n  Color|Purple|[Then why are you working with Calder?! He's a mage as well!]\n  Color|Orange|[Grand Hunter Ridnan]\n Calder’s power is simply a means to an end. The path I walk will be covered in blood, and allying myself with him will simply\nspeed up the time it takes to fulfill my god-given duty. Now, get out of my way!\n&o  (Missing - fight compass message)\n  Color|Purple|Ridnan's eyes roll back before collapsing. You hear a commotion outside the room.\n&o  Return to Wilhelm and check in. Table\n Wilhelm, Chillwind Diplomat\n  Coordinates: [-4334, 178, 331]\n   Color|Orange|[Wilhelm]\n (Player), thank goodness you're alright. I heard everything from Belladonna. I arranged a meeting with the Queen immediately.\nGo on, speak to her.\n&o  Talk to the Queen and tell her what happened. Table\n Synnove Obregson\n  Coordinates: [-4339, 179, 329]\n   Color|Orange|[Synnove Obregson]\n (Player), I have been informed of the Grand Hunter’s betrayal. I believe that I owe you an apology for your troubles. To think\nthat Calder had someone planted within our government without our knowing...\n  Color|Purple|You couldn’t have anticipated that this would happen.]\n  Color|Orange|[Synnove Obregson]\n We will have to do a thorough investigation to ensure there are not more... But in the meantime, I thank you for discovering\nthe truth.\n  Color|Purple|I’m glad I could stop them.]\n  Color|Orange|[Synnove Obregson]\n Yes. The Masked and Calder have done enough damage; the mage hunters will be under my control for now. I will cooperate in your\nefforts to reconcile with Ishnir and stop the persecution of mages. I look forward to seeing what you do in the future. I must\nattend to some other business now, but Wilhelm looks like he wishes to speak to you.  Table\n Wilhelm, Chillwind Diplomat\n  Coordinates: [-4334, 178, 331]\n   Color|Orange|[Wilhelm]\n (Player), thank you so much for all you've done. Now that we are on the track to restoring relations between Chillwind and\nIshnir, the future is looking so much brighter.\n  Color|Purple|Yeah, let's hope it gets easier from here on out.]\n  Color|Orange|[Wilhelm]\n Haha, wishful thinking my friend. I'll call for you when I need your help again.\n  Color|Cyan|R IS FOR REPRISAL COMPLETE!\n", "reward": "rewards = &3Crest of Celsia&r if &3Kingdom of Lies&r is already complete.\n"}