{"name": "Raiding Party", "information": "prerequisites = *&3Voyage of Discovery&r \n*&3Unveiled&r\n NPC: Captain Lamis Coords: -746, 83, 1380\n Celsian Isles Misport\nPOI: &3Barracks At Sea&r\n", "dialogue": "}} \n  WorkInProgress|Missing an ending dialogue. Levyn coords.}} Table  AlignDefault ColWidthDefault AlignDefault \n Captain Lamis \n  Coordinates: [-746, 83, 1380] \n   &6[Captain Lamis] \n Arrgh so you're one of those pirates from King's Valley? I suppose I have heard word of you in my travels. Somethin' about some Children of the Trees and collectin' five colored sheep. \n  &5[Y'Arrgh that be me.] \n  &6[Captain Lamis] \n Arrgh Captain Indigo was right, you really are pretty bad at talkin' like a pirate. Listen here, I'm puttin' together a raid on some Viridian outposts. If ye and your mateys tag along and prove your worth, I may be able to convince the rest of the town to accept ye as full-fledged members of our upstandin' community. Do ye want in?  \n  &5[Count us in!]  \n  &6[Captain Lamis] \n Arrgh that's what I like to hear! \n  &5[Who's to say this will earn us a place here?]  \n  &6[Captain Lamis] \n Arrgh haven't ye heard of me?! I be the great Captain Lamis! Ain't no other pirate be more upstandin' or admirable than I. \n  &5[So the other pirates here respect you?] \n  &6[Captain Lamis] \n Arrgh I have many a tale of the great adventures I've led with these fine pirates of Mistport. Perhaps I'll tell you some on our journey. So, are ye in? \n  &5[Perhaps later.]  \n  &6[Captain Lamis] \n Arrgh alright  Table  AlignDefault ColWidthDefault AlignDefault \n Captain Lamis AlignDefault \n  &6[Captain Lamis] \n Now! Fer yer first raid! Ye must sail with yer crew to the mighty Barracks at Sea, nor'east of this here town and find the supply drop I've been promised. I sent Levyn there ahead of you, so you should probably look for him. Bring it back ta' me and prove yer worth! Any questions?  \n  &5[What will I find there?]  \n  &6[Captain Lamis] \n Be on the lookout for guardians of the depths! These islands used ta' be the Viridian Empire, bafore it fell fer reasons we dunno. \n  &5[From whose barracks am I stealing from?]  \n  &6[Captain Lamis] \n Stealing? Nah, this be no stealing. Yer picking up a shipment. You'll be findin' remnants of the fallen Viridian Empire there though, so be on yer guard! \n  &5[Do have you any stories of your prior adventures?]  \n  &6[Captain Lamis] \n Indeed! The mainland near tha' barracks reminds me of the time I ran into Lesark, the Ice Hydra, while searchin' the waters for hapless Chillwind ships.  \n  &5[You were searching for ships to attack?]  \n  &6[Captain Lamis] \n Arrgh, of course, we're pirates! \n  &5[An ice hydra?] \n  &6[Captain Lamis] \n Arrgh indeed. It was quite the sight, although no one quite believes I saw it. The rest of the crew was lookin' the other way. I do hope that someday I can see him again.  \n C:   &o  Travel to the   Link   Barracks At Sea Barracks_At_Sea wikilink and find Levyn to get a supply cache for Captain Lamis. You will have to go down a ladder to find him. Table  AlignDefault ColWidthDefault AlignDefault \n Levyn ( Link   Barracks At Sea Barracks_At_Sea wikilink  ) \n  Coordinates: (Missing) \n   &6[Levyn] \n Ahoy [Player]! I can spot the supply cache we need on the other side of this vault door, but we're going to have to be creative to get past it. \n  &5[What do you have in mind?] \n  &6[Levyn] \n Explosives of course! But only the best TNT will do. Could ye go up into the barracks and grab some high quality TNT? I've seen some lying around. There must be more! \n  &5[Aye aye.] \n  &6[Levyn] \n Arrgh! I'll be here waitin' for ye.  \n C:   &o  [1/2]: Find the Best TNT Ever! \n C:   &o  [2/2]: Talk to Levyn at the Barracks at Sea once you have the Best TNT Ever. Table  AlignDefault ColWidthDefault AlignDefault \n Levyn ( Link   Barracks At Sea Barracks_At_Sea wikilink  ) AlignDefault \n  &6[Levyn] \n Arrgh you've done it! Now stand back. \n  &5[Stand back from what?]  \n C:   &o  [1/2]: Grab the supply cache from inside the vault near Levyn at the Barracks at Sea. \n C:   &o  [2/2]: Return the cache to Captain Lamis. Table  AlignDefault ColWidthDefault AlignDefault \n Captain Lamis AlignDefault \n  &6[Captain Lamis] \n Arrgh next ye need to take yer crew to the Skull Island, just to the east of here. There be two caches there, but me mateys have heard rumblings of trouble. Ye really need to be on yer guard. I sent Samwell and Izzy there ahead of you. Any questions?  \n  &5[Do you have any more stories to tell?]  \n  &6[Captain Lamis] \n Arrgh here be a little history lesson for ye. That ship that stands so majestically in the middle of Mistport is mine, or I suppose used to be. \n  &5[How did you lose it?] \n  &6[Captain Lamis] \n Arrgh that blasted Xeno cheated! That's how. Lost a wager I shoulda known was rigged. \n  &5[Sounds like Xeno can't be trusted.] \n  &6[Captain Lamis] \n Arrgh that's for sure. Everyone in Mistport has some beef with him, but we can't do nothin' about it since he has such a large crew and influence. What I wouldn't give to see him thrown overboard. \n  &5[What will we be expecting there?] \n  &6[Captain Lamis] \n There be a series of forts and I think there be a big underground section. Ye can stay outta there - me mates won't go too deep.  \n C:   &o  [1/3]: Head to   Link   Skull Island Skull_Island wikilink and find Samwell to aid the search for one of the two caches for Captain Lamis. Watch out for trouble. You will have to go down a ladder to find him. \n C:   &o  [2/3]: Head to   Link   Skull Island Skull_Island wikilink and find Izzy to aid the search for one of the two caches for Captain Lamis. You will have to go down a ladder to find him. \n C:   &o  [3/3]: Once you have the caches, return to Captain Lamis. Table  AlignDefault ColWidthDefault AlignDefault \n Samwell ( Link   Skull Island Skull_Island wikilink  ) \n  [-93, 92, 1400] \n   &6[Samwell] \n Weird, I would have thought there would be some loot down here. \n  &5[Arrgh.]  \n After defeating the Saboteur (250hp, tosses tnt sometimes): Table  AlignDefault ColWidthDefault AlignDefault \n Samwell ( Link   Skull Island Skull_Island wikilink  ) AlignDefault \n  &6[Samwell] \n Aha! Whoever that was, they dropped some treasure! I would celebrate more if we didn't have to give it to that greedy pirate Lamis. Here, take it back to Mistport along with Izzy's cache.  Table  AlignDefault ColWidthDefault AlignDefault \n Izzy ( Link   Skull Island Skull_Island wikilink  ) \n  [-142, 98, 1493] \n   &6[Izzy] \n Ahoy [Player]. These tomes are actually quite interesting. But, we're here to find a supply cache to prove we can be pirates or whatever, and for that I need some help with this mechanism here. \n  &5[How does it work?] \n  &6[Izzy] \n It seems that, in order to open up the locked room where the cache is, we need to guess the correct order to light up all of the lamps. Give it a shot.  \n  To complete the puzzle:   Link   Puzzle Solutions Guide/Raiding Party Puzzle_Solutions_Guide/Raiding_Party wikilink \n  After completing the puzzle: Table  AlignDefault ColWidthDefault AlignDefault \n Izzy ( Link   Skull Island Skull_Island wikilink  ) AlignDefault \n  &6[Izzy] \n You did it. Just grab the cache from inside that room up there and bring it to Lamis back at Mistport, with Samwell's cache.  \n Head back to Captain Lamis: Table  AlignDefault ColWidthDefault AlignDefault \n Captain Lamis AlignDefault \n  &6[Captain Lamis] \n Amazing! Ye did it all! Arrgh we need to head to the pub for a bottle o' rum. Care to join me?  \n  &5[N'Arrgh.]  \n  &6[Captain Lamis] \n Arrgh oh dear... \n  &5[Y'Arrgh.] \n  &6[Captain Lamis] \n Arrgh!  \n C:   &o  [1/2]: Enjoy the party, in your crew's honor! When you're all partied out, chat with Captain Indigo. \n C:   &o  [2/2]: Should you somehow leave the party early talk to Captain Lamis to return to it. \n Talking to the npcs at the party: \n  &6[Izzy] \n Well done [Player], but, to be honest, I don't know how much pirating I want to do anymore. I'm getting a bit tired of it. \n  &6[Levyn] \n Yo ho yo ho a pirate's life for me. Arrgh! \n  &6[Salty Bartender] \n We be servin' only te' best grog in te' lands! Have yer self a seat. \n  &6[Samwell] \n I can't believe I had to give up the first treasure I found to another pirate. Just my luck. Table  AlignDefault ColWidthDefault AlignDefault \n Captain Lamis (Party) AlignDefault \n  &6[Captain Lamis] \n Arrgh [Player]! Grab a drink and celebrate with us. Ye are all official Mistport pirates now! \n  &5[I'd like to hear another story if you've got one.] \n  &6[Captain Lamis] \n Arrgh well how could I say no to that request. Alright, how about one about how we founded Mistport, this fine haven for pirates. \n  &5[Sure!] \n  &6[Captain Lamis] \n Arrgh a while back a few of us more renowned captains came upon these lands to see what kind of treasure we could take form the locals. We needed a place to store our plunder so we started makin' camps in the desolate isles. Well turns out they weren't always so desolate. The more we explored, the more treasure we found just lyin' around! \n  &5[You found treasure just lying around?] \n  &6[Captain Lamis] \n Arrgh we did! Turns out there used to be some empire in the Viridian Isles but it collapsed long ago. Even more crazy is that we were acquirin' more treasure just explorin' than we were plunderin', so attackin' locals became more of a hobby and less of a main method of profit. \n  &5[That's insane.] \n  &6[Captain Lamis] \n Arrgh I agree. Anyways, we settled here in Mistport as a base of operations to search for treasure. We're still pirates, but I'd say the most of us are a bit more civilized than ye would expect. Of course, there are always exceptions to the rule like Xeno, but don't let him define us.  Table  AlignDefault ColWidthDefault AlignDefault \n Captain Indigo AlignDefault \n  &6[Captain Indigo] \n Good job [Player]. I'm not sure the rest of the crew could've pulled through without your help. If it hasn't been said already, you've definitely grown into piracy since we first met.  \n  &5[I think the Masked attacked us.]  \n  &6[Captain Indigo] \n The Masked? The wizard's apprentice I ferried over here from the King's Valley mentioned something about them. Are they Dangerous?  \n  &5[I've dealt with them before.]  \n  &6[Captain Indigo] \n Well I'm glad you know what you're doing. We'll deal with them another time, but for now, let's celebrate! \n  &5[They are quite dangerous.]  \n  &6[Captain Indigo] \n (Missing) \n  &5[Where were you during all of that?]  \n  &6[Captain Indigo] \n I had to make a trip back to King's Valley to ferry a very important person here. Some wizard's apprentice or something. Izzy's going to meet with them soon. But forget that, let's celebrate!  \n RAIDING PARTY COMPLETE! SoftBreak  Awarded   Link   Pirate's Flintlock Pirate's_Flintlock wikilink and access to Lamis' return ships near the southern tips of the Dunes of Ishnir and the Chillwind Tundra! \n (Chillwind ship is located by   Link   Supply Fort Supply_Fort wikilink  . Ishnir ship is located by   Link   Charred Arcanery Charred_Arcanery wikilink  ) ", "reward": "rewards =\n* &3Pirate's Flintlock&r \n* the ability to ferry from the &3Supply Fort&r and &3Charred Arcanery&r to Mistport on Lamis' ship\n"}