{"name": "Rapacity", "information": "prerequisites = *&3Xenophobia&r\n*&3Mirrored Egos&r\n*&3Secrets Best Left Forgotten&r\n*Completed &3Salazar's Folly NPC: Historian Rhodes Celsian Islestown = Mistportstarting_npc_coordinates = -757, 83, 1346rewards = *&3Varcosa's Doublet&r\n*&3Grasp of Avaricestarting_npc_coordinates = -757, 83, 1346rewards = *&3Varcosa's Doublet&r\n*&3Grasp of Avarice Celsian Islestown = Mistportstarting_npc_coordinates = -757, 83, 1346rewards = *&3Varcosa's Doublet&r\n*&3Grasp of Avaricetown = Mistportstarting_npc_coordinates = -757, 83, 1346rewards = *&3Varcosa's Doublet&r\n*&3Grasp of Avarice", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Historian Rhodes SoftBreak  Coordinates: -757, 83, 1346 AlignDefault \n  Color|orange|[Historian Rhodes]}} \n Ah, hello there Captain   RawInline   Color|purple|[Do you need me for something?]}} \n  Color|purple|[You don't have to call me captain, you know.]}}  \n  Color|orange|[Historian Rhodes]}} \n Oh I know, but where's the enjoyment in that? Let's have some fun with it! Besides, that scraggly jerk Jones constantly stands outside my window, and he might skin me like a cat if I don't show respect. \n  Color|orange|[Historian Rhodes]}} \n Yes, in fact I do! Tell me, in your adventures through Viridia, did you ever come across the name \"Salazar\"? \n  Color|purple|[Can't say I know that name.]}}  \n  Color|orange|[Historian Rhodes]}} \n Shame, I'll give you brief history lesson then on what I was able to dig up. Salazar, it seems, was the original founder of the Viridian Empire. \n  Color|purple|[I may have once or twice.]}}  \n  Color|orange|[Historian Rhodes]}} \n Fantastic! From what I was able to dig up in my extensive research since your stride through Viridia, it seems that Salazar was the founder of the Viridian Empire. \n  Color|purple|[How does this concern me though?]}} \n  Color|orange|[Historian Rhodes]}} \n Well you see, while I've been able to uncover quite a fair amount of information from the city, it seems all account of Salazar's whereabouts post-fall of Viridia... simply don't exist, at least that we have found. \n  Color|purple|[Perhaps he died?]}} \n  Color|orange|[Historian Rhodes]}} \n While it is a possibility, something in my gut tells me that is incorrect. The ruler of one of the three great empires, the possessor of the wool of Knowledge, simply dropping dead due to unstable conditions and an experiment that seemingly went south? Something doesn't quite sit right with me there. So my question to you is, would you assist me and my team in trying to uncover the fate of Salazar? \n  Color|purple|[Sure, I've got the time.]}} \n  Color|purple|[Why are you so worried about this to begin with?]}}  \n  Color|orange|[Historian Rhodes]}} \n I'm a historian! Cataloging as much historical information as I possibly can is what I do best, and this gaping hole in history keeps me up at night. \n  Color|purple|[I can't right now, sorry.]}}  \n  Color|orange|[Historian Rhodes]}} \n Shame, perhaps if you get some time later. \n  Color|orange|[Historian Rhodes]}} \n Fantastic! When you are prepared to head out, let me know.  \n&o  Speak to Historian Rhodes about the place he wants to take you. Table  AlignDefault ColWidthDefault AlignDefault \n Historian Rhodes AlignDefault \n  Color|orange|[Historian Rhodes]}} \n Are you ready to head out? \n  Color|purple|[Where are we going?]}}  \n  Color|orange|[Historian Rhodes]}} \n Oh, you'll see when we get there. My team has put in quite a bit of work since the last time you saw it. \n  Color|purple|[Yes, I'm ready.]}} \n  Color|orange|[Historian Rhodes]}} \n Let's be going then.  \n&o  Search around and see what you can find on Salazar. Return anything you find to Historian Rhodes. Table  AlignDefault ColWidthDefault AlignDefault \n Scraps of Paper Solution AlignDefault \n  :Puzzle_Solutions_Guide/Rapacity/Notes}}  Table  AlignDefault ColWidthDefault AlignDefault \n Historian Rhodes AlignDefault \n  Color|orange|[Historian Rhodes]}} \n Did you manage to find anything? \n  Color|purple|[I found these hidden note scraps, but they aren't particularly legible like this.]}} \n  Color|orange|[Historian Rhodes]}} \n Ahh! Let me see them right quick! Little glue here... little stitching there... carry the one... There we go! All patched up, and it's a letter written by Salazar himself! But... I don't understand... Give it a read, see if you can interpret anything from it.  \n&o  Speak to Historian Rhodes about the book. Table  AlignDefault ColWidthDefault AlignDefault \n Historian Rhodes AlignDefault \n  Color|orange|[Historian Rhodes]}} \n Can you make anything out about what is being said? An... arboretum? In the Chillwind? And something about giving gifts? \n  Color|purple|[There is an old Arboretum that fell a long while back. It's where I discovered the Pink wool.]}} \n  Color|orange|[Historian Rhodes]}} \n You've found more wools beyond the Lime one held by Salazar?   RawInline   Color|purple|[All of the members were killed by a demon from a dimension opposite of ours.]}} \n  Color|orange|[Historian Rhodes]}} \n Oh that's... unfortunate... Perhaps I'm suddenly not envious of your journeys... \n  Color|purple|[There is a peaceful spirit that I know how to contact, however.]}} \n  Color|orange|[Historian Rhodes]}} \n That's an odd source of information, but at this point, I'll take anything. If your ghost friend can provide any useful information, that would be of great use. Unfortunately, I must stay here with my team, but I wish you the best of luck.  \n&o  Seek out the Harmonious Spirit in the Pink Lobby. Table  AlignDefault ColWidthDefault AlignDefault \n Harmonious Spirit SoftBreak  Coordinates: -980, 21, 643 AlignDefault \n  Color|orange|[Harmonious Spirit]}} \n Thank you for everything. I'm sure you have many questions about what you saw inside, and about my people. \n  Color|purple|[I need to ask you about someone who may have been a member in the Arboretum.]}} \n  Color|orange|[Harmonious Spirit]}} \n My memory has been much more clear as of late, so I will give you any knowledge I am capable of passing on. Who do you wish to ask about? \n  Color|purple|[His name was Salazar.]}} \n  Color|orange|[Harmonious Spirit]}} \n ...Careful, my friend. Names bear power, and that one is not a name to speak of lightly. \n  Color|purple|[I'm guessing that means you know him?]}} \n  Color|orange|[Harmonious Spirit]}} \n Yes, I do know of Brother Salazar. Though it is not a story I recount with uplifting emotions. However, you have helped me more than I can repay, and I told you I would pass off the knowledge of which I was capable. \n  Color|purple|[Can you tell me what happened to him after the fall of Viridia?]}} \n  Color|orange|[Harmonious Spirit]}} \n In a sense, yes. In a sense, no. I can merely guide you to where the information you seek lies. But first, you will need something. \n  Color|orange|[Harmonious Spirit]}} \n In the rising tunnels above us - that which your people call the Sealed Descent - there lies a blessed shard of glass. Seek it out and return it here.  \n&o  Journey back through the   Link   Sealed Descent Sealed_Descent wikilink to find the blessed glass for the Harmonious Spirit. Table  AlignDefault ColWidthDefault AlignDefault \n Harmonious Spirit AlignDefault \n  Color|orange|[Harmonious Spirit]}} \n Yes, that is the glass I spoke of. I wish not for us to go down this path, but there are answers you seem determined to seek. \n  Color|purple|[How does the glass help us?]}} \n  Color|orange|[Harmonious Spirit]}} \n I will use the glass to construct a tool that you will soon find helpful. But first, we must head within the Arboretum. Are you ready to go in? \n  Color|purple|[Yes, I'm ready.]}} \n  Color|purple|[Actually I need to take care of other stuff first.]}} \n  Color|orange|[Harmonious Spirit]}} \n Very well, let's go.  \n&o  Find your way into the Father's study. \n Thank you for sjasogun for solving the puzzle. Table  AlignDefault ColWidthDefault AlignDefault \n Puzzle Solution AlignDefault \n  :Puzzle_Solutions_Guide/Rapacity/Study}}  Table  AlignDefault ColWidthDefault AlignDefault \n Harmonious Spirit AlignDefault \n  Color|orange|[Harmonious Spirit]}} \n It seems you have managed to collect the log. Let us leave this place, I wish not to linger here for longer than we must. We will speak once we have exited the Arboretum. \n  Color|purple|[Talk about Rapacity]}} \n  Color|orange|[Harmonious Spirit]}} \n I assume you have had time to ponder on the Father's log. \n  Color|purple|[Salazar... was he the one to break the Pink wool?]}} \n  Color|orange|[Harmonious Spirit]}} \n You now understand the truth, and why his name brings me great pain. His actions directly led to the events that soon followed - the death of my people at the hands of a demon who tore into our world through the rift Brother Salazar caused. \n  Color|purple|[The book mentions someone named Varcosa.]}} \n  Color|orange|[Harmonious Spirit]}} \n I was unaware of this fate, or I would have told you before. In my time, Varcosa was an infamous pirate, known for causing mass havoc even to the nations. He was known for showing no mercy, and that makes me doubtful that Brother Salazar survived much longer beyond that point. \n  Color|purple|[Is there anywhere I can get information on Varcosa?]}} \n  Color|orange|[Harmonious Spirit]}} \n It is fairly likely that some historical records exist. If what I remember is correct, Varcosa was originally a citizen of Ishnir. If any documents remains, an archivist familiar with that nation's history will be your best bet. Alnera may be a good place to start looking.  \n&o  Head to Alnera and seek out information once again from Archivist Nyra. Table  AlignDefault ColWidthDefault AlignDefault \n Archivist Nyra AlignDefault \n  Color|orange|[Archivist Nyra]}} \n Hello there. What brings you to the pharaoh's library today? \n  Color|purple|[Do you have any records on a pirate named Varcosa?]}} \n  Color|orange|[Archivist Nyra]}} \n Oh so you've stopped searching after fictional things like the Gem of Ishnir? Yes, of course we have records on the legendary pirate. Let's see, Varcosa was originally born in Ishnir, though gave up his birthright to pursue pirating roughly around 225 CCE. \n  Color|orange|[Archivist Nyra]}} \n Twenty five years later, in 250 CCE, Varcosa declared himself the king of the seas, and headed out for his final voyage. No records exist of him beyond that date, it is presumed he died at sea. \n  Color|purple|[His final voyage?]}} \n  Color|orange|[Archivist Nyra]}} \n Yes, according to the public record, there is rumor that he discovered the location of a great treasure. However, there is no historical evidence to suggest that any ever existed at that point. \n  Color|purple|[Any idea where he went?]}} \n  Color|orange|[Archivist Nyra]}} \n Yes and no. There is an old map that was found a few decades back, though it has suffered heavy damage over the centuries. It is currently on loan to the records holder in Molta for inspection. Shani, I believe is her name.  \n&o  It seems Shani in Molta currently has Varcosa's map. Seek her out. Table  AlignDefault ColWidthDefault AlignDefault \n Record Keeper Shani AlignDefault \n  Color|orange|[Record Keeper Shani]}} \n Hello! Welcome to the Molta Arch- AH!   RawInline   Color|purple|[Yes, we exposed a cover up for a mining operation gone wrong.]}} \n  Color|orange|[Record Keeper Shani]}} \n And you made quite a fuss among the government in doing so! Amarion will likely never hear the end of it, but I have faith that the government will reap the repercussions of their misdeeds in due time. \n  Color|purple|[I wanted to ask you about Varcosa's map.]}} \n  Color|orange|[Record Keeper Shani]}} \n Ah, you heard of that? Yes, I'm currently in possession of it, though it's not nearly as helpful as I hoped it would be. \n  Color|purple|[What did you want it for?]}} \n  Color|orange|[Record Keeper Shani]}} \n You see, I found a record a few weeks back that may have hinted at the final voyage of the infamous ruler of the waves. There was a mention of  \"Corsair's Claw\". \n  Color|purple|[Never heard of it.]}} \n  Color|orange|[Record Keeper Shani]}} \n That's not entirely surprising, it doesn't exist. Or at least, I didn't believe so until I found this record. Corsair's Claw is a mythical island shrouded in legend, mostly used as a bedtime story to scare children.  \n  Color|orange|[Record Keeper Shani]}} \n I hoped that, if I could possibly make something out of the map, it would lead me in the right direction - possibly even to the mythical island itself. Sadly, it is so worn down, its impossible to read it. \n  Color|purple|[Is there nothing that can be done?]}} \n  Color|orange|[Record Keeper Shani]}} \n I wouldn't quite say nothing. In older times like this, pirates didn't have access to quills to write with, and thus they had to resort to using ship scraps in order to draw maps. Because of this, they needed special ink that would stick well. This sort of became tradition among pirates who sail the northern seas, even today, to continue to use this special ink.  \n  Color|orange|[Record Keeper Shani]}} \n If you can manage to track some down and get some of it, I might be able to make an etching of the map. Be warned though, Northern pirates are much different from the ones you may be familiar with, Ocean's Reach is not kind, so they have to fight to survive. I have heard word that a certain crew is fighting off a sea monster attack. This may be the only chance we can get, while they are distracted.  \n&o  You need some special mapping ink carried by Northern pirates. Search out a crew that is currently fighting off a sea monster attack and grab it while they are distracted. \n The ink is located in the ship above the surface, inside a chest behind a dark oak trapdoor. Table  AlignDefault ColWidthDefault AlignDefault \n Record Keeper Shani AlignDefault \n  Color|orange|[Record Keeper Shani]}} \n Ah, good good! You actually managed to get some! Alright, give me just a minute to get the etching done... careful now... apply slightly... Alright! I think that may actually have done the trick! It's rough, but I think it may be good enough. Here, have a look at it.  \n You've made a copy of Varcosa's map! Follow it to its destination! \n (That is, the   Link   Corsair's Claw Corsair's_Claw wikilink POI) Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|orange|[Historian Rhodes]}} \n Isn't the undercity amazing? It's hard for me to remove my eyes from it. Anyway, have you had any luck searching for clues about Salazar around here? \n  Color|purple|[Rhodes? What am I doing back here?]}} \n  Color|orange|[Historian Rhodes]}} \n Exactly what I asked you to come here for. I need your assistance in finding any information we can on Salazar. \n  Color|purple|[But... We already found his book here.]}} \n  Color|orange|[Historian Rhodes]}} \n I have no idea what you're talking about   RawInline   Color|orange|[Historian Sen]}} \n You know, I love reading about history and all... But actually seeing history like this? This makes it all the more worth while. \n  Color|purple|[I don't understand what's happening.]}} \n  Color|orange|[Historian Sen]}} \n Didn't you hear me? Enjoy this view. This is pure history in front of us. \n  Color|purple|[I've already been here! Tell me what's going on!]}} \n  Color|orange|[Historian Sen]}} \n Oh come now   RawInline   Color|orange|[Harmonious Spirit]}} \n We meet again   RawInline   Color|purple|[How am I here now? And what happened to this lobby?]}} \n  Color|orange|[Harmonious Spirit]}} \n You seem upset   RawInline   Color|orange|[Echoing Thoughts]}} \nRawInline  Color|purple|The will on this one is interesting. That pirate might finally have found his replacement. I will let my grip go. For now.}} \n [Fading Spirit] Hmm... a new face? It's been... quite a while since I have seen one. How long now... decades? Centuries? I stopped counting a long time ago. \n  Color|purple|[Who are you?]}} \n  Color|orange|[Fading Spirit]}} \n In life, I was... a ruler... one who fell from grace... My kingdom long since turned to folly... \n  Color|purple|[Wait... Are you Salazar?]}} \n  Color|orange|[Fading Spirit]}} \n Mmm... It warms my spirit slightly to know that my name is still known... But... not quite enough to escape... not quite yet...   AlignDefault \n RAPACITY COMPLETE! SoftBreak  Awarded   Link   Varcosa's Doublet Varcosa's_Doublet wikilink  , a   Link   Purple Grasp_of_Avarice wikilink Wool Key, and Full access to the   Link   Purple Grasp_of_Avarice wikilink Wool Trader in Mistport.  \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *&3Varcosa's Doublet&r\n*&3Grasp of Avarice|Purple&r Key\n*Full access to &3Grasp of Avarice|Purple Dungeon&r Trader\n*Access to &3Rush of Dissonance&r from &3Harmonic Arboretum|Pink&r Lobby"}