{"name": "Ring Around the Rose", "information": "prerequisites = * &3Voyage of Discovery&r\n NPC: Researcher Jennis Coords: -820 97 1332\n Celsian Isles Mistport\nDifficulty = Medium\nLength = Short\n", "dialogue": "}} \n  WorkInProgress|Missing pre-Xenophobia dialog}} \n&o  Help the Steelmeld researchers find a way to the   Link   Architect's Ring Architect's_Ring wikilink  . \n&o  C: Speak to Jennis. Table  AlignDefault ColWidthDefault AlignDefault \n Researcher Jennis \n  Coordinates: [-820 97 1332] \n   &6[Researcher Jennis] \n Oh hello, you must be Captain [Player]! We've heard quite a bit about you, what with your take over of this island from Xeno. \n  &5[I suppose I have made a bit of a name for myself...] \n  &6[Researcher Jennis] \n You certainly have! We hope our presence here is not a bother. Keilick and I are simply passing through this town before heading out for our grand adventure. \n  &5[Grand adventure?] \n  &6[Researcher Jennis] \n You heard that correctly! See, we're scientists from the underwater town of Steelmeld, where we specialize in studying floral magic. \n  &5[Floral magic?] \n  &6[Researcher Jennis] \n The title should be fairly self explanatory - magic derived through the use of plant life. Unfortunately, the Isles are... well, particularly limited in terms of plant species that offer much in way magical intrigue. A few flowers and mushrooms here and there... We've effectively exhausted this land of it's worth in our field of study. \n  &5[So let me take a guess - you're off to somewhere that has more magical plants to offer?] \n  &6[Researcher Jennis] \n Exactly! Well... theoretically, at least... \n  &5[I should have seen that coming...] \n  &6[Researcher Jennis] \n It's not as much of a catch as you may think. You see, our destination is the Architect's Ring, a far off land told to be sprawling with arcane flora! We've just never seen the place for ourselves, thus the \"theoretically\". In fact, very few people are ever capable of traveling there. \n  &5[How do you intend on getting there then?] \n  &6[Researcher Jennis] \n Keilick and I have spent the past 3 years gathering up the necessary supplies to get ourselves there. You seem like you're the adventuring type, so if you're willing to help us out where needed, you could join us.  \n  &5[The possibility of exciting new ways to die in a far off land? Count me out...] \n  &6[Researcher Jennis] \n Oh... Well... I must say, that wasn't the response I was expecting... \n  &5[The possibility of exciting new adventures in a far off land? Count me in!] \n  &6[Researcher Jennis] \n Wonderful! We've got one thing left to see in this town before we head out, so let's head over to the teleporter hub!  \n&o  C: Speak to Keilick. Table  AlignDefault ColWidthDefault AlignDefault \n Researcher Keilick AlignDefault \n  &6[Researcher Keilick] \n I suppose I should inform you of why we came to this town. \n  &5[I have been wondering that. It didn't seem totally essential to your journey at face value.] \n  &6[Researcher Keilick] \n You're not incorrect, but there was a purpose. I'm not sure how he did it, but Xeno established this teleportation network across the Isles. I was hoping perhaps I could reverse engineer the process in order to allow us safer passage to the Ring. But... no dice, it seems.  \n  &5[Why don't we ask some of the pirates around here?] \n  &6[Researcher Keilick] \n Listen, everyone in the Isles knew Xeno's name, and the shady connection he was willing to make in order to benefit himself. That's a pile of problems I'd rather not poke with a stick. \n  &5[Why don't we ask Cinevra?] \n  &6[Researcher Keilcik] \n Cinevra, huh? I'm suprised you know that name, though I suppose you are from the Valley. The Arcmage of Sierhaven is famous in the industry for her breakthroughs in lightning magic allowing true teleporation. However, much like Xeno's connection here, it requires an established link between two points in space. That doesn't exactly help us if we're not there to begin with. \n  &5[What exactly do you mean by \"safer\"?] \n  &6[Researcher Keilick] \n We've spent far too long in preparation to not have a contingency plan. I suppose being from the Valley, you are aware of a famous mage by the name \"Calder\"? \n  &5[I don't exactly know if I'd use the word famous in reference to him, but yes.] \n  &6[Researcher Keilick] \n Many years back, he published some research on the topic of aportation - basically, proto-teleportation that uses an ethereal medium to allow for transportation. \n  &5[Right... I definitely understand that...] \n  &6[Researcher Keilick] \n Long story short, it uses an alternate dimension to cut travel time instead of pre-established links. Problem is... it runs the risk of maybe losing a limb or two. Or getting lost somewhere between dimensions. \n  &5[I'm starting to regret my decisions...] \n  &6[Researcher Keilick] \n Sorry pal, you're in this for the long haul now. Just let me know when you're ready, and I'll fire up the aportation. \n  &5[No time like the present, I guess.] \n  &6[Researcher Keilick] \n Long story short, it uses an alternate dimension to cut travel time instead of pre-established links. Problem is... it runs the risk of maybe losing a limb or two. Or getting lost somewhere between dimensions. \n  &5[I'm starting to regret my decisions...] \n  &6[Researcher Keilick] \n Sorry pal, you're in this for the long haul now. Just let me know when you're ready, and I'll fire up the aportation. \n  &5[No time like the present, I guess.] \n  &6[Researcher Keilick] \n Alright then, let's go! \n  color|gray|Keilick smashes a small stone at his feet, causing a sudden flash of light.}} \n  &6[Researcher Keilick] \n Well this definitely is not the Ring. I'll need some time to recalibrate the runes and- OH MY GOD SHUT THESE GHASTS UP!  \n&o  C: Find a way to quite the ghasts. Table  AlignDefault ColWidthDefault AlignDefault \n Researcher Jennis (Galos) AlignDefault \n  &6[Researcher Jennis] \n Hm... I've read about a place like this before. I think we somehow landed in Galos, a country known for its swamps so toxic that even getting near them can risk death. They use these sky boats to get around, though I gotta say they could have picked a more quiet approach...  \n  Right click the ghasts. \n   &6[Researcher Keilick] \n WHY WOULD YOU DO THAT?! THAT'S ONLY MAKING THE YELLING WORSE! \n  &6[Researcher Keilick] \n ARE YOU DENSE!?! I CAN'T FOCUS WITH ALL THIS SCREAMING! \n  &6[Researcher Keilick] \n THAT'S IT! I'VE HAD ENOUGH! \n  color|gray|Keilick smashes a small stone at his feet, causing a sudden flash of light.}} \n&o  C: Explore around the hellish island and keep guard from any hostile enemies. \n  &6[Researcher Jennis] \n Oh my... What is this hellish place? And are those islands... floating?! \n  &6[Researcher Keilick] \n Damn it, this is exactly what I was afraid of... Looks like we got stuck somewhere between dimensions and ended up here. Go keep guard until I can make another batch of aportation runes. QUIETLY THIS TIME! \n  Hellborn Knight: -2742 189 2876 \n Hellborn Charger: -2644 175 2926 \n Hellborn Harbinger: -2713 198 2963 \n  After beating all of the hostiles: \n  color|gray|It seems you've cleared the area of hostile enemies. Better check up on Keilick.}} \n Speak to Keilick. Table  AlignDefault ColWidthDefault AlignDefault \n Researcher Keilick (Hell Island) AlignDefault \n  &6[Researcher Keilick] \n Alright, all set. Let's get out of here ASAP. \n  &5[Let's go.] \n  &6[Researcher Keilick] \n Third time's the charm, hopefully... \n  color|gray|Keilick smashes a small stone at his feet, causing a sudden flash of light.}}  \n After getting teleported: \n  &6[Researcher Keilick] \n WHAT?!?! How are we back here?! This definitely makes no sense anymore. Plus I'm quickly running out of rune supplies... The next one MUST be correct, we can't afford to waste any more. \n&o  C: Speak to Jennis. Table  AlignDefault ColWidthDefault AlignDefault \n Researcher Jennis \n  Coordinates: [-820 97 1332] \n   &6[Researcher Jennis] \n And just like that, we've come full circle, metaphorically speaking. Also literally, it seems... \n  &5[I can't help but wonder, how do you two know about the supposed magic plants in the Ring to begin with?] \n  &6[Researcher Jennis] \n Oh, it's from my absolute favorite research book series, Professor Walthan's Guide to Flora and Fauna! \n  &5[Come again...?] \n  &6[Researcher Jennis] \n Oh it's a lovely introspective of world exploration by the renown Professor Walthan! If you ever get a chance to read it, I highly suggest you do so! OH, especially Volume 7 - it's my personal favorite! \n  &5[I feel like we're deviating from the point here... And are you telling me you didn't even think to ask Professor Walthan how to get to the Ring?] \n  &6[Researcher Jennis] \n Well of course we THOUGHT about it, but no one in the Isles has seen him since he cut contact with the Congress. Not that we could ask anyone in the Congress anymore about his whereabouts... \n  &5[What are you talking about? He heads a library in Lowtide, over in the Valley.] \n  &6[Researcher Jennis] \n Are you kidding?! You mean you already knew of him AND his location? That's wonderful news! Let's go ask him then!  \n&o  C: Head to the Lowtide Library in the King's Valley to seek out Professor Walthan. Table  AlignDefault ColWidthDefault AlignDefault \n Professor Walthan \n  Coordinates: [703 75 539] \n   &6[Walthan] \n Hello! Welcome to the Lowtide Library! I am Professor Walthan, intrepid explorer and head researcher for this library branch. I'm sure you're honored to meet me - I'm well known across the Valley. \n  &5[You're apparently well known across the Isles too. That's kinda why I'm here?] \n  &6[Walthan] \n Oh, yes - I spent a great deal of time in the Isles once. Lovely stories I could tell, but I'll spare you with brevity! \n  &5[Right... Anyway, I'm currently working with some researchers there who say you've been to the Architect's Ring, and want to follow in your footsteps.] \n  &6[Walthan] \n Oh... I see... Well, I must inform you of some bad news then - I cannot tell you how to get there. \n  &5[And why not?] \n  &6[Walthan] \n Well, if you ever feel inclined to purchase my best selling Flora and Fauna series - Volume 7 to be precise - you will come to understand that I have been sworn to secrecy by the locals. As such, I cannot reveal how to gain passage to that land. \n  &5[There's nothing I could do to convince you?] \n  &6[Chief Editor Sumona] \n Walthan, don't even pretend like you didn't tell that Bermuda woman in Steelmeld how to get there. \n  &6[Walthan] \n Damn you, woman! Why must you spill my secrets like that! \n  &5[I guess you're not infallible after all.] \n  &6[Walthan] \n Now you listen, I was offered a chance at half of all published research credit that Bermuda made in the Ring. How could I pass something like that up? My name could grow even bigger in the scientific community - which of course means more volumes of my books sold! \n  &5[That's really all it takes? I'm sure we could get Jennis to agree to that as well...] \n  &6[Walthan] \n Wait... do you mean it? Hm... Let me think for a minute... \n  &5[They're even botanists like you - kinda... Just think of all the fame and glory you could gain from this opportunity!] \n  &6[Walthan] \n Okay fine, I'll break my silence just this one more time. Just lead me to your researcher friends, and I'll help you out.  \n&o  C: Return back to Mistport to see the researchers. \n  &6[Researcher Keilick] \n So I hear you signed away part of our publishing credit... I don't exactly like it, but if it gets us to the Ring, I guess I can swallow my pride a bit. \n  &6[Researcher Jennis] \n Oh my gosh, oh my gosh, oh my gosh! Professor Walthan himself is right here! I'm gonna see if he'll sign my Flora and Fauna volume. Table  AlignDefault ColWidthDefault AlignDefault \n Professor Walthan (Mistport) AlignDefault \n  &6[Professor Walthan] \n Alright, let's begin. First I'll need to go into a bit of a history lesson on a concept known as \"aportation\". You see, this is an old proto-teleportation method that uses an ethereal medium to-- \n  &5[Yeah, yeah. We've already got that part down pat. Just jump into step two, okay?] \n  &6[Professor Walthan] \n Oh... Well uh... Okay, I wasn't expecting that. Let's see, step two... Right - so, I'm sure if you've attempted to aport yourselves to the Ring already, you likely ended up in some rather strange places. Am I correct in that deduction? \n  &5[That's right. Why is that? And how did you know?] \n  &6[Professor Walthan] \n Haha! You see, the Ring is more than just the home of a reclusive society. The Ring itself physically cannot be reached - by boat, by magic, nothing. By all means, you might assume it's not even connected to the world. But that would be a false claim! \n  &5[What are you getting at?] \n  &6[Professor Walthan] \n The entire continent of the Ring is shrouded in a \"thick\" magic, you might say. An ancient spell that alters the perception of anyone who draws near it. Sail too close by boat, and suddenly you might find yourself veering off in a totally different direction, away from the Ring. The same concept can be applied through magical attempts at reaching the land. It forces you to get \"lost\", so to speak - never to actually reach your intended destination. \n  &5[So how to you reach an unreachable land?] \n  &6[Professor Walthan] \n That was a question I pondered for many years. I dug through the Celsian Congress, searching for anything that may offer a hint as for how to step foot in the Ring. Until finally, I found a scrap of parchment lodged in an old manuscript - and on it lay a riddle, of sorts, encoded the truth of how to reach the Ring. \n  &5[And what did it say?] \n  &6[Professor Walthan] \n Let's see if you can figure it out. \n  &6[Professor Walthan] \n Departing the seas, wherein the Ring lay; \n  &6[Professor Walthan] \n A veil of confusion thus hides the way. \n  &6[Professor Walthan] \n Dawn now your Rose, for the Rose cannot lie; \n  &6[Professor Walthan] \n It guides you beneath the Architect's eye. \n  &5[So... a rose is the key here? ] \n  &6[Professor Walthan] \n Indeed, but can you figure out what TYPE of rose? That is the truth that the riddle hides. \n  &6[Researcher Jennis] \n Grandiflora? \n  &6[Professor Walthan] \n Not quite. \n  &6[Researcher Keilick] \n Polyantha? \n  &6[Professor Walthan] \n Still no. \n  &5[Hmm... A rose that guides you... And can never lie.] \n  color|gray|Walthan raises his eyebrow as you talk through it.}} \n  &5[It's... a Compass Rose.] \n  &6[Professor Walthan] \n Very good! That's quite the keen sense you got there. Yes, a compasses needle can never fail you, as it is made from the hairs of... Nevermind, I'm trailing off. \n  &5[So by combining the power of aportation with a compass that can never be wrong...] \n  &6[Professor Walthan] \n You have yourself a one way ticket to the Ring!  \n&o  C: Speak to Keilick. Table  AlignDefault ColWidthDefault AlignDefault \n Researcher Keilick (Mistport) AlignDefault \n  &6[Researcher Keilick] \n Alright, so we have the secret ingredient now, so to say. Are you ready to give this one more go? \n  &5[Let's do it!] \n  &6[Researcher Keilick] \n Alright Walthan, let's put your wisdom to the test! \n  &6[Researcher Keilick] \n Initiating the aportation! \n  color|gray|Keilick smashes a small stone at his feet, causing a sudden flash of light.}}  \n  color|teal|'''RING AROUND THE ROSE COMPLETE!'''}} \n  color|teal|Awarded 1 [[Architect Token]] and access to the [[Architect's Ring]]!}} ", "reward": "rewards =\n* 1 &3Architect Token&r\n*Access to the &3Architect's Ring&r!\n"}