{"name": "Sabotage", "information": "prerequisites = None\n NPC: Lieutenant Aulber Coords: -142, 178, 467\n Celsian Isles Rahkeri\nPOI: &3Abandoned Lab&r\n", "dialogue": "&o  Recover 8 lots of the Infused Gunpowder stolen from the Fist of Turaal. Table\n Lieutenant Aulber\n  Coordinates: [-142, 178, 467]\n   &6[Lieutenant Aulber]\n Beautiful, isn't it?\n  &5[Sure, but who are you?]\n  &6[Lieutenant Aulber]\n I suppose my question was a bit ahead of itself. First Lieutenant Muat Aulber, ranking officer here in Rahkeri, and overseer of\nthe construction of the Fist of Turaal. Nice to meet you.\n  &5[What?]\n  &6[Lieutenant Aulber]\n The Fist of Turaal, the greatest airship ever built. Eight cannons, dozens of arrow batteries, and enough armor to shrug off\nanything Chillwind can throw at us. And those wretches had the gall to sabotage it!\n  &5[Oh. Too bad.]\n  &6[Lieutenant Aulber]\n Too bad? Too bad!? We are at war! Were you under my command, I'd punish your glibness with a year of latrine duty!\n  &5[Sabotage?]\n  &6[Lieutenant Aulber]\n Yes! Behind the temple to the southeast is an old alchemist's lab; the potionmakers had been asking to trade for our infused\ngunpowder. We refused. They stole it. Bring eight lots of gunpowder back and you will have the gratitude of the Ishniran\nMilitary!\n  &5[Sorry, I'm busy.]\n  &6[Lieutenant Aulber]\n Pah! Of course you are. I knew asking a civilian was futile.\n  &5[You can count on me.]\n  &6[Lieutenant Aulber]\n Glad to hear it. Infiltrate that laboratory, reclaim the gunpowder, and good luck.\n  Lieutenant Aulber gives you a sharp salute.\n&o  C: [1/2]: Find 8 Infused Gunpowder in the   Link   Abandoned Lab Abandoned_Lab wikilink  .\n&o  C: [2/2]: Once you have the infused Gunpowder return to Lieutenant Aulber. Table\n Lieutenant Aulber\n  &6[Lieutenant Aulber]\n That's more than enough gunpowder to restock the Fist. Fantastic job, soldier! You have the thanks of the Ishniran Military,\nand, in case that's not enough, I have an ancient bow for you that my men recovered from some ruins. May your aim be true.\n  Awarded [[Thousand Fists of Turaal]] and 32 Crystalline Shards!\n", "reward": "rewards =\n* &3Thousand Fists of Turaal&r\n* 32 Crystalline Shards\n"}