{"name": "Scientists of Steelmeld II", "information": "prerequisites = &3Scientists of Steelmeld I&r\n NPC: Professor Bermuda Coords: -541, 5, -476\n Celsian Isles Steelmeld\n", "dialogue": " Header quest_content  Quest Content Table\n Professor Bermuda\n  Coordinates: [-514, 5, -476]\n   &6[Professor Bermuda]\n Hello [Player], I've got a new set of tests for you! Are you ready for the challenge?\n  &5[I'm ready!]\n  &6[Professor Bermuda]\n Wonderful! Talk to me when you’re ready to come to my lab.\n  &5[Not right now.]\n  &6[Professor Bermuda]\n Don't keep me waiting.\n C:   &o  Talk to Professor Bermuda and aid her in her lab. Table\n Professor Bermuda\n  &6[Professor Bermuda]\n Hello [Player], do you want to go to my lab?\n  &5[I want to go to the lab for our second adventure.]  Table\n Professor Bermuda (Start Test Area)\n  Coordinates: [-4366, 142, -51]\n   &6[Professor Bermuda]\n Welcome back! Step through the door to begin our next test suite, or pick up where you left off.  Header room_1  Room 1\n After stepping through the door:\n  &6[Console]\n  NEW ENTITY DETECTED: SCANNING ENTITY...\n  &6[Console]\n  SCANNING ENTITY: HEIGHT: [Scrambled Text]\n  &6[Console]\n  SCANNING ENTITY: AGE: [Scrambled Text]\n  &6[Console]\n  SCANNING ENTITY: HAIR COLOR: [Scrambled Text]\n  &6[Console]\n  SCANNING ENTITY: EYE COLOR: [Scrambled Text]\n  &6[Console]\n  NEW ENTITY SCANNED: REGISTERING ENTITY\n  &6[Console]\n  ENTITY REGISTERED: WELCOME [Player]\n  &6[Professor Bermuda]\n Welcome back, [Player]. Can you hear me?\n  &5[Loud and clear!]\n  &6[Professor Bermuda]\n Excellent. Once again, I’ll be communicating with you through this intercom. Given your demonstrated ability as one of my top\nperforming test subjects, we'll be ramping things up today with some new technology right off the bat. Remember, if you get\nstuck, the info boxes can give you a hint, and you can take a break at any time!\n Note: Portals can only be placed on smoothstone slab blocks. Left-click for Blue portal, Right-click for Orange portal.\n Pressing the button under the info box by the door:\n   &5Launch pads on green blocks will launch you in the direction you are facing!\n  Pressing the button under the info box on the third level area left of exit:\n   &5Summon a companion cube from its tube by pressing the button. Sneak next to one to pick up or drop it!\n  Solution to Room 1:\n  #ev:youtube|AulrWwZi7G0\n   &6[Professor Bermuda]\n Well done. I hope that launch pad didn't make you too dizzy- there are plenty more in the course. This next level should\nrequire a bit more thinking.\n Pressing the button under the info box right of the exit door:\n   &5Remember that you can shoot portals through purple glass as long as they are in the direction you are facing! Some plates\nmay convert other glass colors to purple while activated.\n  Pressing the button under the info box left of the exit door:\n   &5When a cube falls on nether wart blocks, it is destroyed. You'll have to find a way to grab it before it falls!\n  Solution:\n  #ev:youtube|SotHXSqOC-c\n   &6[Professor Bermuda]\n Nice solve. You don't even want to know what my tech engineers had to go through to make that cube a reality. Anyway, hope you\ndidn't forget about timers!\n Pressing the button under the info box at start:\n   &5Some pressure plates activate timers for purple glass. Make sure to go fast if you're on the clock!\n  Solution:\n  #ev:youtube|TfV_2vMM_UI\n   &6[Professor Bermuda]\n Impressive speed! For this next level, you'll need to keep your head up.\n Solution:\n  #ev:youtube|T2og6FJq3Bk\n   &6[Professor Bermuda]\n Awesome work! It's great seeing you fly through the air from those portals.\n Solution:\n  #ev:youtube|JyGEPGlflOk\n   &6[Professor Bermuda]\n Halfway there! I wasn't kidding about the launch pads.\n Solution:\n  #ev:youtube|nByGpiR2ogk\n   &6[Professor Bermuda]\n You really are quite the specimen with that cube. Keep up the good work, and I'll make sure you're rewarded handsomely.\n Pressing the button under the info box by the grid of particles:\n   &5Emancipation grids clear all your portals when you come into contact with them.\n  Solution:\n  #ev:youtube|CY3-Urm4y4s\n   &6[Professor Bermuda]\n Well done. Back to basics here while I prepare our new tech for the next level.\n Solution:\n  #ev:youtube|-xA8pa-DS0U\n   &6[Professor Bermuda]\n Still hanging in there? You're almost done with my latest challenge!\n Pressing the button under the info box:\n   &5Cubes are also usable on pistons!\n  Solution:\n  #ev:youtube|05Gyu7bF2Cs\n   &6[Professor Bermuda]\n Amazing job! As you can see, if you can figure this one out I've prepared you a delicious reward!\n Solution:\n  Just press the button multiple times.\n  After completing all rooms: Table\n Professor Bermuda (Start Test Area)\n  Coordinates: [-4366, 142, -51]\n   &6[Professor Bermuda]\n Uh oh! Looks like you managed to break one of our test chambers. Luckily I managed to pull you out and freeze the chamber just\nin time! What could you possibly be thinking doing something like that? Oh well, looks like no dessert for you again. Still,\nexcellent job passing the tests.\n  &5[What do we do now?]\n  &6[Professor Bermuda]\n I'll try to repair that broken test room and get back to you when I have a new assignment for you.\n  &5[Does that mean I should wait?]\n  &6[Professor Bermuda]\n Oh no, you can go and I'll call for you when I have more tests for you to run.\n  &5[Can I keep the wand?]\n  &6[Professor Bermuda]\n Unfortunately no, but I'll give you another toy to play with instead. Good work!\n SCIENTISTS OF STEELMELD II COMPLETE! SoftBreak  Awarded a   Link   Totem of Transposing Totem_of_Transposing wikilink and 2\nHCS! Header trivia  Trivia\n The unscrambled text is:\n  &6[Console]\n  SCANNING ENTITY: HEIGHT: FIVE\n  &6[Console]\n  SCANNING ENTITY: AGE: UNKNOWN\n  &6[Console]\n  SCANNING ENTITY: HAIR COLOR: BROWN\n  &6[Console]\n  SCANNING ENTITY: EYE COLOR: BROWN\n", "reward": "rewards =\n* 2 Hyper Crystalline Shards\n* 2 &3Totems of Transposing&r\n"}