{"name": "Scientists of Steelmeld I", "information": "prerequisites = None\n NPC: Professor Bermuda Coords: -541, 5, -476\n Celsian Isles Steelmeld\n", "dialogue": " Header quest_content  Quest Content Table\n Professor Bermuda\n  Coordinates: [-514, 5, -476]\n   Color|Orange|[Professor Bermuda]\n Ugh, what? I’m busy working on my research if you haven’t noticed.\n  Color|Purple|[What are you working on?]\n  Color|Orange|[Professor Bermuda]\n Well, I’m working on some new magical technology.\n  Color|Purple|[What’s the new tech?]\n  Color|Orange|[Professor Bermuda]\n Ahem- I was getting there. It’s a magic wand that utilizes lightning magic to create temporary dimensional portals.\n  Color|Purple|[Portals?]\n  Color|Orange|[Professor Bermuda]\n Yes! Portals! Would you like to help me test it out?\n  Color|Purple|[Sure.]\n  Color|Purple|[No thanks.]\n  Color|Orange|[Professor Bermuda]\n Shame.\n  Color|Orange|[Professor Bermuda]\n Wonderful! Talk to me when you’re ready to come to my lab.\n Talk to the professor again when you are ready to get teleported to the Lab. Make sure to have nothing on you. Table\n Professor Bermuda\n  Color|Orange|[Professor Bermuda]\n Hello [Player], do you want to go to my lab? You need to make sure you have nothing on you for me to take you there.\n  Color|Purple|[Yes.]\n  Color|Purple|[No.]\n  Color|Red|You must have an empty inventory to enter the lab\n The quest plays like the game Portal. You are given a C.A.L.D.E.R. Dimensional Wand, which you can use to shoot a blue portal\nby pressing left click, or an orange portal by pressing right click.\n Portals can only be placed on Smooth Stone blocks. Make sure to aim at the lower block of where you want to place the portal,\nand then you can just walk through it. Header first_room  First Room\n After stepping through the door:\n  &6[Console]\n  NEW ENTITY DETECTED: SCANNING ENTITY...\n  &6[Console]\n  SCANNING ENTITY: HEIGHT: [Scrambled Text]\n  &6[Console]\n  SCANNING ENTITY: AGE: [Scrambled Text]\n  &6[Console]\n  SCANNING ENTITY: HAIR COLOR: [Scrambled Text]\n  &6[Console]\n  SCANNING ENTITY: EYE COLOR: [Scrambled Text]\n  &6[Console]\n  NEW ENTITY SCANNED: REGISTERING ENTITY\n  &6[Console]\n  ENTITY REGISTERED: WELCOME [Player]\n  Color|Orange|[Professor Bermuda]\n Alright, testing- testing. Can you hear me?\n  Color|Purple|[Loud and clear!]\n  To complete the first room, simply place a portal on each of the two available smooth stone walls and walk up to the door.\n   Color|Orange|[Professor Bermuda]\n Excellent work! Everything is comfortable for you? Well keep going! The next stage is a little more tricky. Give it a try.\n  In the second room, you learn that you can shoot portals directly through purple stained glass. Use this to your advantage to\nget out of the box, and do it one more time to get past the wall in the middle of the room and proceed to the next room.\n   Color|Orange|[Professor Bermuda]\n You’re doing an amazing job! Farther than any of my other lab ra- I mean testers have gotten so far. Keep going!\n  In the third room, you learn that portals conserve your momentum when travelling through them. Use this to your advantage by\nplacing a portal on the floor below, and one high on the wall to go on the next platform. Then do the same a couple more times\nto get to the end of the room.\n   Color|Orange|[Professor Bermuda]\n Amazing! To the next stage. Nobody has gotten this far before you. So this is new for both of us now.\n  In the fourth room, the exit is near a purple stained glass wall. You need to first place a portal high up on the wall next to\nit, and one right below where you enter.\n   Color|Orange|[Professor Bermuda]\n You’re exceeding all of my expectations! Truly amazing! Continue onwards to the next stage.\n  In the fifth room, you learn that ice is better at conserving momentum, and you may have to sprint into portals to get\nfurther. Use this to your advantage by placing portals so that you exit on the ice and have enough momentum to jump to the\nplatform on the other side of the room. Now, do the same but place both portals above the ice, sprint into one and sprint jump\nout the other to get to the end.\n   Color|Orange|[Professor Bermuda]\n Words simply cannot express how impressed I am with you! To think you could use the dimensional wand like this! You’re truly\ninnovative aren’t you?\n  In the sixth room, use the ice momentum to your advantage by shooting a portal through the purple glass and jumping from the\nice to the next platform. Now use a portal to get up on the next platform, and use two portals on the floor to jump to the one\nright next to it. Now, use portals to use the ice momentum to your advantage, jumping on the slime blocks on the floor to the\nnext platform. Finally, place a portal through the purple glass to the end of the room, and simply find another wall to place\nyour second portal on, and go through it to the exit.\n   In the seventh room, you can find a piston with a slime block that pushes you with a lot of momentum. Take advantage of this\nto get up on the platform close by. Now do the same, placing a portal above the next slime block, and one on the wall behind the\nnext highest platform. Make sure to place this second portal at the highest point possible, and to not hold space, because you\nhave to bounce on slime blocks. Once up here, place a portal on the platform across from the purple stained glass. Once on this\nplatform, you can see another smooth stone wall on the other side of the room. Place a portal on the leftmost side of this wall,\nthen go back to a slime launcher and launch yourself through the other portal, to the exit.\n   Color|Orange|[Professor Bermuda]\n You’re almost done! Keep up the amazing work!\n  In the eigth room, you are introduced to blue gates, which remove any active portals you may have. To get to exit, first place\ntwo portals on the floor so that you can jump on the slabs above the purple stained glass wall, from the starting platform.\nThen, simply place another two portals on the floor and jump into one of them, to make it up to the exit platform.\n   Color|Orange|[Professor Bermuda]\n This is the final stretch! Do your best! I’ll reward you handsomely if you can finish!\n  In the ninth room, go right as you enter to find a slime platform on the ground. Place a portal on the wall and one on the\nplatform below so you can use momentum from the fall to bounce on the slime and get to the next platform. Here you will find a\npressure plate that disables a glass wall later on, for a few seconds. You have to get on the next platform to the left by\nplacing a portal on the fall and one on the floor, bounce on the slime, jump to the platform across and finally shoot a portal\non your left through the purple glass (which was yellow glass, changed by stepping on the pressure plate earlier). Now go to the\nportal you just placed to end up on the other side of the room, and do the portal ice trick one more time. Now, use the slime\nlauncher to give yourself enough fall momentum to end up on the higher platform, and use the second slime launcher to jump over\nthe glass wall, back to the pressure plate. Hit the pressure plate one more time and go back by placing one final portal, then\nrun to the exit and place a portal through the purple stained glass.\n   Color|Orange|[Professor Bermuda]\n Wonderful, wonderful! This is the final stage! I have prepared a delicious reward for you at the end of this course!\n  In the tenth and final room, you must reach the cake by setting up an infinite fall and then launching yourself to the other\nsi- Just Kidding. This jump is impossible. After falling into the water, you get teleported back to the start, and you can talk\nto the professor to end the quest. Better luck next time!\n  Professor Bermuda (Start Test Area)\n  Coordinates: [-4366, 142, -51]\n   Color|Orange|[Professor Bermuda]\n Thank goodness you're safe! You flung yourself towards the reward but got caught in a dimensional loophole. If I hadn't caught\nyou before you fell into the hole completely… Anyways! You did an excellent job.\n  Color|Purple|[What do we do now?]\n  Color|Orange|[Professor Bermuda]\n I'm going to try to fix that hole and I'll get back to you about further testing.\n  Color|Purple|[Does that mean I should wait?]\n  Color|Orange|[Professor Bermuda]\n Oh no, you can go and I'll call for you when I have more tests for you to run.\n  Color|Purple|[Can I keep the wand?]\n  Color|Orange|[Professor Bermuda]\n Unfortunately no, but I'll give you another toy to play with instead. Good work! SoftBreak   Color|Cyan|\nSCIENTISTS OF STEELMELD COMPLETE!<div>\nAwarded the Uncharged C.A.L.D.E.R Dimensional Wand and 2 HCS!\n", "reward": "rewards =\n* &3Uncharged C.A.L.D.E.R Dimensional Wand&r\n* 128 Compressed Crystalline Shards\n"}