{"name": "Secrets Best Left Forgotten", "information": "prerequisites = * &3The Foreign Soldier&r\n* &3The Gem of Ishnir&r\n* &3Harmonic Convergence&r NPC: Issa Celsian Islestown = Moltastarting_npc_coordinates = 273, 118, 79rewards = *&3Excavator's Hardlamp&r\n*&3Scourge of Lunacystarting_npc_coordinates = 273, 118, 79rewards = *&3Excavator's Hardlamp&r\n*&3Scourge of Lunacy Celsian Islestown = Moltastarting_npc_coordinates = 273, 118, 79rewards = *&3Excavator's Hardlamp&r\n*&3Scourge of Lunacytown = Moltastarting_npc_coordinates = 273, 118, 79rewards = *&3Excavator's Hardlamp&r\n*&3Scourge of Lunacy", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Issa SoftBreak  Coordinates: 273, 118, 79 AlignDefault \n  Color|orange|[Issa]}} \n What happened here...? Maybe... No, that can't be it... Someone must know something about this... \n  Color|gray|She seems too engrossed in whatever she is reading to notice you.}} \n  Color|purple|[Know what?]}} \n  Color|orange|[Issa]}} \n Oh, uh, hello there! I, um, wasn't talking about anything in here. Head along... \n  Color|purple|[I could hear you talking to yourself.]}} \n  Color|purple|[Okay- have a nice day!]}} \n  Color|orange|[Issa]}} \n ...Persistent, I see. Well, if you can keep a secret I'll let you in on something I've discovered. \n  Color|orange|[Issa]}} \n You see, this seemingly innocent mining town is hiding something. No one will confirm anything, but you can tell by the way people carry themselves here, speaking of people who, as far as the official records show, never existed. If my hunch is correct, something is being covered up, something big that caused people to go missing. \n  Color|purple|[That's odd. Could you use any help?]}} \n  Color|orange|[Issa]}} \n It is quite unnerving, yes. And yes, in fact, I think you could be useful.  \n&o  1/3 - Search around Molta for clues about the disappearances. Governor Amarion might know something. Table  AlignDefault ColWidthDefault AlignDefault \n Governor Amarion SoftBreak  Coordinates: 245, 121, 67 AlignDefault \n  Color|orange|[Governor Amarion]}} \n Oh hello; name's Amarion. What can I do for you? \n  Color|purple|[How did you become governor of Molta?]}} \n  Color|purple|[What is Molta?]}} \n  Color|purple|[Anything you can tell me about the rumors of people going missing?]}} \n  Color|orange|[Governor Amarion]}} \n Eh? You nuts or something? Don't come stomping into my office with such nonsense. \n  Color|purple|[Quite the reaction to a simple question.]}} \n  Color|orange|[Governor Amarion]}} \n Who do you think you are? I oughta kick you out, you snooping weasel! \n  Color|gray|You definitely aren't going to be getting anything out of him.}}  \n&o  2/3 - Search around Molta for clues about the disappearances. Foreman Boris could know something. Table  AlignDefault ColWidthDefault AlignDefault \n Foreman Boris SoftBreak  Coordinates: 184, 110, 43 AlignDefault \n  Color|orange|[Foreman Boris]}} \n Hello there! Welcome to Molta! I run the base mining operations here, but I still have to report to Amarion. \n  Color|purple|[I needed to ask you something, actually.]}} \n  Color|orange|[Foreman Boris]}} \n What might that be? \n  Color|purple|[I've heard some rumors about people going missing. Any idea what that might be about?]}} \n  Color|orange|[Foreman Boris]}} \n Well... I haven't the slightest, uh, idea where you got that information there, friend! Sounds like a bunch of hoopty to me! \n  Color|gray|He looks rather nervous.}} \n  Color|purple|[You don't seem to confident in that answer.]}} \n  Color|orange|[Foreman Boris]}} \n Oh, I don't have to stand here and take questions from some outsider. Get out! \n  Color|gray|He gives you a stern look. You probably aren't going to get any more information out of him.}}  \n&o  3/3 - Search around Molta for clues about the disappearances. Perhaps Record Keeper Shani knows something Table  AlignDefault ColWidthDefault AlignDefault \n Record Keeper Shani SoftBreak  Coordinates: 186, 98, 22 AlignDefault \n  Color|orange|[Record Keeper Shani]}} \n Hello! Welcome to the Molta Archives! Let me know if I can help you with anything. \n  Color|purple|[Actually, there is this one thing...]}} \n  Color|orange|[Record Keeper Shani]}} \n Oh? What is it? \n  Color|purple|[Well, I came across a strange rumor that miners have seemingly gone missing, but there doesn't seem to be any record of that.]}} \n  Color|orange|[Record Keeper Shani]}} \n Oh... Well, I... \n  Color|purple|[Anything to say on it?]}} \n  Color|orange|[Record Keeper Shani]}} \n Listen, there is something to that story, but I can't say much or Amarion will have me sacked. The only thing I can do is give you this- but do not mention it to anyone, understand? Now please leave, I can't have you snooping around here or someone will notice. \n  Color|gray|She leans over to whisper to you.}} \n  Color|purple|[Oh! Thank you!]}} \n  Color|orange|[Record Keeper Shani]}} \n Hurry along now... Don't let Amarion see you.  \n&o  Return to Issa to tell her what you've found out around town Table  AlignDefault ColWidthDefault AlignDefault \n Issa AlignDefault \n  Color|orange|[Issa]}} \n So have you found anything? \n  Color|purple|[Sort of, Amarion and Boris are silent and abrasive, but Shani gave me these records.]}} \n  Color|orange|[Issa]}} \n Oh how interesting, let me look them over. \n  Color|gray|She reads the records trying to make sense of the censored words.}} \n  Color|purple|[So do those records help?]}} \n  Color|orange|[Issa]}} \n They are hard to make out but... Wait, I think I know what they've censored! \n  Color|purple|[And? What is it?]}} \n  Color|orange|[Issa]}} \n They are almost definitely mentioning the Basanite Bore! If memory serves, that used to be a mining operation site. Why don't you head over there and see if you can find anything relevant? I'll see what information I can dig up on the Bore while you are gone.  \n&o  Investigate the Basanite Bore Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|gray|You begin to feel lightheaded, and everything goes black.}} \n  Color|orange|[Basanite Miners]}} \n HELP US! \n  Color|orange|[Basanite Miners]}} \n PLEASE! \n  Color|orange|[Basanite Miners]}} \n WE'RE BEGGING YOU! \n  Color|orange|[Basanite Miners]}} \n FREE US! \n  Color|orange|[Basanite Miners]}} \n LET US OUT! \n  Color|orange|[Basanite Miners]}} \n SAVE US! \n  Color|orange|[Basanite Miners]}} \nRawInline   Color|orange|[Basanite Miners]}} \n PLEASE! \n  Color|orange|[Basanite Miners]}} \n SAVE US! \n  Color|orange|[Basanite Miners]}} \n PLEASE! \n  Color|gray|You open your eyes and find yourself back in Basanite. Whatever just happened, Issa will probably want to know about it.}}  \n&o  Return to Issa to tell her about your strange encounter Table  AlignDefault ColWidthDefault AlignDefault \n Issa AlignDefault \n  Color|orange|[Issa]}} \n What's wrong? You look startled. \n  Color|purple|[Something... very weird happened...]}} \n  Color|orange|[Issa]}} \n And? What was that? \n  Color|purple|[I had a... dream? Vision, maybe? There were these miners, begging to be rescued.]}} \n  Color|orange|[Issa]}} \n What? Were they trapped somewhere? Held hostage? \n  Color|purple|[I don't know, they just kept begging for help.]}} \n  Color|orange|[Issa]}} \n I suppose if they truly are alive somewhere and unable to escape, then the top priority should be to help them rather than debate details. Amarion isn't going to talk- he's a puppet of Alnera. Maybe with enough evidence though, we can swap the Foreman. \n  Color|orange|[Issa]}} \n In the little amount of writing I was able to find about Basanite while you were gone, I noticed that it was an operation that occured in tandem to the Terracotta mining operation. There is a mining town out near Basanite that it took place in. Head there and see if you can find anything.  \n&o  Head to the Terracotta Mining Town to retrieve some evidence in order to get the Foreman to talk. Table  AlignDefault ColWidthDefault AlignDefault \n Foreman Boris AlignDefault \n  Color|orange|[Foreman Boris]}} \n Oh, it's you again... I thought I told you to get out. \n  Color|purple|[Yes, well, I've got some more questions for you.]}} \n  Color|orange|[Foreman Boris]}} \n I told you before, whatever rumor you have heard is absurd. It's just a story. \n  Color|purple|[Then care to explain this?]}} \n  Color|orange|[Foreman Boris]}} \n Where did you get that? \n  Color|gray|He suddenly looks very worried.}} \n  Color|purple|[I found it in an old mining camp. It mentions some very interesting things, namely \"The Basanite Mission\".]}} \n  Color|orange|[Foreman Boris]}} \n ... \n  Color|purple|[Let's see, now. How about we start off with whatever \"Cursestone\" is?]}} \n  Color|orange|[Foreman Boris]}} \n Okay, okay! Look, I'll talk. I can't keep this a secret forever- Amarion be damned! \n  Color|purple|[What happened here?]}} \n  Color|orange|[Foreman Boris]}} \n Well, some years back, we lost miners- a lot of miners- to this cursed Basanite mission. If this had gotten out, our town would be out of business, and Alnera would have our heads. So we had to keep it a secret. Amarion came up with that idea, of course... \n  Color|purple|[I'm not entirely sure they are dead. I went to Basanite, and I think they somehow reached out to me, begging for help to escape.]}} \n  Color|orange|[Foreman Boris]}} \n I... I don't understand how that could be. We saw them die... We... we collapsed the entrance and sealed it off because we knew they were gone... No, please don't tell me we trapped them inside of that place. Damn you Amarion!   RawInline &o  Return to the Basanite Bore and meet Boris at the bottom of the mine \n Solve the Rubiks Cube to proceed to the next part. Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|orange|[Disembodied Voice]}} \n How pathetic you are, human. So easily swayed into my bidding by manipulating you with hopes of saving the dead. \n  Color|orange|[Disembodied Voice]}} \n \"Please   RawInline   Color|orange|[Disembodied Voice]}} \n Now, a path for me has been created to the surface; I shall once again be free. But you- you are no longer of service to me. Allow me to do the honors of splitting your mind in half before consuming it into my flesh.  \n Defeat the boss to proceed to the next part. Table  AlignDefault ColWidthDefault AlignDefault \n Foreman Boris AlignDefault \n  Color|orange|[Foreman Boris]}} \n As I suspected, the seal is now broken, but there are no miners leaving the cave in freedom. I believe we may have been played. \n  Color|purple|[Something definitely wanted to be freed, but it wasn't the miners.]}} \n  Color|orange|[Foreman Boris]}} \n Well, whatever it is that's down there, please be careful. I don't have a good feeling about this, but our town needs closure- please, do this for us. I'm... no, WE, are counting on you. \n  Color|purple|[I won't fail you, Boris.]}} \n  Color|orange|[Foreman Boris]}} \n Godspeed   RawInline  SECRETS BEST LEFT FORGOTTEN COMPLETE! SoftBreak  Awarded a   Link   Cyan Scourge_of_Lunacy wikilink Key,   Link   Excavator's Hardlamp Excavator's_Hardlamp wikilink  , and access to the   Link   Cyan Scourge_of_Lunacy wikilink Dungeon Teleporter!  ", "reward": "rewards = *&3Excavator's Hardlamp&r\n*&3Scourge of Lunacy|Cyan&r Key\n*Access to &3Scourge of Lunacy|Cyan&r Dungeon Teleporter"}