{"name": "Shurima's Big Day Off", "information": "prerequisites =\n* &3Malevolent Reverie&r\n NPC: Shurima Coords: 455, 192, -382\n King's Valley Ta'Eldim\nrelated_poi=&3Corrupted Caves&r\n", "dialogue": "  WorkInProgress|Missing two ending branches. Table\n Shurima\n  Coordinates: [455, 192, -382]\n   &6[Shurima]\n You are the one who restored the flow of magic? You haven't seen my daughter Midrey, have you? She's always getting into\ntrouble... I have so much to do and so little time...\n  &5[I'm sorry to hear that.]\n  &6[Shurima]\n It's fine. Anyway, I have a job for you. T'Xoc, our village leader, tells me you're doing jobs for people for goodwill or\nsomething.\n  &5[I guess that's a fair assessment.]\n  &6[Shurima]\n Good. I need some weight taken off my shoulders. My wedding anniversary is tomorrow and both Arkhest and I are too busy to\nprepare like we ant to. We'll have been together for ten years now and it has to be special. It HAS to be.\n  &5[So what do you need me to do? Restore naturey marriage magic? Battle monsters?]\n  &6[Shurima]\n What? No nothing like that. I have a few tasks that I don't have the time to do and I need your help.\n  &5[Oh. Okay I guess.]\n  &6[Shurima]\n Excellent.\n  &6[Shurima]\n Right, so first I need you to take some money over to the moneychanger at the bar. I'm sure he could use some business instead\nof spending all his time getting drunk. Plus, I need Narsen currency for whatever Arkhest has planned.\n  &5[I didn't know Tlaxans had different currency.]\n  &6[Shurima]\n Of course we do. Do you think we didn't have money before the Nrasens invaded? Here, take this and change it for me.\n  &5[What is this? It looks like a plant.]\n  &6[Shurima]\n It's money go and stop asking dumb questions.\n  &5[You got it.]\n  &6[Shurima]\n Hurry along.\n&o  Head to Moneychanger Elgort in the Tipsy Tlaxan. Table\n Moneychanger Elgort\n  Coordinates: [452, 196, -333]\n   &6[Moneychanger Elgort]\n *Hic*-money makes the world go 'round they say... what can I *hic* do for you?\n  &5[Hi, I've been sent to change this Tlaxan money for Narsen money.]\n  &6[Moneychanger Elgort]\n Change what now-*hic*?\n  &5[Tlaxan currency. I need it converted.]\n  &6[Moneychanger Elgort]\n What the uh... what was the word again... Z'cur? I think that's right. Yeah what the Z'car is that?\n  &5[Uh... so can you convert it?]\n&o  He leans forward and seems to sober up\n  &6[Moneychanger Elgort]\n I suppose I could try and cast the conversion spell the Goldmage taught us. No promises on what might happen though...\n  &5[Let's do it.]\n  &6[Moneychanger Elgort]\n Here we go!\n  &6[Moneychange Elgort]\n   &eMONEY MAKES THE WORLD GO *ROUND!\n  &5[That's it? That's the whole spell?]\n  &6[Moneychanger Elgort]\n Shh... Let's see if it worked!\n  &5[I don't think it did...]\n  &6[Moneychanger Elgort]\n Well Z'cat. Sorry friend.\n  &5[I guess I'll head back to Shurima now.]\n  &6[Moneychanger Elgort]\n Good luck! She scares me!\n&o  Return to Shurima... carefully. Table\n Shurima\n  &6[Shurima]\n Have you spoken to the Moneychanger yet?\n  &5[Yes, but you're not going to like the answer.]\n  &6[Shurima]\n I hope this doesn't become a running theme... What is it?\n  &5[We couldn't figure out how to change the money.]\n  &6[Shurima]\n What in C'Shura's name do you mean?\n  &5[It's not a simple process okay?]\n  &6[Shurima]\n This is not okay! How could a moneychanger, whose only job is to change money, fail to change money?\n  &5[The magic didn't recognize whatever this stuff is!]\n  &6[Shurima]\n That \"STUFF\" is our money! I cannot believe this. Fine, I have something else you can do instead.\n  &5[Great...]\n  &5[Sure thing!]\n  &6[Shurima]\n So if changing money is too hard for you, why don't you head back to the bar and pick out a nice wine for the dinner? Keep the\nmoney - you'll need it with Murtag, the barkeep.\n&o  Murtag, back in the Tipsy Tlaxan, might have what we need. Table\n Murtag\n  &6[Murtag]\n Welcome to the Tipsy Tlaxan! Step right up, grab a beer, and relax! Let all your cares wash away.\n  &5[I'm actually after a nice wine.]\n  &6[Murtag]\n Ah! Are you helping out Shurima and Arkhest? I hear their anniversary is coming up! What kind of wine are you after?\n  &5[What do you recommend? I'm not really the wine type.]\n  &6[Murtag]\n That's right, you adventurers seem to like potions more than anything. Well, I've got a nice Tlaxan Wine in my stock. Just\ntrade me and I'll sell it to ya for half a stack of Experience Bottles.\n  &5[Wait, do you not take Tlaxan Currency?]\n  &6[Murtag]\n Oh goodness, no. Narsen money is the only thing a man like me needs. Elgot over there talked me into changing!\n  &5[Ugh... okay.]\n  &6[Murtag]\n I hope she enjoys it!\n&o  [1/2]: Trade with Murtag and purchase Tlaxan Wine for Shurima.\n&o  [2/2]: Return to Shurima once you have Tlaxan Wine. Table\n Shurima\n  &6[Shurima]\n Any luck with the wine yet?\n  &5[I've got it right here!]\n  &6[Shurima]\n Thank goodness. you CAN do simple tasks!\n  &5[Yeah but... Murtag isn't taking your... currency... anymore. I had to spend my own money on it.]\n  &6[Shurima]\n You are just full of problems today! Ugh! Just keep the money I gave you. That should be more than enough! This is absurd.\n  &5[You're really overreacting.]\n  &6[Shurima]\n You think?! My anniversary is TOMORROW and nothing is together. We have nothing prepared, the house is a mess, our daughter is\nhiding somewhere, and my husband is holed up in his little library. All of this is on me, and I just asked for a bit of help.\n  &5[...]\n  &6[Shurima]\n Why don't you just see if Arkhest needs any help. I think I'll get more done here without you.\n&o  Be a good hero and head to Arkhest. Table\n Arkhest\n  Coordinates: [480, 196, -350]\n   &6[Arkhest]\n You're not a Son of the Forest after all? Thank Ixume... I'm Arkhest, the librarian. I've got lots of exciting volumes! My wife\nsays I'm too stuck in my books, but I really love it here.\n  &5[I'm actually here because of your wife.]\n  &6[Arkhest]\n OH NO! Did something happen?\n  &5[No, nothing like that. I'm helping her prepare for your anniversary.]\n  &6[Arkhest]\n Z'Chun! That's tomorrow! I knew I was forgetting something! So what can I do for you?\n  &5[Actually I'm here to help you.]\n  &6[Arkhest]\n Wow, that's sweet of Shuri. Se sent you to help me with my overdues I imagine. I'm glad she's got everything sorted at home\nthen!\n  &5[About that...]\n  &6[Arkhest]\n Right! So I've got one more overdue to handles today. Talisa, the Crafter owner? She's had a book overdue for MONTHS! She owes\nme a good bit of money and I really need the book back. It's called Of Shamans and Spells. It's a lovely book really, about a\nhero thwarting the wicked Siblings of the Trees and their attacks on an Abbey. You might really like it! But yeah, Macuniloh\nwants to read it, so I'll need it back along with her late fee. Should be 64 of our currency, but at this point I'll take\nanything. Thanks [Player]! You're a big help!\n&o  Chase down the vile book thief, Talisa. Table\n Talisa\n  Coordinates: [498, 187, -371]\n   &6[Talisa]\n I'm Talisa. T'Xoc says I am to let you use my crafter. There it is.\n  &5[I'm actually here on behalf of Arkhest.]\n  &6[Talisa]\n Oh great. Not only do you waste my time but no you come hounding me about a trashy book?\n  &5[So you know what he needs?]\n  &6[Talisa]\n Yes, he needs his book and his stupid late fee. I can't afford it. I didn't bring the book back cuz I didn't want to tell him.\nA'rexk! I didn't want to tell you either.\n  &5[I'm sorry. Maybe we can come to a deal?]\n  &6[Talisa]\n What kind of deal?\n  &5[How much do you owe?]\n  &6[Talisa]\n I owe... a stack of our currency.\n  &5[Lucky for you, I have a stack. Can you give me something else for it along with the book?]\n  &6[Talisa]\n No.\n  &5[Well, good luck then.]\n  &6[Talisa]\n WAIT! Okay then. Fine outsider. I'll tell you some recipes to use in this crafter and give the book back. How does that sound?\n  &5[That sounds fair.]\n  &6[Talisa]\n Here's the stupid book. Now for your recipes. You can make three potions by putting a   Link   Pulsating Dust Pulsating_Dust\nwikilink surrounded by an ingredient for a cure for Marasmus Execratio into the crafter. They're worth it.\n&o  Return to Arkhest, victorious. At last, a win for us? Table\n Arkhest\n  &6[Arkhest]\n Is that my book I smell?\n  &5[...Yes? You can smell it?]\n  &6[Arkhest]\n Of course. Every book here I can recognize instantly. They're like my children. Now, do you mind going and changing the late\nfrom Talisa over to Narsen currency? We'll definitely need some.\n  &5[I already that for Shurima. It didn't work.]\n  &6[Arkhest]\n No, no. It definitely will work. I heard someone say it did. Go use Elgort in the bar. He's the best!\n&o  ...Go talk to Moneychanger Elgort. Ugh. Table\n Moneychanger Elgort\n  &6[Moneychanger Elgort]\n Money makes the world go 'round!\n  &5[Hi again, I've been sent to change this Tlaxan money for Narsen money again... Shurima's husband thinks it'll go\ndifferently.]\n  &6[Moneychanger Elgort]\n Z'coop! I mean uh... oh no!\n  &5[Oh no indeed.]\n  &6[Moneychanger Elgort]\n Well uh... What do we do?\n  &5[I thought you were the expert.]\n  &6[Moneychanger Elgort]\n Not really. Training only took like a week. It was the background check that took forever.\n  &5[Oh.]\n  &6[Moneychanger Elgort]\n Yeah. Really difficult that. Anyway, want me to try the spell again?\n  &5[Eh... why not?]\n  &6[Moneychanger Elgort]\n Cool.\n  &6[Moneychange Elgort]\n   &eMONEY MAKES THE WORLD GO *ROUND!\n  &5[Does your tone matter? You sounded really unenthusiastic right there.]\n  &6[Moneychanger Elgort]\n Hush, no it doesn't. Clearly, since it didn't work again. I hate this job!\n  &5[Me too buddy. Thanks for trying.]\n  &6[Moneychanger Elgort]\n Good luck!\n&o  Go disappoint Arkhest... Table\n Arkhest\n  &6[Arkhest]\n How goes the changing of the money with Elgort?\n  &5[Like I told you, it didn't work. The spell he uses to transform money doesn't recognize this stuff.]\n  &6[Arkhest]\n That doesn't make any sense! Have him try again!\n  &5[...Arkhest. I'm not going to do that.]\n  &6[Arkhest]\n Why not?\n  &5[Because I've done it twice already and it didn't work either time. You'll have to find another way.]\n  &6[Arkhest]\n Fine... I'll just take the money then. I've got another task for you while I research how to change money myself!\n  &5[What can I do?]\n  &6[Arkhest]\n I mentioned that my books were like my children earlier but I ah... forgot my actual child. Can you hunt around Ta'Eldim and\nfind Midrey for me? She's a small child and she likes to wander off...\n  &5[Any ideas where to start?]\n  &6[Arkhest]\n She likes the sound of water! I'd start there.\n&o  Find Midrey. Table\n Midrey\n  Coordinates: [476, 184, -357]\n   &6[Midrey]\n ...\n  &5[Aha, I found you!]\n  &6[Midrey]\n ...\n  &5[Midrey? Are you okay?]\n  &6[Midrey]\n ...\n  &5[Midrey?]\n  &6[Midrey]\n&o   &eand so they seek the way... a Sanctum lost, a mind decayed.\n  &5[Excuse me?]\n  &6[Midrey]\n&o   &enowhere... nowhere left to stand... A binder of souls... lost, forsaken...\n  &5[Are you... talking about C'Shura?]\n  &6[Midrey]\n   &eC'SHURA LOST IN THE DEPTHS. C'AXTAL TAKEN BY THE JUNGLE. C'SHURA C'SHURA C'SHURA.\n  &5[Midrey? Hey! Wake up!]\n  &6[Midrey]\n   &eSHE LIVES. SHE SEES ALL.\n&o  Midrey slumps to the ground.\n  &5[Oh god, I need to go tell Arkhest.]\n  &6[Midrey]\n ...\n&o  Hurry back to Arkhest. Table\n Arkhest\n  &6[Arkhest]\n Any luck fin-\n  &5[ARKHEST! I found Midrey. Something's wrong.]\n  &6[Arkhest]\n What do you mean something's wrong?!\n  &5[She was unconscious and wouldn't wake. She kept saying strange things about C'Shura.]\n  &6[Arkhest]\n She was unconscious? Oh no no no. No no this isn't okay oh no oh Ixume no. This is really bad. Where is she?!\n  &5[Under the waterfall.]\n  &6[Arkhest]\n Oh Ixume. Go get Shurima. Please. Oh Ixume I don't know what to do. None of my books have ever said anything about this!\n&o  Hurrier back to Shurima. Table\n Shurima\n  &6[Shurima]\n I thought I told you to go help Arkhest.\n  &5[He needs you. Your daughter needs you.]\n  &6[Shurima]\n Oh my god, what happened? Is something wrong?\n  &5[She is unconscious under the waterfall, saying very strange things.]\n  &6[Shurima]\n WHAT?! My baby?! What happened? WHAT DID YOU DO? Did you do something? What do we do?! What was she saying?\n  &5[She was saying some strange things about C'Shura and a place.]\n  &6[Shurima]\n T'Xoc. We need T'Xoc. This is not okay. Please go uh god, I'm so sorry I got you involved in this... Please get him. My baby...\n&o  Hurriest to T'Xoc. Table\n T'Xoc\n  &6[T'Xoc]\n Hello again [Player]. What can I do for you?\n  &5[I need your help.]\n  &6[T'Xoc]\n What is it?\n  &5[I've been... trying... to help Shurima and Arkhest with some tasks, but something's wrong with their daughter, Midrey.]\n  &6[T'Xoc]\n Wrong how?\n  &5[I found her unconscious and saying some weird things about C'Shura and a Sanctum.]\n  &6[T'Xoc]\n ...\n  &5[T'Xoc?]\n  &6[T'Xoc]\n It cannot be. Gods above. The legends are coming true...\n  &5[What legends?]\n  &6[T'Xoc]\n I shouldn't be telling this to an outsider, but you have been such a help. I will share. Ever since the disappearance of\nC'Axtal 50 years ago, it has been said that a new Soulspeaker would rise. I did not believe, as I think C'Axtal still lives, but\nif what you say is true... He may be gone and their daughter, Midrey, may be inheriting these powers.\n  &5[If C'Axtal was the Soulspeaker, why would she be saying things about C'Shura?]\n  &6[T'Xoc]\n C'Shura went in search of C'Axtal in what we now call the Forsworn Sanctum, Ta'Ferna. If Midrey is seeing her... she could\nstill be there, trapped? It was a dangerous journey and far more dangerous inside...\n  &5[Is Midrey in danger?]\n  &6[T'Xoc]\n Oh, goodness no. If anything, she has inherited great power. I will bring her to Barras, the shrinetender. He will take her on\nas a student and teach her to control these dreams.\n  &5[So what's next?]\n  &6[T'Xoc]\n I shall go attend to Midrey. You should go speak to her parents. I'm sure they need some reassurance. Go to her mother first.\nI'm sure Arkhest will have returned home.\n&o  Calmly talk to Shurima. Table\n Shurima\n  &6[Shurima]\n What have you heard? Did T'Xoc say anything?\n  &5[Midrey is going to be okay. T'Xoc has some big news though.]\n  &6[Shurima]\n What is it?\n  &6[Arkhest]\n Is she going to be okay?\n  &5[She's going to be fine. T'Xoc believes she may become the next Soulspeaker.]\n  &6[Arkhest]\n WHAT?!\n  &5[You both should go speak to him. He's going to make sure she's fine, he said.]\n  &6[Shurima]\n This is not what I expected to hear today... Our little Midrey... A Shaman? We've raised her so well, my love.\n&o  She and Arkhest embrace.\n  &5[I'm going to head to T'Xoc and see what more I can do to help.]\n  &6[Shurima]\n Thank you. I mean it.\n&o  Have a cryptic chat with T'Xoc. Table\n T'Xoc\n  &6[T'Xoc]\n Welcome back, [Player]. How did Shurima and Arkhest take the news?\n  &5[They seem relieved.]\n  &6[T'Xoc]\n Wonderful. I paid a visit to Midrey. She is awake and recovering now, though I imagine she'll be back in that cave in mere\nminutes. I... have a bit of a task for you still, however.\n  &5[What's that?]\n  &6[T'Xoc]\n Would you be willing to take on the journey to the Sanctum and see if what Midrey said of C'Shura is true? I know this is very\ndifferent from doing simple tasks for townsfolk, but I trust you can handle it.\n  &5[I'm the hero for the job!]\n  &6[T'Xoc]\n This is great news. Now, listen closely, and I will reveal the way into Ta'Ferna, the fallen Sanctum.\n  &6[T'Xoc]\n Now, Ta'Ferna, yes. We Tlaxan were involved with the sealing of that forsaken place. Cursed by Kaul during the fall of C'Axtal,\nthe Sanctum is horribly corrupted by nature. The only way there is through a fountain hidden underground beyond what you call\n\"Farr\".\n  &5[The Fountain of Miracles?]\n  &6[T'Xoc]\n What? That is an absurd name. Is that what the Narsens call it? It's no miracle. It's a guardian. A spirit to ward off\ntravelers who would be foolish enough to enter the Sanctum. But I will tell you how to enter. Quite near the hot springs below\nus is a hidden passage, leading to a rushing stream that feeds the Red Xekkj hotspring. That streams runs right to the Sanctum.\nYou must purify the water within then return to me.\n  &5[Sounds easy enough.]\n  &6[T'Xoc]\n Go to the stream and purify the water. Instructions are available there, for those in times of great need. Return to me if you\nsucceed at this task, and I can then open the way for you.\n&o  Find the not so hidden passage near the hot springs and solve the puzzle within.\n  Pull levers in this order:  Plain  Top White Plain  Bottom Purple Plain  Top Orange Plain  Top Blue Plain  Bottom Yellow Plain\nTop Yellow Plain  Bottom Orange Plain  Bottom White Plain  Top Purple Plain  Bottom Blue\n  After solving the puzzle:\n&o  Remember to talk to T'Xoc before heading to The Fountain!\n C:   &o  Back to T'Xoc we go. Table\n T'Xoc\n  &6[T'Xoc]\n I can feel it. The waters flow pure again... Are you ready to travel to Ta'Ferna?\n  &5[I am.]\n  &6[T'Xoc]\n Then go. The way forward will be open to you now.\n&o  [1/4]: Hurriest-er to the Fountain of Miracles and explore within.\n&o  [2/4]: Once you have found your way through, speak to the one that is waiting on the other side.\n&o  [3/4]: If the path closes on you, repurify the stream by redoing the puzzle near the hot springs...\n&o  [4/4]: ...Then speak to T'Xoc to reopen the way once more.\n Reaching the path:\n  &5As you go deeper through the cave, you being to feel at one with nature, and the world fades away. Table\n Nai (Sanctum Lobby)\n  &6[Nai]\n You... you are no Tlaxan. How have you reached Ta'Ferna?\n  &5[I have been sent here by the Tlaxan of Ta'Eldim to search for C'Shura.]\n  &6[Nai]\n A humble place, grown, beyond simple roots. You have come to the right place, but I fear to allow you within. This place is\novertaken by wild magics. I am here to guard this way. Why should I allow you within?\n  &5[I have claimed the Tlaxan gods - White, Orange, and Magenta. I can handle myself.]\n  &6[Nai]\n You indeed have. If you truly believe you will not fall to the wild magics, I will let you pass, with my blessing.\n  &5[A child in Eldim has seen C'Shura alive inside this place.]\n  &6[Nai]\n I too believe she is. But the wild magics here have tainted all they touch. Nothing within will be as you expect. Pass, with my\nblessing.\n  &5[I purified the spring to open the way, so I could investigate this place.]\n  &6[Nai]\n Of course you had. There is no other way inside left. I trust my instructions were clear?\n  &5[Very.]\n  &6[Nai]\n (MISSING)\n  &5[I suppose.]\n  &6[Nai]\n (MISSING)\n  &5[Not particularly.]\n  &6[Nai]\n You are here now, however. That's all that matters.\n SHURIMA'S BIG DAY OFF COMPLETE! Awarded access to   Link   Forsworn Sanctum Forsworn_Sanctum wikilink ike, and a   Link\nForsworn Sanctum Forsworn_Sanctum wikilink key.\n", "reward": "rewards =\n* Access to &3Forsworn Sanctum&r\n* 1 &3Forsworn Sanctum&r key\n* Usage of the &3Forsworn Sanctum&r teleporters in &3Ta'Eldim&r and &3Sierhaven&r\n* The ability to amplify &3Corrupted Caves&r\n"}