{"name": "Siege of Highwatch", "information": "prerequisites = *&3Sons of the Forest&r\n*&3The Plague&r NPC: Commander Haynes King's Valleytown = Highwatchrewards = *&3Highstorm&r \n*128 Enchanting Bottles. King's Valleytown = Highwatchrewards = *&3Highstorm&r \n*128 Enchanting Bottles.town = Highwatchrewards = *&3Highstorm&r \n*128 Enchanting Bottles.", "dialogue": " Table\n Commander Haynes\n  Color|orange|[Commander Haynes]\n Welcome, Vargos told me you were coming. We've also been preparing for an assault on the Sons of the Forest and our prepa-\nSoftBreak &o  You hear ghasts and screaming from outside\n  Color|orange|[Commander Haynes]\n Damn! They're coming again! We could use your help, any chance you're good with a bow?\n  Color|red|Make sure you are fully geared with a bow and ready to fight before accepting\n  Color|purple|[Yes, I'll help!]\n  Color|purple|[No, I have to go]\n  Color|orange|[Commander Haynes]\n That's what I like to hear! Now get to a tower and get ready for a fight.\n&o  Help defend Highwatch against the horde of mobs then break the Sons of the Forest's summoning stone\n During the Siege:\n  Color|orange|[Commander Haynes]\n We just need to hold the ghasts off for a few minutes while Josiah gets the wards up, then we can take the fight to them. Hold\nfast!\n  Color|orange|[Commander Haynes]\n Here they come!\n  Color|orange|[Commander Haynes]\n Josiah's halfway done, keep firing!\n  Color|orange|[Commander Haynes]\n Just a few more moments!\n  Color|orange|[Commander Haynes]\n Josiah's spell is up, we're clear of the ghasts! Somewhere out there is their summoning stone! Grab that pickaxe and destroy\nit!\n  Color|orange|[Commander Haynes]\n Haha, great job! That should stop the attack. Come to my office, I've got some good news!\n&o  Speak with Commander Haynes in his office Table\n Commander Haynes\n  Color|orange|[Commander Haynes]\n Hahaha! Great job, Highwatch might've fallen without you. More good news, Ursan and his scouts captured one of their Wardens.\nHe's down in the cells right now. Their fortress is protected with magic, so see if you can get him to tell us how to get past\nit.\n&o  Speak with the Sons of the Forest's Warden. Leave the holding cells by talking with the guard. Speak with C'Taz about making\na Truth Serum\n&o  The Collect the Fire Fish in the   Link   Southern Cenote Southern_Cenote wikilink\n  [Spoiler]   Link   How to make the Truth Serum Puzzle_Solutions_Guide/Siege_of_Highwatch wikilink\n&o  Head back to the holding cells in the Highwatch and speak with the Warden with the Truth Serum Table\n Warden\n  Color|orange|[Warden]\n You may have entombed me here, but it is pointless. Our magic is mightier than ever, far beyond when we clashed with your\nArchmages thirty years ago. Our magic will triumph. This castle will fall. The Empire will fall. And you will die too.\n  Color|purple|[Why is your magic stronger?]\n  Color|orange|[Warden]\n A man appeared four months ago, clad in a black mask. He was sympathetic and gave us an ancient artifact. Touching it focuses\nyour mind and sends liquid fire through your veins. Channeling its power, one man could destroy an army.\n  Color|purple|[What is your plan?]\n  Color|orange|[Warden]\n An ancient spell. We will summon the spirit of the Blackroot, an ageless elemental being embodying the fury and decay of the\njungle itself. We will loose it upon your cities. It will tear apart fortresses as the ground beneath your feet turns to peat\nand the insects rend the flesh from your bones.\n  Color|purple|[How do I get into your sanctum?]\n  Color|orange|[Warden]\n The barrier within the Verdant Fortress repels anyone not wearing a shroud made of woven mistleaves and sanctified with blood\nmagic. Wearing this will let you through the barrier and make you all but invisible to the wardens patrolling the inner sanctum.\n&o  This should be enough information to get in when the time is right.\n&o  SIEGE OF HIGHWATCH COMPLETED Awarded   Link   Highstorm Highstorm wikilink and 128 Enchanting Bottles.\n", "reward": "rewards = *&3Highstorm&r \n*128 Enchanting Bottles.|prerequisites = *&3Sons of the Forest&r\n*&3The Plague&r|starting_npc_coordinates = 1195 131 -106"}