{"name": "Snow Man Left Behind", "information": "prerequisites = &3Words Upon Hushed Lips&r\n NPC: Selholly Sprignos Coords: -850, 101, 78\n King's Valley Sierhaven\n", "dialogue": "}} \n  WorkInProgress|A line of Selholly first dialogue.}} Table  AlignDefault ColWidthDefault AlignDefault \n Selholly Sprignos \n  Coordinates: [-850, 101, 78] \n   &6[Selholly Sprignos] \n Aaahhh! Who is it? Don't hurt me, I gave you everything I had!  \n  &5[I don't have time for this.]  \n  &6[Selholly Sprignos] \n Not my precious clocks, at least let me keep them! \n  &5[Are you okay? What happened?] \n  &6[Selholly Sprignos] \n Oh, it's just you... No, I am rightfully not! Some thugs broke in at night and demanded I give them all of my research on the mystical Snow Wool! I'm telling you, I was too close to the truth! Unfortunately, they took my plans for the prized Tesseract of Festivity as well, so I can't make any more to sell you either. Do not worry - I will continue my research, and I will solve the mystery of the Snow Wool!  \n  &5[Oh no! Anyways…]  \n  &6[Selholly Sprignos] \n (Missing) \n  &5[I can help you out] \n  &6[Selholly Sprignos] \n Oh, that would be just wonderful! While I was tidying up my lab from the ruckus, I found this receipt for The Blackroot Tavern in Nyr. One of those goons left behind a paper trail, a rookie mistake really. I’m sure they’re still there now, so head over and get my research back!  \n&o  C: Look for a \"goon\" in the Blackroot Tavern in   Link   Nyr Nyr wikilink  . Table  AlignDefault ColWidthDefault AlignDefault \n Colder \n  Coordinates: [-122, 96, -109] \n   &6[Colder] \n Ah, 'ello there. You's lookin' to indulge in some good ol' fashion festive cheer with me?  \n  &5[I'm not in the mood, sorry]  \n  &6[Colder] \n 'ey, fair enough. \n  &5[What's the drink?] \n  &6[Colder] \n Just some eggnog is all. Picked 'er up from the Snowman Embassy a few days back, strong stuff they've got. Still lookin' for a drink?  \n  &5[I'm not in the mood, sorry]  \n  &6[Colder] \n 'ey, fair enough. \n  &5[Sure, I'll take a hit.]  Plain &o  You take a sip of the eggnog. Your vision goes woozy from the \"festive cheer\". \n  &5[Let's pretend I did, I don't like nausea.]  Plain &o  Despite not drinking the eggnog you feel woozy from the \"festive cheer\". \n  &6[Colder] \n Ah, now that we're on the same playing field, let's really talk, shall we? \n  &6[Colder] \n Let me introduce myself properly. My name is Colder. I am an ex-member of the Winter Council. You're here to get back Selholly's research on the Snow Wool, aren't you? \n  &5[How did you know?] \n  &6[Colder] \n Let me introduce myself properly. My name is Colder. I am an ex-member of the Winter Council. You're here to get back Selholly's research on the Snow Wool, aren't you? \n  &5[How did you know?] \n  &6[Colder] \n Let me introduce myself properly. My name is Colder. I am an ex-member of the Winter Council. You're here to get back Selholly's research on the Snow Wool, aren't you? \n  &5[How did you know?] \n  &6[Colder] \n I've known them since I was a teenager, I know all his little tricks. I left that receipt in his lab to lead someone here to speak to me. I needed to warn his helpers about what he's doing. He's on a dangerous path, and someone needs to stop it. \n  &5[What do you mean?] \n  &6[Colder] \n Selholly and I were researching the Snow Wool several years ago when we were on the Winter Council, but he was the more experimental of us. While I was happy just trying to find the Snow Wool, Selholly was busy shoving the primordial element of Festivity into glass boxes. A dangerous process, really. At some point he messed up, and I realized the dangers of what he had done. \n  &5[What dangers?] \n  &6[Colder] \n The entire Winter Council froze over, bells rang out from mysterious places, and a jolly laugh belted through the halls. It was a sight to behold, but I knew it could do much more damage if it continued to be tampered with. I need to find the Snow Wool before Selholly. He can not be trusted with something that powerful. Will you help me? \n  &5[Of course! The world is in danger and I can't stop myself!] \n  &6[Colder] \n Thank you. According to Selholly's notes, we need something called an \" Link   Essence of Winter Essence_of_Winter wikilink  \"?. He has theories of it showing up when various locations around the world get frozen over. During this time of the year that is likely just about everywhere. \n&o  You feel a sudden burst of excitement upon realizing you get to try and save the world. You shake off the effects of the 'nog! Maybe.  \n&o  C: Locate an Essence of Winter, either from one of the cold amplified PoIs or from a chest during the winter event, and bring it to Colder. \n  The cold amplified PoIs that have an Essence of Winter are:  Plain Link   Fire Shrine Fire_Shrine wikilink Plain Link   Hawk Fortress Hawk_Fortress wikilink Plain Link   Litterbox Litterbox wikilink \n  After returning with an Essence of Winter: Table  AlignDefault ColWidthDefault AlignDefault \n Colder AlignDefault \n  &6[Colder] \n Welcome back. Have you found that Essence of Winter? \n  &5[Yes, I have.] \n  &6[Colder] \n Oh, this is just perfect! With this, we can find the Snow Wool! Come, let me take you to my laboratory. Just... uh... put this blindfold on. I can't reveal the location of my lab to anybody, not even you. I'm sure you understand.  \n  &5[Why does it have to be a secret?]  \n  &6[Colder] \n When I'm not researching the Snow Wool, I'm researching other things. I have confidential data that I have promised to keep secret. \n  &5[Of course.] \n  &6[Colder] \n Alright, then let's get going. \n&o  Colder puts a blindfold over your head, and begins escorting you to his lab. It feels... sticky? \n  &6[Colder] \n Alright, we're here! You can take the blindfold off now. \n  &5[I can't. It feels like it's glued onto my head] \n  &6[Colder] \n Oh no, I think I gave you the wrong blindfold. That one might be enchanted with a binding rune. No matter, that'll just serve as your eye protection in case anything goes wrong. I'll get it removed as soon as I can. Anyway, it is time to locate the Snow Wool! \n&o  Colder grunts as you hear the sound of cloth tearing. You feel a cold wind. \n&o  Suddenly, he screams as a bright light nearly blinds you through your blindfold. \n&o  A jolly laugh fills the room, and bells start ringing. \n&o  A loud crash is heard, as the laughing goes quiet. \n&o  You hear footsteps walking towards you, and a flash of purple light shines at you. The blindfold you were wearing falls to the ground. \n  &6[Colder] \n Oh no, oh no no no. Something went wrong. I had no way to test my machine before today. Instead of finding the Snow Wool, a nasty spirit of the ice appeared. It fled deeper into my lab. \n  &5[What do we do?] \n  &6[Colder] \n Me? I don't do anything, I'm not a fighter. You need to go in there and dispose of whatever it is. It left something behind when it fled, maybe it will help you.  \n&o  C: Head further into Colder's Lab. Koal, Soul of the Jungle can sell you Souls of Winter if you need more. \n NOTE: To return to Colder's Lab you can either talk to him in Nyr or the Snowman at (-873, 102, 67) in Sierhaven. \n Use the   Link   Soul of Winter Soul_of_Winter wikilink to fight   Link   Snow Wool Spirit Snow_Wool_Spirit wikilink  . After beating the boss once: \n&o  C: Speak to Colder in his lab. Table  AlignDefault ColWidthDefault AlignDefault \n Colder (Lab) AlignDefault \n  &6[Colder] \n You did it! You destroyed that festive menace! Thank you so much, [Player]. I suppose I'm not much better than Selholly when it comes down to it. \n  &5[What now?] \n  &6[Colder] \n A promise is a promise. While I didn't manage to find the Snow Wool, you helped me try to find it. I'll return his notes to you, and you can give them back to him, alright? \n  &5[Alright.] \n&o  As Colder hands you back Selholly's notes, your vision goes woozy again. You wake up back in the Blackroot Tavern, with a pressure on your shoulder. You should talk to Colder.  \n ''C: Talk to Colder in the Blackroot Tavern. Table  AlignDefault ColWidthDefault AlignDefault \n Colder (Nyr Tavern) AlignDefault \n  &6[Colder] \n 'ey buddy, you alright? \n  &5[What… what happened?] \n  &6[Colder] \n Well, ya took a sip of this here eggnog I offered you, and you's started talking about some snowy wool or somethin'. Half way through your little rant, you's went and done passed out. Tried waking ya up, but you's was out cold. \n&o  As you continue to regain consciousness, you realize Selholly's research is missing. \n  &5[The notes, where are the notes?] \n  &6[Colder] \n What notes? Ya came in 'ere empty handed. You's expectin' me to give you somethin'? Ya can't even handle your nog! \n  &5[But the experiment, and the spirit!] \n  &6[Colder] \n I swear, even I don't get like this on my bad days. Why don't ya run back to where ya came from?  \n&o  C: Return to Selholly empty handed. Table  AlignDefault ColWidthDefault AlignDefault \n Selholly Sprignos AlignDefault \n  &6[Selholly Sprignos] \n Welcome back, [Player]. Did you get my research on the Snow Wool back? \n  &5[Well, I drank some eggnog and...] \n&o  You frantically explain what happened, complete with sound effects and lots of arm waving. \n  &6[Selholly Sprignos] \n Oh dear, that sounds terrible, and also extremely unlikely. But, hey, at least you’re safe. We’ll find out where my research notes went eventually, don’t worry. Please take a model of what I think the Snow Wool would look like as payment for your help.  \n SNOW MAN LEFT BEHIND COMPLETE SoftBreak  Awarded the Replica Snow Wool, the ability to buy and upgrade the   Link   Tesseract of Festivity Tesseract_of_Festivity wikilink  , and the ability to drink more Eggnog with Colder for more interesting results... \n NOTE: The Tesseract of Festivity trade and upgrade can only happen during the winter/christmas event time. ", "reward": "rewards =\n*Replica Snow Wool\n*Ability to buy and upgrade the &3Tesseract of Festivity&r\n*Ability to drink more Eggnog with Colder for more interesting results...\n"}