{"name": "Sons of the Forest (Quest)", "information": "prerequisites = &3Of Monks and Magic&r NPC: Captain Tobias King's Valleytown = Farr NPC: Captain Tobias King's Valleytown = Farr King's Valleytown = Farrtown = Farr", "dialogue": "}} \n&o  After completing   Link   Of Monks and Magic Of_Monks_and_Magic wikilink  , you quest compass tells you to speak with Captain Tobias Table  AlignDefault ColWidthDefault AlignDefault \n Captain Tobias AlignDefault \n  Color|ORANGE|[Captain Tobias] }} \n I'm glad the monks are alive, but if the Sons of the Forest are back we may be in danger. Well, more danger than usual.  \n  Color|PURPLE|[Who are the Sons of the Forest?]}}  \n  Color|ORANGE|[Captain Tobias] }} \n They're a group of dark druids and Tlaxan blood priests. After the Blackroot Wars they vowed to destroy the Narsen Empire and spent decades attacking our towns. They vanished thirty years ago, but there's always been rumors that they still lived. \n  Color|PURPLE|[What are they up to?]}}  \n  Color|ORANGE|[Captain Tobias] }} \n No doubt something sinister and deadly. In their last major attack thirty years ago, they tried to unleash a curse within Farr to turn the inhabitants into mindless monsters under their control. \n  Color|purple|[Where are they located?]}} \n  Color|ORANGE|[Captain Tobias] }} \n They mostly hide within the forests of the Korbar Highlands. However, there's an encampment north-east of here which I suspect is their forward base. Think you could infiltrate it and look for anything suspicious? \n  Color|purple|[Of course, they must be stopped]}} \n  Color|purple|[I'm not quite ready yet]}} \n  Color|ORANGE|[Captain Tobias] }} \n Good luck.  \n&o  Enter the   Link   Suspicious Village Suspicious_Village wikilink 760, 75, -85, and head to the basement. Inside there will be a magma block covered in glass. \n Once you break the glass and \"pick up\" the spell: \n&o RawInline  &5A powerful surge of magic bursts from the spellbook as you approach! A mysterious spell has seared itself into your mind! \n  &6[Screeching Voice] \n They have the spell! Kill them before they take it to the archmage! \n  &6[Screeching Voice] \n Assassins of the Howling Wind, emerge from the shadows and slay them before they reach the archmage! \n C:   &o  A dark curse has been placed upon you and assassins are tracking your every move! Hurry to the capital, Vargos can remove the spell! \n&o  Upon breaking the glass, every minute or so, skeleton 'assassins' will appear and will attempt to kill you. Your goal is to reach   Link   Sierhaven Sierhaven wikilink to break the curse. Note that you can not use any teleporters during the chase. Table  AlignDefault ColWidthDefault AlignDefault \n Vargos AlignDefault \n  Color|orange|[Vargos]}} \n ... That's a lot of dark magic. Don't move, it looks like it's based on a Hazdremar Anchor, which means you're lucky you haven't exploded. And... SoftBreak RawInline  Color|orange|[Vargos]}} Disjuctus Facultsar \n&o  You feel the dark magic pull away from you and it is captured by Vargos \n  Color|orange|[Vargos]}} \n The dark magic that chained itself to you was a complex spell, designed to summon something and then bind it to the casters will. A troubling development indeed.  \n  Color|purple|[Is that bad?]}}  \n  Color|orange|[Vargos]}} \n There was enough power in that spell to summon a full-fledged Genius Loci - guardian spirits with the strength to crush cities. Even worse, I don't think the Sons of the Forest could make this spell alone. Someone is helping them... \n  Color|orange|[Vargos]}} \n The dark magic that chained itself to you was a complex spell, designed to summon something and then bind it to the casters will. A troubling development indeed. \n  Color|purple|[So, now what?]}} \n  Color|orange|[Vargos]}} \n We attack. The Sons of the Forest cannot be allowed to cast this spell, especially if they have access to a Wool. Gather your strength, go to Highwatch, and talk to Commander Haynes. Be wary; this will not be easy.  \n&o  SONS OF THE FOREST COMPLETE! Awarded   Link   Silver Knight's Hammer Silver_Knight's_Hammer wikilink  . You may now use the   Link   Warlock Warlock wikilink class \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *&3Silver Knight's Hammer&r\n*Unlocks &3Warlock&r Class"}