{"name": "Soul of the Forest", "information": "prerequisites = *&3Scars of Magic&r\n*&3Siege of Highwatch&r\n*Completed the &3Arcane Rivalry NPC: Bhairavi King's Valleytown = Nyrstarting_npc_coordinates = -110, 104, -150rewards = *&3Vernal NightmareYellow&r Key\n*Full Access to the &3Vernal Nightmarestarting_npc_coordinates = -110, 104, -150rewards = *&3Vernal NightmareYellow&r Key\n*Full Access to the &3Vernal Nightmare King's Valleytown = Nyrstarting_npc_coordinates = -110, 104, -150rewards = *&3Vernal NightmareYellow&r Key\n*Full Access to the &3Vernal Nightmaretown = Nyrstarting_npc_coordinates = -110, 104, -150rewards = *&3Vernal NightmareYellow&r Key\n*Full Access to the &3Vernal Nightmare", "dialogue": "}} \n&o  Speak with Bhairavi in   Link   Nyr Nyr wikilink Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi AlignDefault \n  Color|orange|[Bhairavi]}} \n Welcome back, ___. I've been investigating into Kaul and the Yellow Wool with my team. Do you have any questions for me? SoftBreak RawInline  Color|purple|[What have you found on the Yellow Wool?]}} \n  Color|orange|[Bhairavi]}} \n Brayllur and Starn have been working on a lead. The Commander in Highwatch seems to have captured a Son of the Forest who has made some very interesting statements under the effects of a truth serum, according to Starn's interview. \n  Color|purple|[Oh, that sounds interesting.]}} \n  Color|orange|[Bhairavi]}} \n It does indeed. I'll be heading over to Highwatch to follow up if you'd care to meet me there. \n  Color|purple|[I'd love to.]}} \n  Color|orange|[Bhairavi]}} \n I'll see you in Highwatch then, __.  \n&o  Meet Bhairavi in the   Link   Highwatch Highwatch wikilink Jail to interrogate the Captured Warden Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi AlignDefault \n  Color|orange|[Bhairavi]}} \n Hi there ___! Glad to see you made it. I've been doing some work trying to interrogate your friend here while my assistant Starn is upstairs speaking to the Commander. It's not exactly easy, but I've been able to coerce out the slightest details thanks to your work with the Truth Serum. Thank you for that. SoftBreak RawInline  Color|purple|[What kind of details?]}} \n  Color|orange|[Bhairavi]}} \n He mentioned the Verdant Fortress and a relic given to them that “seeks the Soulspeaker”, now hidden in its basement.  \n  Color|purple|[What is the Verdant Fortress?]}}  \n  Color|orange|[Bhairavi]}} \n It is the main base of the Sons of the Forest, located not far from here. Highwatch has been looking for ways to attack it for months, but it is heavily fortified and wildly dangerous... but I must ask you to go there. This relic sounds very important in the hunt for the Yellow Wool. \n  Color|purple|[Who is the Soulspeaker?]}}  \n  Color|orange|[Bhairavi]}} \n You should know this one! The Soulspeaker is C'Axtal, the speaker to Kaul. He went missing during the Blackroot War. It seems the relic the Sons of the Forest have could allow them to locate him - and maybe Kaul and his wool too. \n  Color|purple|[What do I need to do?]}} \n  Color|orange|[Bhairavi]}} \n I hate to ask this, but I must send you into the Verdant Fortress. Be very careful. This Warden has said the relic we're seeking is guarded in the basement of the fortress. Please avoid the main fortress. It is far too dangerous. Fortunately, our prisoner mentioned an old ruined tunnel north of the fort that may lead down there. Be quick and show no mercy. The Sons are a stain on the Valley.  \n&o  Head into the tunnel at 955 105 120 to gather the artifact. Report back to Bhairavi on what you find Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi AlignDefault \n  Color|purple|[I don't know how it works, but I've seen it before.]}} \n  Color|orange|[Bhairavi]}} \n You have? Where? \n  Color|purple|[My first adventure in the Valley. I don't remember anything before it though...]}} \n  Color|orange|[Bhairavi]}} \n Tell me about it. \n  Color|purple|[Alright.]}} \n  Color|orange|[Bhairavi]}} \n So you were attacked by a man, this relic was taken from you, and you woke up in Sierhaven? I wonder how you got there... Who were you, ___? Who found you? I think we need to go talk to Commander Haynes upstairs. Maybe she will know more.  \n&o  Speak with Commander Haynes Table  AlignDefault ColWidthDefault AlignDefault \n Commander Haynes AlignDefault \n  Color|orange|[Bhairavi]}} \n Thank you, Commander. We are here seeking information about the Sons of the Forest and ___ themself... Did any of the King’s Guard find a near-dead adventurer recently and deliver them to Nurse Diedre in the capital? SoftBreak RawInline  Color|orange|[Commander Haynes]}} I'd honestly have to check our records... Give me a minute here. The paperwork is so messy. Starn and I had no time to go through it. \n  Color|orange|[Commander Haynes]}} \n The only record I can find of a body found that wasn’t dead recently was of a person found north east of Farr. It says here they were found in a small ruin overlooking the large pit with a 'shrine' inside. Maybe that was you ___? \n  Color|purple|[Maybe it was. I’ve never found it again during my adventures.]}} \n  Color|purple|[It could be. I never bothered to look for it again.]}} \n  Color|orange|[Bhairavi]}} \n This seems worth investigating… Perhaps you can find out more about the artifact and how we can use it there. \n  Color|purple|[Sounds like these ruins outside the pit are my next stop then.]}} \n  Color|orange|[Bhairavi]}} \n Thanks for your help Haynes. \n  Color|orange|[Commander Haynes]}} \n Of course. It is my honor.  \n&o  Investigate the ruins overlooking the pit near   Link   Farr Farr wikilink  . Click the button on the bedrock under the   Link   Kaul Kaul wikilink altar and make your way through the ruins. Upon completing the puzzles, avoid the mobs until Bhairavi teleports you away. Speak with Commander Haynes Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi AlignDefault \n  Color|orange|[Bhairavi]}} \n Thank goodness that worked in time. You’re alive! What did you find in there? SoftBreak RawInline  Color|purple|[We found this book, hidden behind a magical lock]}} \n  Color|orange|[Bhairavi]}} \n Let me look over this... \n  Color|orange|[Bhairavi]}} \n Hmm, it seems to help explain how this relic works. I’ve gotten it active while you were gone, but couldn’t figure out how to lock on to anything. This should work... \n  Color|purple|[I wonder if the Sons and the Masked Man ever worked out where it was pointing.]}} \n  Color|orange|[Bhairavi]}} \n I guess we’ll have to see. It seems to be drawing us south. Let me sync your Quest Compass up to it and we’ll see where it leads. If C’Axtal is somehow still alive, maybe it can take us to him. If not... maybe we’ll find Kaul itself. And the wool? One can hope! \n  Color|PURPLE|[So where exactly am I going?]}} \n  Color|orange|[Bhairavi]}} \n If I had to guess, I’d say it’s pulling you toward the Cursed Forest. I don’t know what you’ll find in there, so be careful. I’ll send Starn and Brayllur after you to help and hopefully everything will work out. Good luck and be safe.  \n&o  Make your way through the cursed forest until you find the yellow lobby teleporter at 1200 71 110 Table  AlignDefault ColWidthDefault AlignDefault \n Brayllur AlignDefault \n  Color|orange|[Starn]}} \n Wait what? What's going on here? The constructural magic should have finished the lobby by now. And what are these giant spikes. SoftBreak RawInline  Color|orange|[Brayllur]}} Dark magic in air. Can smell it. It stink. \n  Color|grey|[ange Figures]}} \n You will go no futher! \n&o  One of the warriors fires a blast directly at Starn, killing him. \n  Color|orange|[Brayllur]}} \n STARN! HOW COULD YOU! DIE YOU SCUM! \n&o  As you finish off the last of the warriors, the large spikes begin to disappear and the constructural magic resumes. The lobby quickly finishes building itself. \n  Color|orange|[Brayllur]}} \n Starn gone... How? \n  Color|purple|[I'm so sorry.]}} \n  Color|orange|[Brayllur]}} \n We lost much for wool. You must get last one... For Starn. \n  Color|purple|[We made it through. The dungeon is all that's left.]}} \n  Color|orange|[Brayllur]}} \n Right, yes. You are. But he is gone. Must get wool... For Starn. \n  Color|orange|[Brayllur]}} \n Found this on floor after Sons ran scared. You need reward before fight for wool...  \n&o  SOUL OF THE FOREST COMPLETE! Awarded a   Link   Yellow Vernal_Nightmare wikilink Key, Full Access to the   Link   Yellow Dungeon Vernal_Nightmare wikilink Lobby Trader, 2   Link   Totem of the Forest Totem_of_the_Forest wikilink  , 10 Anvils, and 64 Arrows of Weakness ", "reward": "rewards = *&3Vernal Nightmare|Yellow&r Key\n*Full Access to the &3Vernal Nightmare|Yellow Dungeon&r Lobby Trader\n*2 &3Totem of the Forest&r\n*64 Arrows of Weakness\n*10 Anvils"}