{"name": "Sporetal Combat", "information": "prerequisites = * &3Unraveled&r\n NPC: Primirium Tybale Coords: -316 182 -672\n Architect's Ring Galengarde\nDifficulty = Medium\nLength = Medium\n", "dialogue": "}} \n&o  Speak with the Galengarde Aboreal Society representatives for Primirium Tybale. Table  AlignDefault ColWidthDefault AlignDefault \n Primirium Tybale \n  Coordinates: [-316 182 -672] \n   &6[Tybale] \n Hey there [Player]. It's good to see you here. I was actually going to reach out to you and your crew, so it's good you stopped by. \n  &5[What's going on?] \n  &6[Tybale] \n Verdanne and I would like to formally invite you and your associates to Conquort's funeral. We've been planning the ceremony for a few weeks and believe it's important you be able to attend, if you can, and witness the Dichen way of honoring the dead. \n  &5[We would be honored to attend.] \n  &6[Tybale] \n Wonderful. Could I ask you a favor while you're here, about Conquort? \n  &5[Sure thing.] \n  &6[Tybale] \n Could you stop by the Galengarde Aboreal Society offices and speak to them about the arrangements for Conquort? They oversee any special interactions with our home tree, and returning Conquort's remains to it has been a bit of a logistical challenge with them involved. \n  &5[I'll get right on it.] \n  &6[Tybale] \n Thank you so much. You're a true friend.  \n&o  C: Speak with the Galengarde Aboreal Society representatives for Primirium Tybale. Table  AlignDefault ColWidthDefault AlignDefault \n Martine \n  Coordinates: [-307 76 -608] \n   &6[Martine] \n Salu! Welcome to the Galengarde Arboreal Society! How might I serve you today? \n  &5[Hi, I was sent by Primirium Tybale. He said there's been some issues with Conquort's funeral?] \n  &6[Martine] \n Oh. Yes. That. You see, we at the Galengarde Arboreal Society have strict laws to follow, even when a member of state is to be interred. \n  &5[So what's causing the issues?] \n  &6[Martine] \n Well, the Galengarde Arboreal Society can't allow one to cultivate the great tree, Chenmai, when the tree is being invaded, now can we? \n  &5[I'm sorry, what do you mean \"being invaded\"?] \n  &6[Martine] \n The Galengarde Arboreal Society has detected multiple Mycelian spies. We're not sure quite where they are, but in the wake of Primirium Conquort's death, the Tree has been sprouting telltale signs of Interceptor Mushrooms. They're watching us. \n  &5[Of course... so, what can I do to help ensure this funeral goes smoothly?] \n  &6[Martine] \n You'll help then? Splendid. The Galengarde Arboreal Society won't forget your generosity. You can track down the implanted spies and weed them out. \n  &5[Just pick them, or do I need a special material?] \n  &6[Martine] \n Any garden variety fungicide should do. The Galengarde Arboreal Society patented one should really do the trick. Here, why don't you take some? \n  &5[Thanks. Now, how do I find these Spyshrooms?] \n  &6[Martine] \n Ooh, Spyshrooms. I'll note that down for the Galengarde Arboreal Society records. That's a great name. As for finding them, we know of three Spyshrooms. There's one on the ground level, one midway up the Tree, and one at the very top. If you get near enough, the fungicide distributor should give you a little ping. \n  &5[I'll get right on it!] \n  &6[Martine] \n The Galengarde Arboreal Society appreciates your efforts!  \n&o  C: Help the Galengarde Aboreal Society by finding the 3 Spyshrooms using the fungicide! If you lost it, Martine will surely have more. \n  Bottom Spyshroom is at [-312 87 -668] \n Middle Spyshroom is at [-326 144 -652] (Right outside library) \n Top Spyshroom is at [-311 183 -649] \n &o  That should be all of the Spyshrooms. Head back to Martine. \n&o  C: Return to Martine with the news. Table  AlignDefault ColWidthDefault AlignDefault \n Martine \n  Coordinates: [-307 76 -608] \n   &6[Martine] \n Welcome back to the Galengarde Arboreal Society. Did you find all the Spyshrooms? \n  &5[I believe so. It was a bit weird though. Are you sure they're spies?] \n  &6[Martine] \n According to all Galengarde Arboreal Society records, no known Mycelia are anything but hostile so... yes. We feel sure. \n  &5[But do YOU feel sure?] \n  &6[Martine] \n I feel that they were a hostile force like all prior known Mycelia. Anyway, the funeral for Primirium Conquort may progress at this time. Thank you for your service to the Galengarde Arboreal Society. May he rest well in the roots of Chenmai. Go and inform his associates that the funeral proceedings will be underway shortly.  \n&o  C: Return to Tybale after having murdered innocent(...?) mushrooms. Table  AlignDefault ColWidthDefault AlignDefault \n Primirium Tybale \n  Coordinates: [-316 182 -672] \n   &6[Tybale] \n Hello again [Player]. How did it go with the weirdos at the Galengarde Arboreal Society? \n  &5[The funeral is cleared to go ahead. There's Mycelian spies sprouting on the tree though. I helped clear some.] \n  &6[Tybale] \n Oh. It's actually serious. Hmm, okay. I didn't expect them to have a good reason this time. With Conquort gone, the Mycelia have been getting bolder. I hope this doesn't spell trouble for the event. Bring your weapons just in case, if you don't mind? \n  &5[I will.] \n  &6[Tybale] \n Excellent. I'll send invitations to your crew down in the market then. We'll be gathering in a few hours. Please speak with the Funeral Organizer at the base of the tree and they'll let you into the chambers.  \n&o  C: Enter the Funeral by speaking to the Organizer at the base of the tree, then speak to Tybale. Table  AlignDefault ColWidthDefault AlignDefault \n Funeral Organizer \n  Coordinates: [-304 78 -625] \n   &6[Funeral Organizer] \n Ah splendid. [Player], with your fellow attendants. Welcome. Please find a seat once inside. Are you ready to enter? \n  &5[I am.] \n  &6[Funeral Organizer] \n It's an honor to have you here.  Table  AlignDefault ColWidthDefault AlignDefault \n Tybale (Funeral) AlignDefault \n  &6[Tybale] \n Welcome [Player]. The ceremony is about to begin. \n  &5[Thank you.] \n  color|gray|An old woman approaches the stand.}} \n {...} \n  &6[Rootchanter Ophelie] \n Hello all, and thank you for gracing this chamber with your presence. Tonight, we honor a leader, fallen in the service of unity. {...} \n  &6[Rootchanter Ophelie] \n While in life, Primirium Conquort oversaw the mobilization of troops and the tactics of war, he was a kind man and respected leader, who's decisive action has helped lead to a future in unity with the Wolfswood. His legacy will be one of peace. His role will not be easy to fill and his spirit will be missed in Galengarde. {...} \n  &6[Rootchanter Ophelie] \n Today, I will be granting him a place eternal in this great city by binding his mortal remains with the great tree that fuels our continued survival. From nothing we all have come, but into something he will be returned. {...} \n  &6[Rootchanter Ophelie] \n Now, I will take his ashes and begin the ceremony that will bind him into the deepest of Chenmai's roots. {...} \n  color|gray|Rootchanter Ophelie begins a complex series of motions as magic begins to swirl. Ashes flow from the nearby urn and glisten in the air before reaching slowly toward the roots. }} \n {...} \n  &6[Rootchanter Ophelie] \n Now, he will lay eternal with the myriad of others who have fallen in service of our great home, Galengarde. Now, let us join hands and-- {...} \n  &6[Alle Abello] \n Ah, hullu, people conn se Galengarde. Please no do paniq, come in peaceful, akku se  \n&o  C: Meet Tybale in his office. Table  AlignDefault ColWidthDefault AlignDefault \n Primirium Tybale \n  Coordinates: [-316 182 -672] \n   &6[Tybale] \n Thank you for calming that down. Let's speak with Alle Abello here. \n  &5[Yes indeed. You say you need help, Alle Abello. What is happening?] \n  &6[Alle Abello] \n Elder no reach out, but Godspore expand. Elder scared of Dichen, but Udake say no. Say they help. With warmonger Conquort gone, Godspore want strike. Destroy Dichen. \n  &5[What's stopping it?] \n  &6[Alle Abello] \n Godspore make combine mind of all Mycelia. It not have Abello and Udake. More power need. We no want. Be alone? Yes. Be part of Godspore attack? No. You help. Come to home. Talk to Elder. Help him fight back. \n  &5[I can come with you and meet with your Elder.] \n  &6[Tybale] \n Excellent, this seems prudent. You're the perfect person to go. While you do that, I'll coordinate with your ally, Bhairavi, in case you need backup. \n  &5[Thanks. Where do I need to go, Alle?] \n  &6[Alle Abello] \n Go caves below Chanterelle. Find Abello village. Talk elder there. You help, yes. Thank.  \n&o  C: Talk to Elder Yuti in the Abello Village in the Crystal Caves. Table  AlignDefault ColWidthDefault AlignDefault \n Elder Yuti \n  Coordinates: [-261 58 -440] \n   &6[Elder Yuti Abello] \n Mmm. Pale one. New face. Ashkii, are you? Or... easterner... what do you want? \n  &5[I'm here to help with the Godspore. Alle Abello sent me.] \n  &6[Elder Yuti Abello] \n Alienahh! Curses on child. She stick her hyphae into business beyond her self. Yet you are here, hnn. Yah. You must know I not want kill Godspore. We trim. Kill edges. Kill Godspore parts. It no die. Don't think it can. But it not use Abello for war. Nor Udake. That is not way we follow. Just need help keep it back. Stop from strike Dichen home too. Both gain, yah? \n  &5[I'm down to help. I understand your desires. Stay safe, but don't kill your God. You don't have to be friends with Galengarde to want peace.] \n  &6[Elder Yuti Abello] \n You right. Now, go get Festering Toxin from Chanterelle high above. Bring to me, I let you in to core, deep, deep deep below. \n  &5[Do I need to do anything special?] \n  &6[Elder Yuti Abello] \n Conquer Chanterelle. Do not burn. Do not destroy. Let them regrow. Just take what we need, come back.  \n&o  C: Retrieve the Festering Toxin by conquering   Link   Chanterelle Village Chanterelle_Village wikilink  , and bring it to Yuti. Table  AlignDefault ColWidthDefault AlignDefault \n Elder Yuti \n  Coordinates: [-261 58 -440] \n   &6[Elder Yuti Abello] \n You return. Have you conquered Chanterelle and found what we need? \n  &5[I've obtained the Toxin.] \n  &6[Elder Yuti Abello] \n Yahh, the Toxin, good. Go down to doorway further down. Alle Abello let you in to the deep, deep, deep place. Speak if you wish to be transported.  \n&o  C: Enter the Godspore's Domain, and speak to Alle Abello. Elder Yuti Abello may teleport you there. Table  AlignDefault ColWidthDefault AlignDefault \n Alle Abello ( Link   Godspore Godspore wikilink Lobby) AlignDefault \n  &6[Alle Abello] \n Bonnet, asi [Player]! You come help kill God? Yahh, yes. You have key to ancient place. The coremounds, spore-fill caverns. Perhaps it time to battle. \n  &5[I'll get right on it.] \n  &6[Alle Abello] \n You save Abello and Udake. You do good for us all.  \n  color|teal|'''SPORETAL COMBAT COMPLETE!'''}} \n  color|teal|Awarded access to [[Godspore]] materials trade, a [[Blighted Catalyst]], and 1 Hyperchromatic Archos Ring.}} ", "reward": "rewards =\n*Awarded access to &3Godspore&r materials trade\n*a &3Blighted Catalyst&r\n* 1 Hyperchromatic Archos Ring\n"}