{"name": "Stablemaster's Request", "information": "prerequisites = None\n NPC: Miane Coords: 208, 101, 8\n Celsian Isles Molta\n", "dialogue": "}} \n&o  Find different horse breeds for Miane's stable. Table  AlignDefault ColWidthDefault AlignDefault \n Miane \n  Coordinates: [208, 101, 8] \n   &6[Miane] \n Howdy! What brings you to these parts?  \n  &5[Just visiting the town for the moment.]  \n  &6[Miane] \n Ah! Well I hope you enjoy your stay! Ol' Miane here knows just about any place in these here parts. \n  &5[This stable seems a bit empty, partner.] \n  &6[Miane] \n Are you mocking my dialect,   &o  partner  ? \n  &5[No, I didn't mean to! I was just trying to say that you seem to be lacking horses.. partner.] \n  &6[Miane] \n Well you'd be right... Say, would you be into helping me gather some horse breeds for here stable?  \n  &5[I've actually got little time at the moment.]  \n  &6[Miane] \n Oh! Well, when you do have time, y'all let me know now! \n  &5[Sure! where should I go?] \n  &6[Miane] \n Alright so, the first breed should be found near the outskirts of this Mesa, southeast of the   Link   Crystal Crown Crystal_Crown wikilink  . At least, that's what my handbook tells me!  \n Talking to her again: Table  AlignDefault ColWidthDefault AlignDefault \n Miane AlignDefault \n  &6[Miane] \n The first horse breed should be near the outskirts of the Mesa just past the   Link   Crystal Crown Crystal_Crown wikilink  ! They like to live fairly high up Bring one back to my stable for me! \n  &5[Where would I get a saddle for the horse?] \n  &6[Miane] \n Oh, of course you'd need that wouldn't ya? Well, my assistant here should be able to help a bit!  \n  Buy one from Trevor at [204, 96, 7]. \n &o  C: [1/2] Follow Miane's directions to the first horse breed in the outskirts of the Mesa, southeast of the   Link   Crystal Crown Crystal_Crown wikilink  . \n&o  C: [2/2] Once you have the horse bring it back to Miane. \n  On the hill at [397, 142, 283]. \n  After bringing back the first breed (Make sure get off it.): \n&o  C: Talk to Miane. Table  AlignDefault ColWidthDefault AlignDefault \n Miane AlignDefault \n  &6[Miane] \n Ah! You've brought back the horse- great work! Now on to the next breed... \n  &5[Where can I find it?] \n  color|grey|She flips through her guide book's pages. \n  &6[Miane] \n These next horses love to live in caverns. I think they should reside somewhere in the Canyonlands, under the   Link   Abandoned Library Abandoned_Library wikilink seems to fit the description!  \n&o  C: [1/2] Follow Miane's directions once more to find the second horse breed in the Canyonlands, in the caverns under the   Link   Abandoned Library Abandoned_Library wikilink  . \n&o  C: [2/2] Once you have the horse bring it back to Miane. \n  Under   Link   Abandoned Library Abandoned_Library wikilink at [-2, 67, 591]. \n  After bringing back the second breed (Make sure get off it.): \n&o  C: Talk to Miane. Table  AlignDefault ColWidthDefault AlignDefault \n Miane AlignDefault \n  &6[Miane] \n Yeehaw! Two down, one to go! The final horse breed, if this book is correct, should reside in an area with large amounts of water. Sounds like the Oasis to me! It also mentions a spring sandwiched between the   Link   Charred Arcanery Charred_Arcanery wikilink and   Link   Palm Tree Paradise Palm_Tree_Paradise wikilink  . \n  &5[Okay, I'll head there next!] \n  &6[Miane] \n Alrighty!  \n&o  C: [1/2] Follow Miane's directions once last time to find the final horse breed in the Oasis, near a spring sandwiched between the   Link   Charred Arcanery Charred_Arcanery wikilink and   Link   Palm Tree Paradise Palm_Tree_Paradise wikilink  . \n&o  C: [2/2] Once you have the horse bring it back to Miane. \n  [-1, 100, 939]. \n  After bringing back the final breed (Make sure get off it.): \n&o  C: Talk to Miane. Table  AlignDefault ColWidthDefault AlignDefault \n Miane AlignDefault \n  &6[Miane] \n You've done it! Now my stables are full of life once more! I can't thank you enough! \n  color|grey|Her face lights up! \n  &5[You are most very welcome! Now, how about a reward?] \n  &6[Miane] \n Ah yes! Here, take this. I believe it should cover your troubles! Take care partner!  \n  color|teal|'''STABLEMASTER'S REQUEST COMPLETE!''' \n  color|teal|Awarded [[Stablemaster's Prod]] and 20 Compressed Crystalline Shards! ", "reward": "rewards =\n*&3Stablemaster's Prod&r\n*20 Compressed Crystalline Shards\n"}