{"name": "Starrier Night", "information": "prerequisites = &3Starry Night&r\n NPC: Montana Coords: 728, 106, 421\n King's Valley Lowtide\n", "dialogue": "}} \n  WorkInProgress|Missing Mayleen dia. for [Got it. I'll get to work.] and branches asking about Gaius. Final Montana choice is missing a branch. Gaius has different dialogue based on Bandit troubles. (only got the Bad route) (The whole other route with Gaius where you listen in and break his telescope)}} Table  AlignDefault ColWidthDefault AlignDefault \n Montana \n  Coordinates: [728, 106, 421] \n   &6[Montana] \n Hello! Welcome to my tree fort, I always wanted a treehouse as a kid and I finally had a chance to make it a reality.  \n  &5[This isn't much of a fort.]  \n  &6[Montana] \n Sadly trees have a weight limit and I was told that I could either have walls or a telescope. Perhaps my choice wasn't the wisest, but it is much more fun. \n  &5[That is a rather large telescope.]  \n  &6[Montana] \n It was my dream model. I have always been a fan of the stars. I have fond memories of looking out of my window for hours every night as a child. I don't know where I would be if I hadn't fallen in love with them. \n  &5[Who are you?]  \n  &6[Montana] \n I'm Montana, I'm a fan of the stars and a dreamer at heart. There isn't all that much about me that is special, I just like to be around the things that I love. Some would call me lazy, but I worked hard to get this far. \n  &5[What do you do for a living?]  \n  &6[Montana] \n Oh you know, things... Like a lot of people do... I'm rather good at doing things. Did you know that things make up nearly the entire natural world? It is quite a difficult job. Lots of paperwork to file. \n  &5[Do you need any help?] \n  &6[Montana] \n Well it is a lot to ask of a stranger, but since you asked... My telescope broke in the move. A glass lens shattered and some of the other lenses are damaged beyond repair. I would get it repaired, but it would take ages for parts to arrive. Would you be wiling to help me?  \n  &5[I can try to help you.]  \n  &6[Montana] \n Wonderful! The only person I know that might have extra parts is an associate of mine in Nyr. Mayleen tends to hang out near her telescope. She shares my love of stars and we have worked together on projects for years.  \n  &5[I helped her fix her telescope recently.]  \n  &6[Montana] \n Wow, so this isn't the first time you have helped fix a telescope? That is oddly convenient. \n  &5[What type of projects?]  \n  &6[Montana] \n Nothing all that special really. In general we have done things since things are quite important. What is that look for? I gave you an answer. Fine... I occasionally do some glass blowing work with them. I'm a bit shy about it since I'm not that good at it. Actually, most of our interactions are glass themed now that I think about it. \n  &5[Do you need a list of parts?] \n  &6[Montana] \n Oh right, you need that don't you? Um, I don't really have any paper on me, but I need a decorative lens, a concave lens, and a convex lens. Mayleen will know what they are so you don't need to worry about the details.  \n  &5[I will head to Nyr as soon as possible.]  \n  &6[Montana] \n Stay safe, the wilderness can be dangerous and your life is more important than my silly dreams. \n  &5[This sounds like a lot of work, maybe later.]  \n  &6[Montana] \n That's a shame. If you get more time I'll be here looking for help. \n  &5[Sadly, I recently forgot how to agree to random requests from strange tree dwellers.]  \n  &6[Montana] \n Oh that's a shame! If you remember how to do that I will most likely still be waiting.  \n&o  Visit Mayleen to see if she can help you assist Montana. Table  AlignDefault ColWidthDefault AlignDefault \n Mayleen \n  Coordinates: [-118, 110, -12] \n   &6[Mayleen] \n Thank you for your help earlier! I can see a great many details now, a great many details indeed. \n  &5[I am glad that I could help, but I need your help this time.] \n  &6[Mayleen] \n What seems to be the problem?  \n  &5[I would like you to tell my fortune.]  \n  &6[Mayleen] \n I am a stargazer, not a fortune teller. While some stargazers believe they can tell the future. I do not have that gift, nor do I particularly believe in such things. I'm sorry I can't be of any help. \n  &5[I forgot what I was here for.]  \n  &6[Mayleen] \n Oh dear that is a problem, but not one I will likely be able to help with. Are you sure you don't remember? \n  &5[Montana needs help repairing her telescope.] \n  &6[Mayleen] \n She moved it to the top of a tree didn't she. I told her she was going to break something, but she wasn't in the mood to listen. Oh well, do you know what parts she needs?  \n  &5[How do you know Montana?]  \n  &6[Mayleen] \n We are old friends. We also do projects together at times. She has always been secretive around new people so I won't go into great detail, but I enjoy working with her even if she is a bit clumsy. We have a lot of paperwork though. \n  Color|purple|[She needs a decorative lens, a concave lens, and a convex lens.] \n  &6[Mayleen] \n I need to stay here, but I can help you find them. There are some lenses in the basement, but I am unsure of the type. The door is locked behind a puzzle that I don't know how to solve, but I know it is similar to my telescope's gearing system.  \n  &5[Got it, I'll get to work.]  \n  &6[Mayleen] \n  &5[You can't get into your own storeroom?]  \n  &6[Mayleen] \n This tower used to be a watchtower long before I got here. I saw some lenses down there when I was given the tour, but I never did work out how to get in there myself. Make all the lights face towards you, and the storeroom should unlock. Come back to me once you get the lens.  \n&o  Go to the basement and find the decorative lens. Remember to face all of the lights towards you. \n Basement is on the Northside of the building. \n  Mayleen Basement Gear puzzle  Plain  press gear array 1 button three times. Plain  press gear array 2 button zero times. Plain  press gear array 3 button two times. Plain  press gear array 4 button one time. \n &o RawInline  Color|teal|You hear a lock opening. You should be able to get into the storeroom. \n&o  Grab the decorative lens from the storeroom of Mayleen's tower and bring it back to Mayleen. Table  AlignDefault ColWidthDefault AlignDefault \n Mayleen AlignDefault \n  &6[Mayleen] \n Good, you have the lens, and more importantly you opened my storeroom for me. Looks like that was a decorative lens, so you still need the functional ones. Before the Blackroot War a lookout tower was built east of Sierhaven. Unfortunately, after a tragedy the tower was abandoned. There might still be some supplies there.  \n  &5[Why would there be telescope parts there?]  \n  &6[Mayleen] \n They put a spyglass at the top in order to spot an advancing army in case Nyr was ever attacked by the Tlaxans. While that spyglass was removed, their extra supplies never were. Spyglasses use materials that are nearly identical to modern telescopes. \n  &5[Why would there be telescope parts there?]  \n  &6[Mayleen] \n The scouts in the tower failed to notice a Tlaxan Shaman approaching Sierhaven. That Tlaxan got into the capital, killed Fluospar, and got out without being caught or spotted. After such failure the tower was hut down for political reasons. \n  &5[Where is the tower?] \n  &6[Mayleen] \n It is right outside of Sierhaven near a few fishing huts. If the plans I saw are to be believed, there is a secured bunker where they kept their extra supplies. Knowing the paranoia of the war they likely hid the entrance, and probably have some sort of lock on the bunker itself. I would check for an underwater entrance. \n  &5[I will head there right away.] \n  &6[Mayleen] \n Hopefully everything she needs is there. I will have to make minor adjustments to anything you manage to find so come back here if you find anything.  \n&o  Head to the   Link   Fishing Huts Fishing_Huts wikilink east of Sierhaven and search underwater around the watchtower for a way into the basement. Make any lights you find face you. \n  Fishing Hut Gear puzzle  Plain  press gear array 1 button two times. Plain  press gear array 2 button two times. Plain  press gear array 3 button three times. Plain  press gear array 4 button three times. \n &o RawInline  Color|teal|You hear a door unlocking. You should be able to get into the bunker. \n&o  Grab the concave lens from the chest in the fishing huts' watchtower's bunker and bring it back to Mayleen. Table  AlignDefault ColWidthDefault AlignDefault \n Mayleen AlignDefault \n  &6[Mayleen] \n I see you found a concave lens. I'll fix that up quickly... There that should work. So you had no luck finding a convex lens? \n  &5[The roof collapsed in on the bunker.] \n  &6[Mayleen] \n So if there are any convex lens they are likely broken... Well that presents a slight problem. However it is possible that we can still get help. I recently spotted a telescope in a tower to the south. They might have extra supplies that could be used. It is a long shot, but might as well ask.  \n  &5[So I need to talk to someone I don't know, that has no reason to help, that could try to kill me, and ask them for help?]  \n  &6[Mayleen] \n Yup! \n  &5[I'll get right on it then!] \n  &6[Mayleen] \n Be careful, I don't know anything about the owner of that telescope. I have a bad feeling about them. If it gets dangerous, leave right away. I don't want to be responsible for your death.  \n&o  Talk to the owner of the tower to the south of Nyr and ask for a convex lens. Header criminal_route_chose_octavius_in_bandit_troubles  Criminal Route (Chose Octavius in Bandit Troubles) Table  AlignDefault ColWidthDefault AlignDefault \n Gaius \n  Coordinates: [-109, 108, 76] \n   &6[Gaius] \n Who are you and why are you here? Nevermind, I really don't care. Leave or I will have to make you leave. \n  &6[Gaius] \n Wait, I think I recall hearing about you from someone. You helped him, didn't you? I am terribly sorry, I thought you were an intruder trying to mess with our plan.  \n  &5[What plan?]  \n  Color|orange|[Gaius] \n You don't need to keep up that bluff here. I'm on your side. I don't know all of the details, but my role is to monitor the guards inside Nyr. I assume others will use that information for something. I had to take steps to make sure that telescope over there couldn't see me, but other than that it has gone smoothly so far. \n  &5[Him?]  \n  Color|orange|[Gaius] \n Yeah, the boss, you worked with him before. \n  &5[I'm trying to find a convex lens for a telescope I am trying to build.] \n  &6[Gaius] \n Ah, so you got put on a similar mission. I have a bunch of spare parts. I don't know what any of them are, but if I have one you can have it. \n&o RawInline  color|teal|You are given a convex lens.  \n&o  You got a lens from Gaius. Bring it back to Mayleen. Talk to Mayleen even if things go wrong. \n As you enter Mayleen's tower: \n  &6[Private Arnie] \n Sorry, gotta check the supplies of everyone who comes into town... Aha! A convex lens! Sorry, gotta take this. Orders are orders. Other lenses are fine though. \n&o  Mayleen will want to hear about this. Go to her and come up with a plan. Table  AlignDefault ColWidthDefault AlignDefault \n Mayleen AlignDefault \n  &6[Mayleen] \n You look upset, did something happen? \n  &5[The guard downstairs is going to be a problem.] \n  &6[Mayleen] \n Things haven't been the same around here since they heightened security. What is it with Nyr guards and telescope parts? Are they trying to build one too? Things just got much more complicated for us, we need to think of something.  \n  &5[I can't think of anything.]  \n  &6[Mayleen] \n I can't think of anything either, we don't even know where it is being kept. \n  &5[Gaius at the other telescope might be able to help.] \n  &6[Mayleen] \n So his name is Gaius? Is he linked to the Nyr armory in some way?  \n  &5[Something like that.]  \n  &6[Mayleen] \n This seems a bit shady, but it is likely the best chance we have at the moment. I trust your judgement, just be careful. \n  &5[They likely know some people there.] \n  &5[They would love to have him.]  \n&o  Your convex lens was confiscated. Go back to Gaius to see if he can offer some assistance. Table  AlignDefault ColWidthDefault AlignDefault \n Gaius AlignDefault \n  &6[Gaius] \n Hope your mission goes well, let me know if I can be of assistance. \n  &5[A Nyr guard isn't allowing me to get where I need to go with the lens.] \n  &6[Gaius] \n Hopefully that wasn't due to my bribe... Well even if it was, I have been talking with some of our type of people in Nyr and might be able to help.  \n  &5[Your bribe?]  \n  Color|orange|[Gaius] \n When I set up base here part of my mission was to go unnoticed by Nyr's security forces. Unfortunately, that telescope in the distance would have been able to see me. So I bribed a guard and got them to follow a \"tip\" to put it out of operation. \n  &5[Our type of people?]  \n  Color|orange|[Gaius] \n Criminals of course. Nyr has a surprisingly large criminal underground. Some really great people. Absolutely horrible people, but great people. \n  &5[Can't you just give me another lens?]  \n  Color|orange|[Gaius] \n I could, but what would stop them from confiscating that one? You need to get one from inside the city so they don't suspect anything. \n  &5[How can you help?] \n  Color|orange|[Gaius] \n I was told by one of my sources that there is a secret passageway into the basement of the armory.  \n  &5[Is it guarded?]  \n  Color|orange|[Gaius] \n Apparently they don't bother guarding it because they think you have to have a key to get down there. Maybe I should go there later as well, could be quite profitable. \n  &5[Why would the lens be there?]  \n  Color|orange|[Gaius] \n The armory recently had a break in. Somehow an item was taken from their \"secure\" contraband storage room. After that they moved new contraband into the basement, which apparently is just as easy to break into. \n  &5[What should I expect to find?]  \n  Color|orange|[Gaius] \n Apparently there is a puzzle down there that serves as a lock on the contraband room. I don't know how to solve it, but they probably have some type of clue down there. \n  &5[How do I get in?] \n  &6[Gaius] \n The way in is marked by a button on the north side of the armory. If you press it hard enough you should be able to enter through the secret entrance. \n  &5[I will head there right away.] \n  &6[Gaius] \n Be careful, if a guard comes in to deposit contraband while you are down there you might be in there for a while.  \n&o  Break into the Nyr Armory basement and see if you can find the convex lens. Remember to not be seen. \n&o RawInline  color|teal|You fall through a hidden trapdoor into the armory's basement.}} \n  Gaius's basement or Nyr's basement puzzle:  Plain  press gear array 1 button three times. Plain  press gear array 2 button five times. Plain  press gear array 3 button three times. Plain  press gear array 4 button two times. Plain  press gear array 5 button one time. \n &o RawInline  color|teal|You hear a lock opening. This is your chance to get the lens. \n&o  You opened the lock in the armory basement! Grab the convex lens and head back to Mayleen. \n As you head into Mayleen's tower: \n  &6[Private Arnie] \n Already checked your gear, so head on in! After all, not like we had any lenses lying around town you could smuggle in. Header lawful_route_chose_the_law_in_bandit_troubles  Lawful Route (Chose the Law in Bandit Troubles) \n Missing Header end_of_quest  End of Quest Table  AlignDefault ColWidthDefault AlignDefault \n Mayleen AlignDefault \n  &6[Mayleen] \n I am relieved that you got back safely. How did it go? \n  &5[I got the lens] \n  &6[Mayleen] \n Marvelous! Let me modify it before any guards come around... Okay that should do it. I suppose all that is left is for you to head back to Montana. Tell her I said hi.  \n&o  You have all three lenses! Bring them back to Montana. Table  AlignDefault ColWidthDefault AlignDefault \n Montana AlignDefault \n  &6[Montana] \n Welcome Back! Have you had any luck finding any of the parts I need?  \n  &5[I had a part but I lost it.]  \n  &6[Montana] \n Oh dear, you can likely find another wherever you originally found it. \n  &5[I found a decorative glass lens.] \n  &6[Montana] \n Nice, I'll install it right away. While it is only decorative it just feels wrong using a telescope without it. \n  &6[Montana] \n Have you found any of the other parts I need? \n  &5[I found a concave lens.] \n  &6[Montana] \n The negative power of this lens should help balance color errors, well it will once paired with a convex lens at least. \n  &6[Montana] \n Any chance you also have the last part I need? \n  &5[I found a convex lens.] \n  &6[Montana] \n I'm positive that this will help counter the negativity of the concave lens. \n  &6[Montana] \n Looks like that is all of them. I already configured the gears while I was waiting for you to get back so everything should be set up now. I can't thank you enough for what you have done for me. I will have to send Mayleen a thank you not as well.  \n  &5[I can deliver it if you want.]  \n  &6[Montana] \n You have already done so much for me, I can at least handle that much. Oh right I prepared a bit of a reward for you while you were gone. I hope you like glowing things. \n  &5[So is there a reward for this?]  \n  &6[Montana] \n Oh wow, how rude of me I completely forgot. I prepared a reward for you while you were gone. I hope you like telescopes as much as me.  \n STARRIER NIGHT COMPLETE! Awarded 32 Concentrated Experience, 192 Spectral Arrows, and a   Link   Midnight Spyglass Midnight_Spyglass wikilink  . \nLink   Category:The Stars Category:The_Stars wikilink ", "reward": "rewards =\n* 32 Concentrated Experience\n* 192 Spectral Arrows\n* &3Midnight Spyglass&r\n"}