{"name": "Starriest Night", "information": "prerequisites = &3Starrier Night&r\n NPC: Maywitch Coords: -1630, 143, -2\n King's Valley Ocean Gate\nPOI: &3Bastion of Spires&r, &3Cloud Piercer&r, and &3Aphelion Isle&r\n", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Maywitch \n  Coordinates: [-1630, 143, -2] \n   &6[Maywitch] \n Well, hello there! I'm quite surprised someone found me in this maze of a city.  \n  &5[Hello. What are you doing up here?]  \n  &6[Maywitch] \n Me? Nothing suspicious, mind you. I'm... stargazing. At least trying to. It's a difficult task, especially when your telescope is all sorts of broken. \n  &5[Your telescope is broken? Mind if I take a look? I have quite a history with these devices.] \n  &6[Maywitch] \n I... wow, yeah, you seem like someone who knows what they're doing. Actually... Plain &o  She gazes towards the sky for a short moment, before looking back at you. She continues with a slight hesitance.. \n  &6[Maywitch] \n I think I wouldn't mind if you help me a little. See, I need calibration tools. Rather unusual calibration tools, found in unusual places.  \n  &5[I'm all ears.]  \n  &6[Maywitch] \n Alright, good. Glad I didn't scare you off. So, first I'll need a Cloudpiercer Fork from   Link   Cloud Piercer Cloud_Piercer wikilink  , then I'll need... Plain &o  A sudden numbness overwhelms you, your vision clouds up, and a sinister sound rings in your head. \n  &6[Maywitch] \n ...Starblight Diagonal from   Link   Bastion of Spires Bastion_of_Spires wikilink  , and an Andromeda Clamp from   Link   Aphelion Isle Aphelion_Isle wikilink  . Those'll be enough.  \n  &5[I... Yes. I got it.]  \n  &6[Maywitch] \n Perfect! You're really helping me out here. I'll be able to stargaze again very soon! \n  color|Purple|[I'm sorry, but I'm not feeling too well... I'll come back later.]  \n  &6[Maywitch] \n Fine... Come back when you feel better, I'll remind you what you need to bring. \n  &5[Unusual places? I have a bad record with those. I'd better stay out of this place.]  \n  &6[Maywitch] \n Alright. Just let me know if you change your mind. \n  &5[I wandered up here by accident, I'll be going now.]  \n  &6[Maywitch] \n Okay then...  \n&o  [1/4]: Find a Cloudpiercer Fork at   Link   Cloud Piercer Cloud_Piercer wikilink  . \n&o  [2/4]: Find a Starblight Diagonal at   Link   Bastion of Spires Bastion_of_Spires wikilink  . \n&o  [3/4]: Find an Andromeda Clamp on   Link   Aphelion Isle Aphelion_Isle wikilink  . \n&o  [4/4]: Once you found all items, return to Maywitch in Oceangate. \n  Cloudpiercer Fork can be found at [-1538, 133, -266]. \n Starblight Diagonal can be found at [-1366, 140, -261]. \n Andromeda Clamp can be found at [-1518, 106, 399]. \n  Maywitch AlignDefault \n  &6[Maywitch] \n You came back, I see. Do you have the tools? \n  &5[I do. They almost cost me my life. I probably even died a couple of times... Here, take them.]] \n  &6[Maywitch] \n At least your sense of humor is still alive and well. Anyway, thanks for bringing these to me. Now, I just need to stitch them together... \n&o  She reaches her hand into her pocket, searching for something. \n  &6[Maywitch] \n Just a moment, please... \n&o  Moments later, she pulls a strange blue adhesive out of her pocket. \n  &6[Maywitch] \n There it is! Now, put some around the base... like that... yes, then another round... \n&o  That clearly is not the way it should look. \n  &6[Maywitch] \n Damn it. I can't do this. I can't leave the telescope either. Sorry, but I must ask for your help again. Please, I need you to go to Orion. He is a... friend of mine, so to speak. Seek out a spire near an abandoned laboratory filled with toxins, he should be at the top.  \n&o  Find Orion at the top of a strange spire-like structure near the   Link   Toxin Lab Toxin_Lab wikilink  . Table  AlignDefault ColWidthDefault AlignDefault \n Orion \n  Coordinates: [-1188, 120, 179] \n   &6[Orion] \n The stars spoke to me again. They said you would come to see me. \n  &5[Uh huh. Right, the stars. I assume the stars also told you why I'm here?] \n  &6[Orion] \n I know why. She sent you, I know that too. Give me the parts, I shall unite them.  \n  &5[This is weird. You're weird. And scary. I'd better go.]  \n  &6[Orion] \n The sky yearns to be set free. You will come back... \n  &5[(Give him the parts)] \n&o  He takes the parts from your hands. With an unbelievable subtlety, he pieces them together, forming a strange device and gives it back to you. \n  &6[Orion] \n Now, go forth and behold the depths.  \n&o  Return to Maywitch with the device. Table  AlignDefault ColWidthDefault AlignDefault \n Maywitch AlignDefault \n  &6[Maywitch] \n Hello! I assume you've visited Orion? \n  &5[That I did. Here's your mechanism, repaired.]] \n&o  She puts the mechanism into a side panel of the telescope. \n  &6[Maywitch] \n Finally! I'm able to stargaze once again! Let me fix it real quick. \n  &5[Is it working?]] \n  &6[Maywitch] \n Yes, indeed! \n&o  She moves over to the telescope and peeks through it. \n  &6[Maywitch] \n And the beacon has been lit. Aurora is close, I can almost feel it. \n  &5[What? Aurora? I... Mind if I look too?]] \n  &6[Maywitch] \n Ugh, yes, I suppose you can, you've helped me after all.. \n  &5[(Look into the telescope)]]  \n  Color|orange|[???] \n Follow the lights. Let your soul embrace the stars, or be forever submerged in an eternal nightmare. \n  Color|orange|[???] \n Let them wander... \n  Color|orange|[???] \n Beyond the realm... \n  Color|orange|[???] \n The skies will open... \n  Color|orange|[???] \n The herald's voice must be heard... \n  Color|orange|[???] \n Embrace the stars... Table  AlignDefault ColWidthDefault AlignDefault \n Maywitch AlignDefault \n  &6[Maywitch] \n You okay there? You look like you've seen something terrifying. \n  &5[What... what happened? What was that?] \n  &6[Maywitch] \n Hm? So you did see something? That's intriguing... Tell me, what did you see? \n  &5[I was here and... I suddenly found myself in a dark place, alone on a small floating isle, surrounded by nothing but boid.] \n  &6[Maywitch] \n That's all? \n  &5[No, I had to walk through the endless nothingness towards a huge temple, and a strange voice echoed in my ears, saying ominous things.] \n  &6[Maywitch] \n What happened then? Did you reach the end? \n  &5[I did. I strangely felt pulled towards a light, and I jumped into it.] \n  &6[Maywitch] \n ange things happen all the time with the stars, [Player]. What matters is what you do with the visions. \n  &6[Maywitch] \n This is... not something to be taken lightly. You need to see it yourself. The beacon has been lit, I can finally see. Head towards its fumes northeast of here, this is a sign [Player] \n&o  She sighs. \n  &5[Where exactly am I heading?] \n  &6[Maywitch] \n A lone isle north-west of Sierhaven. I heard the King sent an expedition there... I don't know what to expect, but stay on your guard.  \n&o  Head towards the strange island in the northern parts of Narsen Sea. Table  AlignDefault ColWidthDefault AlignDefault \n Professor Marl \n  Coordinates: [-1077, 83, -353] \n   &6[Professor Marl] \n Hm... the door looks very old... it seems that this crypt was built way before our expedition to this land... I wonder how long it has been here... \n&o  He seems to ignore your presence. \n  &5[You must be Professor Marl, right?] \n  &6[Professor Marl] \n Why is it still standing with all those bandits around... perhaps it's something else? \n&o  He continues to ignore you. \n  &5[*Snap your fingers to get his attention*] \n  &6[Professor Marl] \n Why is it still standing with all those bandits around... perhaps it's something else?  \n  &5[You're Professor Marl, right?]  \n  &6[Professor Marl] \n That I am! I was born in Sierhaven and studied geology there. For much of my life I traveled across the valley, but that meant putting myself at risk. I eventually retired from field research. For the last five years I have worked in Sierhaven, researching the rocks gathered from the cliffs of the Valley, and helping to train the next generation of geologists. \n  &5[What is this place?]  \n  &6[Professor Marl] \n I'm... not sure. When we arrived here, there was nothing but ruins. We had to set up camp and dig through the collapsed basement. That's how we found the gate. \n  &5[What are you doing here?]  \n  &6[Professor Marl] \n You must have spotted that small tower on the surface, the one with the fire, the diorite beacon? It has been unlit for decades! While on a mission, one of the scouts spotted that fire and reported it to the king. He sent an expedition to figure out what caused the change.  \n  &5[And then you found this door?]  \n  &6[Professor Marl] \n Exactly! Whatever caused the beacon to light up again, must be behind this door. However, it's locked. We can't go through just yet, but I'm sure it's just a matter of time. I'm already developing a solution. \n  &5[I need to get inside somehow. Any ideas?] \n  Color|orange|[Professor Marl] \n I'm afraid I can't be much of a help there, young one. Not only do we not know how to open it, but the King has also given clear orders - do not let anyone inside. \n  &5[Excuse me, Professor, but I really ne--] \n&o  Suddenly, you hear a ringing in your head and a bright light envelops you. After a few moments, you find yourself in a strange room.  \n  &6[???] \n I...   RawInline  color|teal|can... see you... \n  &6[???] \n I... am   RawInline  color|teal|torn... apart... \n  &6[???] \nRawInline  color|teal|Broken... beyond repair... \n  &6[???] \n Sent there...   RawInline  color|teal|From outside... the realm... \n&o  [1/2]: Head towards the strange island in the northern parts of Narsen Sea. \n&o  [2/2]:   RawInline  spoiler|What Lies Beneath.}} \n  &6[???] \n She is seeking to widen the Crack in the Sky and bring the Stars to Land. In their wake, this world will collapse and be no more... \n  &6[???] \n Aurora... \n&o  Return to Maywitch with the Shard of Andromeda. Table  AlignDefault ColWidthDefault AlignDefault \n Maywitch AlignDefault \n  &6[Maywitch] \n Oh, it's you, [Player]. Did you find anything? \n  Color|purple|[I did. I didn't know what happened, but I went to the beacon and then...] \n  &6[Maywitch] \n And then? \n  Color|purple|[...Something strange happened. I found myself in the void again, a giant temple stood before me.] \n  &6[Maywitch] \n A temple? Interesting... \n  Color|purple|[Deep inside that temple, I found a dead comet, and this shard inside of it.] \n  &6[Maywitch] \n Fascinating. I never dreamed of seeing a shard of Andromeda... I am eternally grateful, [Player]. Please, take this. Know, that today you helped the stargazers. The blessing of the stars shall be upon you.  \n STARRIEST NIGHT COMPLETE! Awarded   Link   Stargazer's Hood Stargazer's_Hood wikilink and 32 Concentrated Experience! \nLink   Category:The Stars Category:The_Stars wikilink ", "reward": "rewards =\n* &3Stargazer's Hood&r\n* 32 Concentrated Experience\n"}