{"name": "Starry Night", "information": "prerequisites = None NPC: Mayleen King's Valleytown = Nyrstarting_npc_coordinates = -118, 110, -12POI: None  NPC: Mayleen King's Valleytown = Nyrstarting_npc_coordinates = -118, 110, -12POI: None starting_npc_coordinates = -118, 110, -12POI: None  King's Valleytown = Nyrstarting_npc_coordinates = -118, 110, -12POI: None town = Nyrstarting_npc_coordinates = -118, 110, -12POI: None POI: None ", "dialogue": "}} \n  WorkInProgress|Double check \"Sure, I love telescopes\" branch and full reward maybe}} Table  AlignDefault ColWidthDefault AlignDefault \n Mayleen \n  Coordinates: [-118, 110, -12] \n   Color|Orange|[Mayleen]}} \n Hi, do you have some free time? My telescope has broken and I have need of assistance. Of course, I will be compensating you for your time.  \n  Color|Purple|[Sure, I love telescopes!]}}  \n  Color|Orange|[Mayleen]}} \n Thank you for helping! And here, a fellow lover of the skies deserves these to keep seeing things in the distance! \n  Color|teal|Receive 32 spectral arrows}} \n  Color|Purple|[Sure, I love compensation!]}}  \n  &6[Mayleen] \n Thank you for helping! And here, if it is compensation you like, have an advance. \n  color|teal|Received 16 enchanting bottles  \n  &5[Thank you very much.]  \n  &6[Mayleen] \n Anyway, I am not from around here and so the guard thought I was a spy and took my telescope lens! A man named Ed offered to get it back, but I could not afford his price. He was down in an alley by the river, would you please talk to him and find a way into the armory? \n  Color|Purple|[Some other time.]}}  \n  &6[Mayleen] \n I see. That is most alright. Perhaps I will seek out a Star Acolyte to assist me.  \n&o  [1/3]: Mayleen's telescope lens was taken, but a man named Ed might know a way to get it back. Look for him on the south side of Nyr. \n&o  [2/3]: Use the Thief's Guide: Nyr to find a way into the Nyr Armory. \n&o  [3/3]: Return to Mayleen once you have the lens. \n NOTE: It is optional to buy the Thief's Guide: Nyr from Scarface Ed [-137, 91, -1]. Costs 12 Xp. \n To get into the armory. \n  Press the stone button near the Tavern at at [-124, 96, -116] to open the Armory door. \n  Mayleen AlignDefault \n  &6[Mayleen] \n This is splendid! You got my lens! I will start repairing the main body while you head downstairs to fix the gearing! When all the lights face towards you, the telescope will be ready.  \n&o  Mayleen's telescope just needs to be turned now. Align all the lights in her tower to fix the telescope. Header solution_to_the_gear_puzzle  Solution to the gear puzzle \n   Mayleen AlignDefault \n  &6[Mayleen] \n Thank you so much! I am eternally grateful for your help, I can now get an excellent view of the skies! As was promised, here is your compensation; spend it wisely.  \n STARRY NIGHT COMPLETE! Awarded 96 Enchanting Bottles. ", "reward": "rewards = \n*32 Spectral Arrows or 16 Xp bottles depending on dialogue\n*96 Xp Bottles\n"}