{"name": "Sunken Feeling", "information": "prerequisites = None\n NPC: Cropmaster Afondo Coords: -715, 95, 1439\n Celsian Isles Misport\n", "dialogue": " Table\n Cropmaster Afondo\n  Coordinates: [-715, 95, 1439]\n   &6[Cropmaster Afondo]\n Six hundred and eighty-six thousand gallons... Six months of crops lost... How are we- Oh hello. I didn't see you there.\n  &5[Are you okay?]\n  &6[Cropmaster Afondo]\n Not in the slightest.\n  &5[Hi! How are you?]\n  &6[Cropmaster Afondo]\n TERRIBLE.\n  &6[Cropmaster Afondo]\n We have a saboteur in our midst!\n  &5[A saboteur? Oh no!]\n  &6[Cropmaster Afondo]\n Oh no indeed. (Continues)\n  &5[Oh, that sucks.]\n  &6[Cropmaster Afondo]\n It does! (Continues)\n  &5[Well, good luck dealing with that!]\n  &6[Cropmaster Afondo]\n Luck has nothing to do with this! Useless wanderers.\n  &6[Cropmaster Afondo]\n The farm that feeds Mistport has been completely flooded, and our crops have been ruined!\n  &5[I wish I could help, but I'm rather busy right now.]\n  &6[Cropmaster Afondo]\n No, no, it's fine. It's just the main supply of food for Mistport. I've got this...\n  &5[Can I help?]\n&o  C: Talk to Cropmaster Afondo.\n  &6[Cropmaster Afondo]\n Would you? I don't even know where to begin right now, but any help would be... it would be quite a weight off my back.  Table\n Cropmaster Afondo\n  &6[Cropmaster Afondo]\n I'll need to let you into the flooded farm, but you can't go in with any items. The water will destroy them entirely!\n  &5[Why?]\n  &6[Cropmaster Afondo]\n The fertilizer down there really doesn't like most metals, see. Better safe than sorry, aye.\n  &5[What do I do while I'm down there?]\n  &6[Cropmaster Afondo]\n There are three drains in the Farm that you'll need to find, and see what the damage is. There will also be three chests - they\nwill have specific Coral Dissolvers in them. Whomever SABOTAGED the Farm used coral, so you'll need to use the Dissolvers to\ndestroy the coral and let the Farm drain!\n  &5[What do I do with the Coral Dissolvers?]\n  &6[Cropmaster Afondo]\n Look for a smaller block of coral floating near the drain. That'll be the brain. Use the Coral Dissolver on it and you'll begin\nthe process!\n  &5[Where do I find the drains?]\n  &6[Cropmaster Afondo]\n Along the bottom of the Farm of course. IT's rather large, so be on the look out for some bubble columns to give you air. I've\nalso managed to get some of the protection magic functioning down there, but only near one of the Coral Dissolvers, I think.\nMaybe it'll come in handy if you are moving slow.\n  &5[I'm ready to go!]  Plain  (If you have anything in your inventory)\n  &6[Cropmaster Afondo]\n Well, I'd take you down there, but you've still got stuff on you. Get rid of it and then we'll have a chat, eh?\n  &5[Yes, Cropmaster, Sir.]\n  &6[Cropmaster Afondo]\n Splendid.\n  &6[Cropmaster Afondo]\n Splendid, looks like you're all ready for a trip underwater to help me save this Farm! Any last questions before we go?\n  &5[Remind me again what to do?]\n  &6[Cropmaster Afondo]\n Head inside, into the water. Find Coral Dissolvers for the specific coral you need to dissolve, blocking the three drains. Find\nthe small floating coral, the brain, and use the dissolver on it. Once all three brains have been dissolved, return to me, and\nthe Farm should begin draining.\n  &5[Nope, I'm ready to go.]\n  &6[Cropmaster Afondo]\n Splendid, my friend. Let's get you in there and save this Farm!\n&o  C: Descend into the sunken Farm and find the Coral!\n  horn coral dissolver (-717, 42, 1499)\n horn coral (-729, 26, 1519)\n tube coral dissolver (-717, 42, 1564)\n tube coral (-754, 22, 1536)\n fire coral dissolver (-779, 46, 1509)\n fire coral (-784, 36, 1543)\n  When you go to dissolve the fire coral: Table\n Fire Coral\n  &6[Fire Coral]\n Now listen here, I'm trying to take a nap.\n &5[B-blubbb-AHH\n After dissolving all the coral:\n C:   &o  Tell Afondo the good news. Table\n Cropmaster Afondo\n  &6[Cropmaster Afondo]\n How did it go down there, [Player]?\n  &5[I've got all three coral brains dissolved, Cropmaster, Sir!]\n  &6[Cropmaster Afondo]\n You're very right, you hero, you! The Farm has already begun draining! Now we begin the mystery of the saboteur...\n  &5[Actually, I've got an answer for that one as well.]\n  &6[Cropmaster Afondo]\n Say what now?\n  &5[The Fire Coral blocking a drain down there turned out not to be a Coral at all. It was a trickster Nereid.]\n  &6[Cropmaster Afondo]\n W-WHAT?! HOW DARE THEY! WE HAVE A TREATY WITH THOSE BASTARDS, YOU KNOW THAT? Why, I'll be taking this right up with the Pirate\nCouncil immediately... Crops ruined... gah!\n  &5[At least they're gone now.]\n  &6[Cropmaster Afondo]\n That be true, they are gone. I'm STILL BRINGING THIS UP WITH THE COUNCIL THOUGH. Gah, blasted Nereids. Everyone thinks they're\ngreat, until they run a nasty trick on you. Seriously, [Player]. This is SIX MONTHS of crops wasted.\n  &5[That's a ton.]\n  &6[Cropmaster Afondo]\n YES IT IS. GAH!\n  &5[Just six months?]\n  &6[Cropmaster Afondo]\n JUST SIX MONTHS?! THAT'S DEVASTING! GAH!\n  &6[Cropmaster Afondo]\n ...Well, any who. You did me a massive favor down there, friend. I think it's time I did one back for you. I've got this\nsplendid item I want you to have, as thanks. Additionally, you can come check out the Farm as we recover whenever you like.\nHow's that sound?\n A SUNKEN FEELING COMPLETE! SoftBreak  Awarded a   Link   Shimmerscale Remnant Shimmerscale_Remnant wikilink and access to the\nMistport Farm.\n", "reward": "rewards =\n* &3Shimmerscale Remnant&r\n* Access to the Mistport Farm.\n"}