{"name": "Supply and Demand", "information": "prerequisites = None\n NPC: Buildmaster Jr. Coords: -778, 106, 20\n &3King's Valley&r &3Sierhaven&r\n", "dialogue": "  Quest\n|prerequisites = None\n|starting_npc_name = Buildmaster Jr.\n|region = [[King's Valley]]\n|town = [[Sierhaven]]\n|starting_npc_coordinates = -778, 106, 20\n|rewards =\n* 96 Bottles of Experience\n&o  Help Buildmaster Jr. with a supply package for the neighboring town of Nyr. Table\n Buildmaster Jr.\n  Coordinates: [-778, 106, 20]\n   &6[Buildmaster Jr.]\n Hello there, adventurer. I'm Buildmaster Jr., son of the esteemed Buildmaster, the buildmaster of Sierhaven. Would you be\nwilling to make a delivery for me? You'll be paid, obviously, when you return with the receipt proving the delivery was\nsuccessful!\n  &5[I suppose.]\n  &6[Buildmaster Jr.]\n Lovely! I need you to travel around this beautifully designed capital city of   Link   Sierhaven Sierhaven wikilink - no bias\nof course - and gather a few items for me. There's been some recent bandit attacks around this area, and I'd like to send a\nsupply package to the neighboring town of   Link   Nyr Nyr wikilink  !\n  &5[I'll do it!]\n  &6[Buildmaster jr.]\n Excellent!\n  &5[Maybe later.]\n  &6[Buildmaster Jr.]\n You know where to find me!\n  &5[Maybe later.]\n  &6[Buildmaster Jr.]\n Ah, shame. Well, I'll be here if you change your mind. This delivery isn't gonna make itself!  Table\n Buildmaster jr.\n  &6[Buildmaster Jr.]\n So I've got a little shopping list here. We're going to need 32 glass blocks, 16 arrows, and 5 pieces of cooked chicken. Here's\nsome money to pay for it all, though feel free to keep it if you can gather the items yourself. Let me know when you've got it\nall!\n  &5[Where can I get glass?]\n  &6[Buildmaster Jr.\n East, down the road, inside the workshop. The Block Suppliers sell it. If you check your quest compass, it should point there!\n  &5[Where can I get arrows?]\n  &6[Buildmaster Jr.\n Head west from the town square, then go into the third building on your right. Look for an arrow that is on display in a frame\noutside. If you check check your quest compass, it should point there!\n  &5[Where can I get cooked chicken?]\n  &6[Buildmaster Jr.\n Head west from the town square, then take the second right. Take the right immediately after that and be on the lookout for\nmeat and leather. If you check your quest compass, it should point there!\n&o  C [1/4]: Buy some glass from the   Link   Block Sellers Block_Supplier wikilink  . Coords: [-675, 108, -56]\n&o  C [2/4]: Buy some arrows from the   Link   Rangers Ranger_(NPC) wikilink  . Coords: [-854, 104, 30]\n&o  C [3/4]: Buy some cooked chicken from the   Link   Butchers Butcher wikilink  . Coords: [-819, 103, 22]\n&o  C [4/4]: Once you have all three items, bring them all back to Buildmaster Jr.! Table\n Buildmaster jr.\n  Coordinates: [-778, 106, 20]\n   &6[Buildmaster Jr.]\n Wonderful, that's all the items! Thank you. Now I just need to take a moment to pack it all together, then I can send you on\nyour way.\n  &5[My way?]\n  &6[Buildmaster Jr.\n Of course. I need your courier services as well to transport the package to   Link   Nyr Nyr wikilink  , a little town to the\nEast of   Link   Sierhaven Sierhaven wikilink  . It's quite nearby and you'll be well compensated, as I've mentioned before.\n  &5[Alright then.]\n  &6[Buildmaster Jr.\n Splendid, my friend. Here's your Supply Package. I need you to take it to my friend Pauline. She lives in a very bookish little\nhouse near the Nyr docks. She says she loves being near the Nyr River! She'll take care of the rest and give you a receipt. Come\nback to me when you're done!\n&o  C: Bring the supplies to Pauline in   Link   Nyr Nyr wikilink  . Table\n Pauline\n  Coordinates: [-157, 93, -17]\n   &6[Pauline]\n Wait... Are those the supplies Buildmaster Jr. promised me?\n  &5[They are.]\n  &6[Pauline]\n Amazing! He really pulled through! Here's a signed receipt for him. I know how much he loves being official like that. If\nyou're going to head back to him now, I really suggest taking the     fast travel between here and the capital.\n&o  C [1/2]: It's time to head back. Use the Teleporter Hub in Nyr to quick-travel back to Sierhaven!\n&o  C [2/2]: Once back in Sierhaven, return the receipt to Buildmaster Jr. Table\n Buildmaster jr.\n  Coordinates: [-778, 106, 20]\n   &6[Buildmaster Jr.]\n Well look there! You did it. Thank you so much for your help, friend. You've done a good deed today. As promised, here's your\ncompensation.\n  &6[Buildmaster Jr.]\n Thank you again for your help. If I have more work for you in the future I'll be sure to let you know.\n    Header trivia  Trivia\n When you run nearby Buildmaster Jr. for the first time this dialogue will pop up:\n  &6[Buildmaster Jr.]\n Hey you, adventurer! Yes, you! Come to the Buildmaster's Workshop, to the right of the Jeweler! I need help with a delivery,\nand I'll pay you if you complete it for me!\n", "reward": "rewards =\n* 96 Bottles of Experience\n"}