{"name": "Ten Thousand Bets", "information": " NPC: James (Myriad) Celsian Islestown = Whispervalestarting_npc_coordinates = -1722, 140, -108starting_npc_coordinates = -1722, 140, -108 Celsian Islestown = Whispervalestarting_npc_coordinates = -1722, 140, -108town = Whispervalestarting_npc_coordinates = -1722, 140, -108", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n James (Myriad) \n  Coordinates: [-1722, 140, -108] \n   Color|orange|[Myriad]}} \n Greetings! \n  Color|purple|[Hello! I don't believe we've met. Who are you?]}} \n  Color|orange|[Myriad]}} \n I am known by many names: Myriad, Ender, Alotta, The Myriad- someone even called me \"Apple\" once. I would prefer it if you just called me Myriad though. \n  Color|orange|[Myriad]}} \n Tell me   RawInline   Color|purple|[I gamble constantly.]}}  \n  color|gray|He smirks. \n  Color|orange|[Myriad]}} \n I can't imagine that's gone to well for you without luck like mine! \n  Color|purple|[A bit, but not much.]}}  \n  Color|orange|[Myriad]}} \n Smart. Only someone with luck such as I could make it worthwhile. \n  Color|purple|[Luck like yours? Care to demonstrate?]}} \n  Color|orange|[Myriad]}} \n Sure, we can head to the Casino. Just talk to me when you're ready.  \n&o  C: Go with Myriad to the Casino. Table  AlignDefault ColWidthDefault AlignDefault \n Myriad AlignDefault \n  Color|orange|[Myriad]}} \n Ready to go?  \n  Color|purple|[Not right now.]}}  \n  Color|orange|[Myriad]}} \n Just let me know when! \n  Color|purple|[Sure!]}} \n  Color|gray|He nervously laughs.}} \n  Color|orange|[Myriad]}} \n I guess I'm just... having an off day. \n  Color|orange|[Myriad]}} \n Yeah those two were just a fluke... I'm just.. uh.. let me try again \n  Color|orange|[Myriad]}} \n He- hey. Uh.. now that the machine is uh.. warmed up. How about you give it a try? \n  Color|gray|He hands you a chip.}} \n  Color|orange|[Myriad]}} \n See! I uh- I told you! It's cause I warmed it up. \n  Color|gray|He swipes the gold bar.}} \n  Color|orange|[Myriad]}} \n Oh who am I kidding... \n  Color|gray|He sighs.}} \n  Color|orange|[Myriad]}} \n Take the gold. I don't deserve it. I lost my luck long ago. \n  Color|purple|[Myriad...]}}  \n&o  C: Myriad seems pretty upset, I should go see if he is alright. Table  AlignDefault ColWidthDefault AlignDefault \n Myriad (James) AlignDefault \n  Color|orange|[Myriad]}} \n I don't deserve that name... \n  Color|purple|[Are you alright?]}} \n  Color|orange|[Myriad]}} \n Oh! [Player], you startled me. I would be if I still had my luck. I used to be renowned for it- I would win bets left and right. Ever since my last adventure though, I can't... use it. I've been as unlucky as everybody else.  \n  Color|purple|[You were an adventurer?]}}  \n  Color|orange|[Myraid]}} \n One of the best, and one of the luckiest. \"Dance in fire, bathe in gold\" as I used to say. Those days are behind me however, I've long since lost or broken my equipment. \n  Color|purple|[What happened on your last adventure?]}}  \n  Color|orange|[Myraid]}} \n It got stolen. I didn't believe it when it happened. \n  Color|purple|[I'm sure you're still famous, Myriad.]}}  \n  Color|orange|[James]}} \n Not really, I've lost most of my fortune and popularity ever since I lost my luck, and stop calling me that stupid name. My name is James. Plain, old, boring, James.  \n  Color|purple|[Alright \"Apple\", what can I do to help?]}}  \n  color|grey|He looks at you, saddened and upset. He goes back to watering flowers. \n  Color|purple|[Is there anything I can do to help?]}} \n  color|gray|He looks back and forth between you and the direction of the Casino. \n  Color|orange|[James]}} \n Well, I lost my chestplate in a bet with the Casino owner a long time ago. I would love to get that back.  \n  Color|purple|[That sounds illegal, I'm going to have to pass.]}}  \n  Color|orange|[James]}} \n Oh ok, nevermind then. \n  Color|purple|[I'll see what I can do.]}} \n  Color|gray|He hands you a intriguing looking casino chip.}} \n  Color|orange|[James]}} \n Try looking around the Casino. The bouncer's got to be guarding something.  \n&o  C: Myriad said the bouncer in the Casino was guarding \"something\" I should investigate. \n  The bouncer is guarding the painting. Go through the painting. \n  Link   Puzzle Solutions Guide/Ten Thousand Bets Puzzle_Solutions_Guide/Ten_Thousand_Bets wikilink \n  Solve the puzzle and retrieve Myriad's Chestplate, then return to Myriad. Table  AlignDefault ColWidthDefault AlignDefault \n Myriad (James) AlignDefault \n  Color|orange|[James]}} \n Hello again. Were you successful? \n  Color|purple|[Sure was, James. (Show and give Chestplate)]}} \n  Color|orange|[Myriad]}} \n Oh my goodness! My chestplate! Thank you so much [Player]! I can't believe it. Please, call me Myriad again. \n  Color|purple|[Glad you're feeling better. So uhm...]}} \n  Color|orange|[Myriad]}} \n Oh yes of course, a reward. I should've known better- I would have asked the same. I'll tell you what, take this key and go use it on my treasure chest upstairs. I'm sure you'll find something up there worth your while. Oh, and I would be happy to make more rigged chips for you- not cheap, of course. I'm still a gambling man.   AlignDefault \n  color|teal|TEN THOUSAND BETS COMPLETE!}} \n  color|teal|Awarded Access to rigged chips from Myriad, and his Safe Key!}}  \n  The safe key is used on a chest in Myraid's upper floor. You need to right click the chest while holding it. \n Link   Category:Quests Category:Quests wikilink ", "reward": "rewards = *Access to Rigged Chips from Myriad\n*Myriad's Chest Key"}