{"name": "The Crystal Connection", "information": "prerequisites = &3Tlaxan Troubles&r, &3A Little Spark&r\n NPC: Macuniloh Coords: 482, 191, -348\n King's Valley Ta'Eldim\n", "dialogue": "}} \n  WorkInProgress|Missing Macuniloh Dialogue for getting crystal, T'Xoc dialogue in Bunker.}} Table  AlignDefault ColWidthDefault AlignDefault \n Macuniloh \n  Coordinates: [482, 191, -348] \n   &6[Macuniloh] \n My apologies for being rude earlier, outsider. I have heard from T'Xoc that you have been a big help. If you use the teleport here, it will take you to what you call \"Fyrrr\", am I saying that right? \n  &5[Is there anywhere else it could take me?] \n  &6[Macuniloh] \n It could, but you would need to be putting a lot of work into it. This teleporter is connected to a crystal deep inside the fallen Velara. \n  &5[Could I connect it to Sierhaven?] \n  &6[Macuniloh] \n What?! No, be silent. T'Xoc would not stand for us to be speaking of this. To him, they are still the enemy. \n  &5[Just to him though?] \n  &6[Macuniloh] \n There are some of us who do not agree the Narsens are still the enemy. Working safely with our neighbors in the swamp could be a benefit, some say... You have connection with their King, yes? Maybe we could forge a connection too?  \n  &5[I'll think about it. Defying T'Xoc seems like a problem.]  \n  &6[Macuniloh] \n I understand. Do what you must. \n  &5[I'd like that.] \n  &6[Macuniloh] \n Then let us being this, [Player]. There is someone from your past you must speak with. \n  &5[Who is that?] \n  &6[Macuniloh] \n Follow the stairs to the East, and look behind the flowers. A path awaits you there.  \n&o  [1/2]: Find the path. \n&o  [2/2]: Follow the path. Table  AlignDefault ColWidthDefault AlignDefault \n T'Lm (Ta'Eldim's Magneta) AlignDefault \n  &6[T'Lm] \n Hello again [Player]. I knew one day we would meet here. You really made sure this place was well lit, I see. \n  &5[T'Lm?] \n  &6[T'Lm] \n It is I, yes. I have been exploring this place since you valiantly conquered it. You came from Eldim, did you not?  \n  &5[Why is Ta'Eldim connected to this place?]  \n  &6[T'Lm] \n It is an ancient site of great power, and Ta'Eldim has long been a nexus, as I'm sure you know. The way here has been long disused since the Plague took over, however. \n  &5[Yeah, Macuniloh sent me to find someone. Is that someone you?] \n  &6[T'Lm] \n It is. I told you we would meet again. There is still work to do for Ta'Eldim. You seek the crystals within Velara. Perhaps it is time I told you more about them. \n  &5[I'm all ears.] \n  &6[T'Lm] \n The crystals gathered within Velara are indeed shards of magic, as I mentioned, but they are more than that. They are remnants of life. Remnants of a spirit of the place they inhabit. Kaul is not the only Genus Loci in this valley, merely the most powerful. Thousands of them rest within Velara, and they provide these crystals in their slumber.  \n  &5[That's... terrifying] \n  &5[That's... amazing.]  \n  &6[T'Lm] \n It is indeed. But I know why you are here. You seek the phasing crystal within Velara yes? To bring it to your allies in Sierhaven and connect two cultures who have stayed separate for generations? \n  &5[TSo what do I need to do here?]  \n  &6[T'Lm] \n You seek the phasing crystal within Velara yes? To bring it to your allies in Sierhaven and connect two cultures who have stayed separate for generations? \n  &5[I do. You seem to not agree.] \n  &6[T'Lm] \n On the contrary. I think it is time. You have proven yourself, and I think the others will too. \n  &5[Where is this phasing crystal?] \n  &6[T'Lm] \n In the depths of Velara, you found a crystal for the ritual. There is another path, heading north instead of south. You must take the crystal, then climb the Tlapilkoyan - the tower - upward. The crystal then must be connected within your capital swiftly. \n  &5[Why swiftly?] \n  &6[T'Lm] \n There are those who seek ways past the magic of Ta'Eldim. An untethered crystal is a risk I hope none will exploit. Claim the crystal, and get it safely to the capital. Now, return to Macuniloh. He waits for you.  \n&o  Return to Macuniloh. Table  AlignDefault ColWidthDefault AlignDefault \n Macuniloh AlignDefault \n  &6[Macuniloh] \n Have you followed the path?  \n  &5[Are you sure this is the right thing to do?]  \n  &6[Macuniloh] \n I am sure. Many others are too. T'Xoc can only be angry for so long. After that, we will have safety. \n  &5[I have. T'Lm told me what I need to do to retrieve the crystal.] \n  &6[Macuniloh] \n This is the way. Before you go, I need your help, however. There is a disturbance at the gates. Speak to the Gatekeeper and see what is going on.  \n  &5[I'll get right on that.]  \n  &6[Macuniloh] \n Thank you. Eldim needs you, outsider. \n  &5[I need to go prepare first.]  \n  &6[Macuniloh] \n Hurry yourself.  \n&o  Talk to the Ta'Eldim Guard. Table  AlignDefault ColWidthDefault AlignDefault \n Ta'Eldim Guard \n  Coordinates: [481, 181, -388] \n   &6[Ta'Eldim Guard] \n Do you hear that? It sounds like there's some commotion going on in that tunnel. Could we be under attack? \n  &5[Sure, I'll go see what's going on.] \n  &6[Ta'Eldim Guard] \n Be safe!  \n At the start of the first wave: \n  &6[Ta'Eldim Guard] \n Sons of the Forest? Already? They're relentless! [Player] hold them off! \n After you beat the first wave: \n  &6[Ta'Eldim Guard] \n These seem a bit stronger! \n After you beat the second wave: \n  &6[Ta'Eldim Guard] \n There's only a few left! Fend them off! \n After you beat the third wave: Table  AlignDefault ColWidthDefault AlignDefault \n Ta'Eldim Guard AlignDefault \n  &6[Ta'Eldim Guard] \n They are gone for now... But I fear this attack has crippled our defenses, and just as we had rebuilt after you helped restore the magic's flow. The Sons have vowed to drive the Tlaxans extinct. This has happened before. T'Xoc does nothing. He is scared of the consequences. \n  &5[Why don't I go talk to him?] \n  &6[Ta'Eldim Guard] \n NO! You cannot. He will just tell you nothing can be done again. It is useless. I have heard whispers you have spoken to T'Lm. He is the way now. \n  &5[So you support Mac too?] \n  &6[Ta'Eldim Guard] \n Of course. We must be protected. The Sons will never relent. You know the path you must walk, do you not? Return to Macuniloh and help this town.  \n&o  Return to Macuniloh now that the sons are defeated. Table  AlignDefault ColWidthDefault AlignDefault \n Macuniloh AlignDefault \n  &6[Macuniloh] \n Sons of the Forest attack again! This is dire, [Player]. T'Xoc cannot hate us now. You must go to Velara and retrieve the crystal immediately. Bring it back to me once you have it.  \n  &5[T'Lm said to bring it right to Sierhaven.]  \n  &6[Macuniloh] \n I need it briefly first. I'll need to better attune it to our modern systems. Ever wonder why this teleporter doesn't take you into Velara correctly? It's not well attuned. Now go, outsider. Be safe. \n  &5[Got it. I'll head there now.]  \n  &6[Macuniloh] \n Go, outsider. Be safe.  \n&o  [1/2]: Head into Velara. \n&o  [2/2]: Once inside Velara, find the crystal. \n After getting the crystal: \n&o  Now that you have the crystal, return to Macuniloh. Table  AlignDefault ColWidthDefault AlignDefault \n Macuniloh AlignDefault \n  &6[Macuniloh] \n Outsider! Is that the crystal I feel? You have done it! \n  &5[I nearly drowned in lava, but I got it.] \n  &6[Macuniloh] \n Now truly terrifying! Now, let me see here... \n  &5[What was that noise?] \n  &6[Macuniloh] \n The alarm... Something's happening. I must be taking you to safety. Come. \n  &5[I'm coming.]  \n&o  Talk to T'Xoc. Table  AlignDefault ColWidthDefault AlignDefault \n T'Xoc (Bunker) AlignDefault \n  &6[T'Xoc] \n I know what you've done, [Player]. All I can ask you is why.  \n  &5[I'm... sorry. I think you're wrong.]  \n  &6[T'Xoc] \n I know you do. Perhaps you are right. Perhaps I am. All I know is what is happening out there. \n  &5[I was convinced this was the right path.]  \n  &6[T'Xoc] \n Perhaps it is. Right now it does not feel like it. All I know is what is happening out there. \n  &6[T'Xoc] \n The Sons of the Forest are in Ta'Eldim. It is theirs. Whatever you have done with Macuniloh and my brother, T'Lm, has allowed them entry into this city. I do not think you meant to bring us harm. T'Lm would never allow that. There are things even he cannot see though. \n  &5[How did they get into the city then?] \n  &6[T'Xoc] \n I am well aware you were after the teleportation crystal connected to this city. I think your taking of it left ours disconnected. I think the Sons of the Forest took advantage of this weakness. \n  &5[What can I do to fix all of this?] \n  &6[T'Xoc] \n Ah, there is the right question to be asking, [Player]. My people are in this bunker, fearful. Their homes are being ransacked by evil. I ask you to go forth, defeat the Warden of the Sons of the Forest, then take your crystal to Sierhaven, as you planned. \n  &5[You're okay with that?] \n  &6[T'Xoc] \n Do I have any other choice, [Player]? Do what I ask, and then I will demand a meeting with your Archmage. Now go, bring your crystal to whomever is in charge of teleporting in Sierhaven. This is your disaster to clean up this time.  \n  &5[I'm ready to do my duty.]  Plain &o  Initiates fight with T'Calin \n  &5[I need time to prepare.]  \n  &6[T'Xoc] \n You best be swift.  \n&o  Head into Ta'Eldim and clean up your mess. \n NOTE: The boss fight that is about to happen is pretty tough solo. The boss [T'Calin] has 512hp. Has 3 different spells and will summon Sons of the Forest throughout the fight. \n The first spell he likes to use is similar to a death beam spell. He will target the player then after a few seconds launch an attack that will deal decent damage twice. If you are fast enough you can dodge it. \n A second spell he will use is charge. \n Starting the fight with T'Calin: \n  &6[T'Calin] \n Thank you for foolishly opening the way into this town, hero. \n T'Calin at 50% hp: \n  &6[T'Calin] \n This cannot be! \n T'Calin defeated: \n  &6[T'Calin] \n I am defeated... Nature will have its revenge. \n  &6[T'Xoc] \n The teleporter to Velara has been reopened! Go now to Cinevra, young here of the Tlaxani. \n&o  Find the mage in charge of Sierhaven's teleporters. Table  AlignDefault ColWidthDefault AlignDefault \n Cinevra AlignDefault \n  &6[Cinevra] \n I sense a strong magic bound to you. A Tlaxan magic, is it?! What's a good little hero doing carrying around Tlaxan magics? \n  &5[I come with a crystal that can link the Narsens to the Tlaxan village of Ta'Eldim] \n  &6[Cinevra] \n Oh, hm, that's amazing and all, but why would a reclusive Tlaxan village want to connect with us? \n  &5[The Sons of the Forest have attacked! They need help.] \n  &6[Cinevra] \n The Sons attacked Tlaxans? That sounds serious. \n  &5[They aren't exactly allies. Look, this is urgent, can you hook this crystal up to the empty teleporter downstairs or not?] \n  &6[Cinevra] \n Oh, of course I can! Just give me just a few moments and I should have it done.  \n  &5[Not to rush you, but this is a life and death situation.]  \n  &6[Cinevra] \n Got it, got it. Let's make this happen now... \n  &5[Take all the time you need.]  \n  &6[Cinevra] \n I sense some sarcasm in your voice. Don't worry, I get it. Let's make this happen now... \n  &5[Did it work?] \n  &6[Cinevra] \n I'd say it worked! Why don't you go give the new teleporter a try? See how your Tlaxan friends are holding up. I ahve to speak to Vargos. We're going to need to have a meeting with the Tlaxans of Ta'Eldim...  \n&o  Return to Ta'Eldim through the brand new teleporter! Then talk to Macuniloh. Table  AlignDefault ColWidthDefault AlignDefault \n Macuniloh AlignDefault \n  &6[Macuniloh] \n Z'Tkik! You scared me, [Player]! Is the teleporter working? \n  &5[I'd say so!] \n  &6[Macuniloh] \n Amazing. I can hardly believe an outsider managed to do all of this. I've spoken extensively to T'Xoc in your absence. \n  &5[...Good news I hope?] \n  &6[Macuniloh] \n I was threatened with exile. \n  &5[Oh.] \n  &6[Macuniloh] \n I was not exiled. I was protected from exile by the appearance of an outsider. \n  &5[Who?] \n  &6[Macuniloh] \n His name was Vargos. They want to meet with you. \n  &5[Oh.] \n  &6[Macuniloh] \n He seemed of importance.  \n  &5[He is. He's the Archmage of Sierhaven.]  \n  &6[Macuniloh] \n Whoa. Well, they are waiting in the bunker for you. Shall I take you there? \n  &5[Eh, he's pretty important I guess.]  \n  &6[Macuniloh] \n I am surprised Sierhaven would send a middle power man. Well, they are waiting in the bunker for you. Shall I take you there? \n  &5[He's a nobody, don't worry about him.]  \n  &6[Macuniloh] \n Why would Sierhaven send a nobody? Well, they are waiting in the bunker for you. Shall I take you there? \n  &5[Yes please.]  \n&o  Speak with T'Xoc. Table  AlignDefault ColWidthDefault AlignDefault \n T'Xoc (Bunker) AlignDefault \n  &6[T'Xoc] \n Hello [Player]. We've been having quite a conversation about you. I knew you were well involved, but you've undergone quite a lot. You and Macuniloh - and T'Lm as well - put this town in a lot of danger. However, after speaking through things with your Archmage here, I think perhaps this linking may truly be of benefit. \n  &5[For real?] \n  &6[T'Xoc] \n For real. I believe you were correct. But you will NEVER mess with the magic of this town again. We cannot risk more attacks on our home. But at least we have the potential for a deep alliance with Sierhaven, unbelievably. He would like to speak with you too.  \n&o  Chat with Vargos. Table  AlignDefault ColWidthDefault AlignDefault \n Vargos (Bunker) AlignDefault \n  &6[Vargos] \n Yes, hello [Player]. You've made quite the name for yourself out here. First you're out working with Bhairavi gathering wool, and now you're forging alliances. Fellow member of the Mage Council, Cinevra, came to me after your hurried approach and sent me here. I'm not sure we've fully worked out a treaty between our two cities yet, but it's early. Thanks to your destructive tendencies, I think we're one step closer to some sort of peace in this realm. The next target should be the Sons of the Forest. \n  &5[I agree.] \n  &6[Vargos] \n You've done... interesting work here. I shall await more news on your work, and work with the rest of the council - and the King too, of course, yes - on the nature of this alliance. T'Xoc has something for you now. Good seeing you again.  \n&o  Warp up with T'Xoc. Table  AlignDefault ColWidthDefault AlignDefault \n T'Xoc (Bunker) AlignDefault \n  &6[T'Xoc] \n I would like to give you something as thanks for cleaning up your mess today. You caused chaos, but you fixed it, and in the end I think we came out stronger for it. \n  &6[T'Xoc] \n All I can say now is thank you for the chance at this alliance. It has more potential than I was willing to believe.  \n THE CRYSTAL CONNECTION COMPLETE! Awarded access to a two-way teleport to and from   Link   Sierhaven Sierhaven wikilink and   Link   Ta'Eldim Ta'Eldim wikilink and   Link   Grace of Ta'Eldim Grace_of_Ta'Eldim wikilink potion. ", "reward": "rewards =\n* Access to two-way teleportation between &3Ta'Eldim&r and &3Sierhaven&r\n* &3Grace of Ta'Eldim&r potion\n"}