{"name": "The Elder's Scrolls", "information": "prerequisites = * &3Unveiled&r\n* &3The Crystal Connection&r\n* &3Malevolent Reverie&r\n NPC: T'Xoc Coords: 473, 196, -355\n King's Valley Ta'Eldim\n", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n T'Xoc \n  Coordinates: [473, 196, -355] \n   &6[T'Xoc] \n Hello [Player]. I sense you have ventured within Ta'Ferna... C'Shura has been here. What can I do for you? \n  &5[How are things going with the connection to Sierhaven?] \n  &6[T'Xoc] \n The connection is stable and the Narsens are offering us support. However, I may have need of you one more time. \n  &5[What can I do?] \n  &6[T'Xoc] \n One of the Elders has gone missing. \n  &5[Could they just have wandered off in the night? I hear cats do that when they get old.] \n  &6[T'Xoc] \n You misunderstand. This is not an elderly cat - or Tlaxan for that matter. The council of Tlaxan Elders are tenured former Shamans, Leaders, and respected heroes. \n  &5[That makes more sense.] \n  &6[T'Xoc] \n We were informed that one, called R'Kitxet, would be coming for a visit right after the city was connected to Sierhaven. Yesterday, I was contacted by R'Tsiv, another elder, asking if we had heard from him. The other Elders are worried he has gone missing. \n  &5[And you want me to go hunting for him?] \n  &6[T'Xoc] \n Well, yes. Will you help us?  \n  &5[Not right now, sorry.] \n  &6[T'Xoc] \n If you become available, please return. \n  &5[Sure, I'm happy to help.] \n  &6[T'Xoc] \n Before you go wandering the Valley searching, I'd like you to go meet with R'Tsiv yourself. I told him I'd be talking to you. Next to the Crafter Building is a sealed doorway. Press the button next to it and you'll be able to enter the Room of Projection. There you must project your spirit through the cosmos to the hidden ho  \n C:   &o  [1/2]: Enter the Room of Projection. \n C:   &o  [2/2]: Approach the cracked mirror. \n After entering the Room of Projection: \n C:   &o  Approach the cracked mirror. \n When you get close to the mirror: \n&o  As you approach the strange mirror, it seems to shatter outward, pulling you inside. \n C:   &o  Guide your soul through the first puzzle. \n  Puzzle Solution: \n Right, Up, LineBreak  Right, Up, LineBreak  Right, Down, LineBreak  Left, Down, LineBreak  Right, Down, LineBreak  Right, Up, LineBreak  Right, Down. \n  After completing the first puzzle: \n C:   &o  Guide your soul through the second puzzle. \n  Puzzle Solution: \n Up, Right, Down, Right, Up, Left, Up, Right, Up, Right, Up, Left, Up, Left. \n  After completing the second puzzle: \n C:   &o  Guide your soul through the third puzzle. \n  Puzzle Solution: \n Up, Right, Up, Right, Up, Left, Down, Right, Down, Right, Down, Right, Up, Left, Up, Right, Up, Left, Down, Left, Up, Right. \n  After completing the third puzzle: \n  &6[R'Tsiv] \n Welcome to Ta'Ksaav, outsider. \n C:   &o  Find and speak to R'Tsiv. Table  AlignDefault ColWidthDefault AlignDefault \n R'Tsiv \n  Coordinates: [433, 167, -651] \n   &6[R'Tsiv] \n Hello. You must be [Player]. You walk a strange path, friend. Outsiders do not dreamwalk to Ta'Ksaav. Yet our friend T'Xoc spoke highly of you. You saved his people. Now you can help me save mine. \n  &5[That's what T'Xoc said. A missing Elder?] \n  &6[R'Tsiv] \n Yes, one of my fellows. There are many of us here in this village.  \n  &5[Where is everyone else?] \n  &6[R'Tsiv] \n ...Can you not see them? How curious... \n  &5[Where are we?] \n  &6[R'Tsiv] \n I am deep in the Jaguar Tooth Mountains, as it is called by the Narsens. You are in Ta'Eldim still, resting in the Shrine of Projection, safely, I hope. Now, on to business. \n  &5[Indeed. What can I do to help?] \n  &6[R'Tsiv] \n As T'Xoc said, a fellow Elder has gone missing. He is called R'Kitxet. He was sent in the wake of the fall of the Verdant Fortress controlled by the brutal Sons of the Forest. I hear you had a hand in this. With knowledge that a fragment of the Darkest God was present, he was to visit Ta'Eldim, then go in search of any lingering power that it had left. \n  &5[But he never arrived in Ta'Eldim.] \n  &6[R'Tsiv] \n I fear R'Kitxet was drawn by the lingering power we feared and found himself ensorcelled by something stronger than he could handle. There has been no sign that his Xkelaq was used to end his own life, which makes us here fearful. \n  &5[What's a Skelack?] \n  &6[R'Tsiv] \n I appreciate your attempt; that is not an easy word. A Xkelaq is a deeply enchanted dagger used by only the Elders. It is tied to the pool before us and can cut through any enchantment or force known to man, but only if the bearer intends to end their own life upon doing so. It is the last escape for an Elder to keep the deepest secrets of the Tlaxan people. \n  &5[So where will I go to find R'Kitxet?] \n  &6[R'Tsiv] \n He was to first travel to Ta'Eldim. Clearly something drew him away. I'd like to you create a Akkotl for me. \n  &5[What's that?] \n  &6[R'Tsiv] \n It is a special food. This will allow me to divine R'Kitxet's path. Perhaps he did as he should and left scrolls behind to follow. Your first step will be gathering wheat and grinding it down in the mill into an infused flour. Next, pull a dream from the lake with a fishing rod and cook them in R'Tanaa's kitchen in her Akkotl Cooking Oven barrel. They will be combined to create the Akkotl. Go forth now.  \n C:   &o  Look for Mountainous Wheat to grind down at the Mill and fish up a dream. Combine them in an Elder's kitchen space, then return to R'Tsiv. \n  To get \"dream\" cast a fishing rod, which you can buy for 16 xp from R'Tsiv, from the fishing dock at [476, 165, -665] and you will immediately be given the item   Link   Figment of Dreaming Figment_of_Dreaming wikilink  , but you need 5 of them. \n   To get   Link   Mountainous Wheat Mountainous_Wheat wikilink it is in a chest at [507, 166, -676]. Then toss it into the mill hopper [516, 180, -658] which is up a ladder behind the mill. The   Link   Ground Flour Ground_Flour wikilink can be retrived from the hopper in the middle of the floor of the mill. [513, 170, -658] \n   Finally goto the house at [439, 170, -623] and right click the barrel inside and to the right [433, 171, -620] to trade 1 Ground Flour and 5 Figment of Dreaming for a   Link   Akkotl Akkotl wikilink  . \n  R'Tsiv AlignDefault \n  &6[R'Tsiv] \n Yes, this Akkotl hits the spot.... Now, give me a moment to let the dreams you captured guide me. \n  &5[Okay.] \n  &6[R'Tsiv] \n&o  Oh... Why would you turn around so close to your goal? Such a mistake my friend... There is no trap here. At least there wasn't meant to be... \n  &5[What is it? Did you see something?] \n  &6[R'Tsiv] \n I did. Outside the city is a small set of ruins. When he reached them, he turned and entered them, leaving the city behind him. You must start at these small ruins. If R'Kitxet did what he was supposed to, he would have left a detailed scroll in his wake. Find it and you may be able to follow in his footsteps. Please, find our fellow Elder. There is much at stake beyond even your understanding. Now, if you step into the fire in the meditation hut, you will return to Ta'Eldim.  \n C:   &o  Leave Ta'Ksaav. \n You can leave by left-clicking on the campfire at [470, 169, -621]. \n After leaving Ta'Ksaav: \n C:   &o  Find a trace of R'Kitxet in the   Link   Tiny Jungle Ruin Tiny_Jungle_Ruin wikilink \n After grabbing the book from the barrel inside Tiny Jungle Ruins: \n C:   &o  Find R'Kitxet's path in the ruins of Ta'Nkuu, the   Link   Crossroad Ruins Crossroad_Ruins wikilink \n After grabbing the book from the barrel inside Crossroad Ruins: \n C:   &o  Follow R'Kitxet's path to the   Link   Inner Sanctum Inner_Sanctum wikilink of the   Link   Verdant Fortress Verdant_Fortress wikilink  . \n After stepping on the pressure plates: \n C:   &o  Talk to your ally Kathryn. Table  AlignDefault ColWidthDefault AlignDefault \n Kathryn \n  Coordinates: [1052, 72, 296] \n   &6[Kathryn] \n Halt! Oh wait, thank the King, it's you [Player]. What are you doing back here? \n  &5[I'm looking for a powerful Tlaxan. Have you seen anyone?] \n  &6[Kathryn] \n Seen? I almost got killed by one. There was something seriously wrong with him. A strange magic was flowing around him. He entered, screaming that he didn’t want to do this, nearly took my head off with an EXPLOSIVE blast of magic, almost took my knee out with an arrow, and then ran into the remnants of the Sanctum. (I need to get his explosives formula...) \n  &5[I need to go after him. That’s R’Kitxet!] \n  &6[Kathryn] \n I mean you really shouldn’t. There’s something dangerous happening inside. That’s why I’ve been setting up here anyway. I wanted to blow this place to hell once I worked out how to make like, UltraTNT or something. \n  &5[There already WAS something dangerous happening inside. I handled it.] \n  &6[Kathryn] \n No, you don’t understand. After you beat up the Sons and the Masked guy in there and vanished, the whole place... warped. I don’t think anyone should go in there, especially not you. \n  &5[I have to. This is very important to the Tlaxans. I’ll be extra safe.] \n  &6[Kathryn] \n I... Okay. Fine. I don’t like this, but I also trust you. There's a weird dampening magic over the area again. I imagine you'll need to break more crystals - but you risk angering Kaul again! You'll also need to destroy as many spawners as you can if you want to really proceed. Good luck. Don’t get killed. \n  &5[If you insist!] \n  &6[Kathryn] \n I just want you to know I feel some really oppressive magic in there. Go stop it.  \n THE ELDER'S SCROLLS COMPLETE! SoftBreak  Awarded access to the   Link   Verdant Remnants Verdant_Remnants wikilink ike and a   Link   Verdant Remnants Key Verdant_Remnants_Key wikilink  . ", "reward": "rewards =\n* &3Verdant Remnants Key&r\n* Access to &3Verdant Remnants&r\n"}