{"name": "The Wizard's Apprentice", "information": "prerequisites = &3An Alcoholic Accord&r NPC: Izzy Celsian Islestown = Mistportstarting_npc_coordinates = -738, 83, 1334rewards = *&3Vargos' Old Wand&r}} Table     \n Izzy  \n mediawiki {{Color NPC: Izzy Celsian Islestown = Mistportstarting_npc_coordinates = -738, 83, 1334rewards = *&3Vargos' Old Wand&r}} Table     \n Izzy  \n mediawiki {{Colorstarting_npc_coordinates = -738, 83, 1334rewards = *&3Vargos' Old Wand&r}} Table     \n Izzy  \n mediawiki {{Color Celsian Islestown = Mistportstarting_npc_coordinates = -738, 83, 1334rewards = *&3Vargos' Old Wand&r}} Table     \n Izzy  \n mediawiki {{Colortown = Mistportstarting_npc_coordinates = -738, 83, 1334rewards = *&3Vargos' Old Wand&r}} Table     \n Izzy  \n mediawiki {{Color", "dialogue": " Table\n Izzy\n  Color|orange|[Izzy]\n Oh no,      Color|purple|[Alright. I'll go upstairs.]\n&o  Return to Izzy with the items you found at the crime scene. Table\n Izzy\n  Color|orange|[Izzy]\n ... I told you that you weren't going to like it.\n  Color|purple|[How did this happen? Who killed Vargos' apprentice?]\n  Color|orange|[Izzy]\n Both perfectly valid questions that... that I wish I knew the answers to. Did you see anything up there that looked like it\ncould be evidence?\n  Color|purple|[These were next to the body... Do you know what they are?]\n  Color|orange|[Izzy]\n Oh my... This could complicate things quite a bit...\n  Color|gray|Izzy takes the items you found, and examines them.\n  Color|purple|[What's the matter?]\n  Color|orange|[Izzy]\n Okay, focus... \n  Color|orange|[Izzy]\n Each of these are items that come from the upper echelons of the Celsian governments. A seal from the Pharaoh of Ishnir, and a\ntotem from the Church of Chillwind... If Vargos' apprentice got himself on the wrong foot with either of these entities, we\nmight be out of luck.\n  Color|purple|[So what do we do?]\n  Color|orange|[Izzy]\n Well for starters, we are going to need some evidence. While these items may seem incriminating, I highly doubt the two\ngovernments would have put aside their differences just to kill a young man from the Valley. It's more than likely that only one\nis responsible, and one is being framed.\n  Color|purple|[Sounds like it's time for an investigation.]\n  Color|orange|[Izzy]\n Indeed. I suggest that we put our focus on one kingdom at a time, however- which one do you think we should look into first?\n  Color|purple|[The Ishnir Empire.]\n  Color|purple|[The Church of Chillwind.]\n You have a choice to pick either the Ishnir Empire or the Church of Chillwind. Header the_ishnir_empire_route  The Ishnir\nEmpire Route Table\n [Izzy] Very well then: we shall look into the Pharaoh's involvement first. If you wish to switch who we are investigating, you\ncan talk to me later.\n [Izzy] Now, the closest information we might be able to get on this Seal without looking too suspicious is with one of his\nScribes. One can likely be found in the palace in Alnera, the capital city of Ishnir.\n&o  Seek out Scribe Shadah in Alnera's palace. Table\n Scribe Shadah\n  Color|orange|[Scribe Shadah]\n Good day to you. Sorry, I don't have too much time to talk right now- the Pharaoh has quite a few orders that need to be\nwritten and sent out. If you don't have anything imperative to ask me, I'm going to need to ask you to return later.\n  Color|purple|[Actually, I was looking to ask you about the Seal of the Pharaoh.]\n  Color|orange|[Scribe Shadah]\n Um, okay? What about it?\n  Color|purple|[What are they used for?]\n  Color|orange|[Scribe Shadah]\n Every record that we lower scribes produce must be reviewed by Head Scribe Rava; she ensures that all the words written are\ntrue to the wishes of the Pharaoh. When approved, they are taken to the records chamber to be given the Seal.\n  Color|purple|[Could I go into the records chamber?]\n  Color|orange|[Scribe Shadah]\n Absolutely not. Access is forbidden to everyone, save the Pharaoh and Head Scribe Rava.\n  Color|gray|Shadah looks over towards the record's chamber nervously. You definitely need to find a way in there.\n&o  Enter the Sealed Record's chamber and see if you can find a way inside.\n Solve the puzzle to unlock the chamber.\n&o  Approach Head Guard Obadiah about the book you discovered in the record's chamber Table\n&o  Head Guard Obadiah\n  Color|orange|[Head Guard Obadiah]\n The palace may be open to the public, but it's not a place for dilly-dallying. Keep moving.\n  Color|purple|[Actually, I needed to discuss the death of a young man in Mistport with you.]\n  Color|orange|[Head Guard Obadiah]\n Eh? Why would I know anything about something like that? When do you think the last time I went there was?\n  Color|purple|[Care to explain this unsealed note from you inside the record's chamber?]\n  Color|orange|[Head Guard Obadiah] What the- How did you get that?\n  Color|purple|[So you admit it then.]\n  Color|orange|[Head Guard Obadiah]\n Wha- ugh, no. Listen, I don't know anything about a death. I was getting out of a bad situation with that demon Xeno; I've been\nstuck under his thumb for too long. I cut ties with them- all of them.\n  Color|purple|[Can you at least tell me what you know?]\n  Color|orange|[Head Guard Obadiah]\n All I did was assist in smuggling his supplies into the city. The supplies are held in a bunker in Rahkeri until they are ready\nfor transport, so if you are looking for any lead on Xeno's men, you should likely start there.\n&o  Search out the entrance to a supply bunker in Rahkeri owned by Xeno's men. Table\n Crewman of Xeno\n  Color|orange|[Crewman of Xeno]\n ...And that be the cap'in's plan. That be why it was so important fer' us to get that seal from Obadiah; now that he's quit, he\nbe a dead man.\n  Color|orange|[Crewman of Xeno]\n Wait, who be this lubber? Get out o' our bunker!\n&o  Return to Izzy with the information you found on the investigation. Table\n Izzy\n  Color|orange|[Izzy]\n Welcome back      Color|purple|[I learned the truth about the death of Vargos' apprentice.]\n  Color|orange|[Izzy]\n Oh? Do tell.\n  Color|purple|[Xeno hired a man in Alnera to steal the Seal and frame Ishnir. He's behind this.]\n  Color|orange|[Izzy]\n What?! What could Xeno be up to here? Is he trying to start a war between the Valley and the Isles? We need to find more\ninformation on what his endgame is here. Try sneaking aboard his ships on the dock and see if you can find anything.\n&o  1/2 - Sneak onto Xeno's ship and see if you can find anything of note.\n&o  2/2 - Return to Izzy with anything you find. Header the_church_of_chillwind_route  The Church of Chillwind Route Table\n  Color|orange|[Izzy]\n Very well then, we shall look into the Church of Chillwind and the Queen's involvement first. If you wish to switch who we are\ninvestigating, you can talk to me later.\n  Color|orange|[Izzy]\n Now, the closest information we might be able to get on this Totem without looking too suspicious is with one of lower members\nof the Church, such as a Deacon. One can likely be found in the cathedral in Frostgate, the capital city of the Chillwind.\n&o  Seek out Deacon Duncan in Frostgate's cathedral Table\n Deacon Duncan\n  Color|orange|[Deacon Duncan]\n Oh lord, who sits on high, we beg thee for thy mercy...\n  Color|gray|He seems to be very deep in prayer.\n  Color|purple|[Um, excuse me... Do you have a moment?]\n  Color|orange|[Deacon Duncan]\n Huh? Oh, welcome child. How can I be of service to you and your place in life today?\n  Color|purple|[I was looking to ask you about a Holy Totem.]\n  Color|orange|[Deacon Duncan]\n What of them?\n  Color|purple|[Could you tell me about what they are used for?]\n  Color|orange|[Deacon Duncan]\n Yes, well-\n  Color|gray|A loud shriek comes from the back of the building, interrupting Deacon Duncan.\n  Color|orange|[Deacon Duncan]\n Oh no, not again... My child, I must ask you for a favor. Could you go down to the catacombs below the cathedral and take care\nof the undead whoever-it-is this time? I will talk to you more about the Totem later.\n  Color|purple|[You are making this sound like it's a normal occurrence.]\n  Color|orange|[Deacon Duncan]\n Far more frequent than I care to admit. As a word of advice: never perform an exorcism on a poultrygeist. You will never live\nit down.\n&o  Defeat the undeads in the catacombs and return to Deacon Duncan Table\n Deacon Duncan\n  Color|orange|[Deacon Duncan]\n Oh lord, who sits on high, we beg thee for thy mercy...\n  Color|gray|He seems to be very deep in prayer.\n  Color|purple|[Are you... already praying again?]\n  Color|orange|[Deacon Duncan]\n Yes, well, a servant of the lord is always in prayer. I assume the undead creatures have been taken care of?\n  Color|purple|[They are.]\n  Color|orange|[Deacon Duncan]\n Fantastic. Now what were we speaking of?\n  Color|purple|[The Holy Totem.]\n  Color|orange|[Deacon Duncan]\n Ah, right. The Holy Chillwind Totems are possessions of the Holy Royal Advisor, Ridnan. As he travels the land, gaining\nexperience in order to better service the Queen, he leaves them behind as blessings to the places he visits. They are mementos,\nif nothing else. If you have any specific questions about them, you could ask him directly. He's usually over in the castle,\ngiving advice to the Queen.\n&o  Talk to Royal Advisor Ridnan Table\n Royal Advisor Ridnan\n  Color|orange|[Royal Advisor Ridnan]\n Hello there, young one. Beautiful day in the tundra, is it not?\n  Color|purple|[Who are you?]\n  Color|purple|[Actually, I needed to discuss the death of a young man in Mistport with you.]\n  Color|orange|[Royal Advisor Ridnan]\n Oh my, that sounds horrid. Though, I know nothing of Mistport- I have not traveled to that region in many years.\n  Color|purple|[Care to explain why one of your Totems was found with the man's body then?]\n  Color|orange|[Royal Advisor Ridnan]\n I'm sorry? Surely you must be mistaken. I just arrived back into town yesterday after a long journey from Nightroost. If you\nare searching for an alibi, you may go there and search near the Royal Reserve. There, you will truly see one of my totems as a\nsign that I was there.\n&o  Follow up on Ridnan's alibi at the Royal Reserve in Nightroost. Table\n Reserve Clerk\n  Color|orange|[Reserve Clerk]\n Hello! Welcome to the Royal Reserve! If you ever need to pay the Holy Tax, you can come speak with me.\n  Color|purple|[I don't think I want to give you my money...]\n  Color|purple|[Can anyone go down to the lower floors?]\n  Color|orange|[Reserve Clerk]\n You're more than welcome to try, but good luck getting past the vault. We have some of the highest security money can buy.\n Solve the puzzle to unlock the reserve vault.\n&o  Return to Izzy with the information you found on the investigation. Table\n Izzy\n  Color|orange|[Izzy]\n Welcome back      Color|purple|[I learned the truth about the death of Vargos' apprentice.]\n  Color|orange|[Izzy]\n Oh? Do tell.\n  Color|purple|[Xeno hired a man in Nightroost to steal the Totem and frame Chillwind. He's behind this.]\n  Color|orange|[Izzy]\n What?! What could Xeno be up to here? Is he trying to start a war between the Valley and the Isles? We need to find more\ninformation on what his endgame is here. Try sneaking aboard his ships on the dock and see if you can find anything.\n&o  1/2 - Sneak onto Xeno's ship and see if you can find anything of note.\n&o  2/2 - Return to Izzy with anything you find. Header after_investigations  After Investigations Table\n Izzy\n  Color|orange|[Izzy]\n Did you find anything?\n  Color|purple|[I only found this, whatever it is.]\n  Color|gray|Izzy takes the crystal and examines it a bit.\n  Color|orange|[Izzy]\n What even is this thing? This was on his ship?\n  Color|purple|[It was in his captain's quarters, yes.]\n  Color|gray|Izzy taps on the crystal gently.\n  Color|orange|[Izzy]\n Uh, what's happening?\n  Color|orange|[Izzy]\n This can't be good...\n  Color|orange|[Xeno]\n The sea... Isn't it beautiful from here? My own personal cove.\n  Color|orange|[Masked Saboteur]\n Cut the small talk, Xeno. I know you didn't call me here just to watch the waves.\n  Color|orange|[Xeno]\n No, I suppose not. I simply wanted to inform you that the deed is done. That wizard's little boy is gone, and all signs lead to\nthe kingdoms.\n  Color|orange|[Masked Saboteur]\n And that usurper,      Color|orange|[Xeno]\n That's less of my concern, and more of yours. If      Color|orange|[Izzy]\n Well that was... definitely something.\n  Color|purple|[I think that confirms our suspicions.]\n  Color|orange|[Izzy]\n Definitely. Xeno is plotting something, and we need to figure out what.\n  Color|purple|[What do we do now?]\n  Color|orange|[Izzy]\n My plan is to get this crystal into working order. If we can properly use it, it could help us get more insight into what he's\nup to. It's going to take some time though.\n THE WIZARD'S APPRENTICE COMPLETE! SoftBreak  Awarded   Link   Vargos' Old Wand Vargos'_Old_Wand wikilink\nLink   Category:Quests Category:Quests wikilink\n", "reward": "rewards = *&3Vargos' Old Wand&r Table     \n Izzy  \n mediawiki {{Color|orange|[Izzy]"}