{"name": "The Lost Empire", "information": "prerequisites = &3The Wizard's Apprentice&r NPC: Historian Rhodes Celsian Islestown = Mistportstarting_npc_coordinates = -756, 83, 1346rewards = *&3Salazar's FollyLime&r Key\n*&3Seadiver's Shell&r\n*Access to &3Salazar's Folly NPC: Historian Rhodes Celsian Islestown = Mistportstarting_npc_coordinates = -756, 83, 1346rewards = *&3Salazar's FollyLime&r Key\n*&3Seadiver's Shell&r\n*Access to &3Salazar's Follystarting_npc_coordinates = -756, 83, 1346rewards = *&3Salazar's FollyLime&r Key\n*&3Seadiver's Shell&r\n*Access to &3Salazar's Folly Celsian Islestown = Mistportstarting_npc_coordinates = -756, 83, 1346rewards = *&3Salazar's FollyLime&r Key\n*&3Seadiver's Shell&r\n*Access to &3Salazar's Follytown = Mistportstarting_npc_coordinates = -756, 83, 1346rewards = *&3Salazar's FollyLime&r Key\n*&3Seadiver's Shell&r\n*Access to &3Salazar's Folly", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Historian Rhodes AlignDefault \n  Color|orange|[Historian Rhodes]}} \n You're the adventurer from King's Valley, right? \n  Color|purple|[That's me!]}} \n  Color|purple|[Arrgh no I be a pirate arrgh.]}} \n  Color|orange|[Historian Rhodes]}} \n Wonderful! You're just the person I've been looking for. Izzy has told me that you're much more civilized than these pirate-y folk. \n  Color|purple|[You know Izzy?]}} \n  Color|orange|[Historian Rhodes]}} \n That I do! Izzy is just across the way after all- he seems to share a love of research that these otherwise vile pirates tend not to have. To the matter at hand though- tell me, have you heard of the Viridian Empire? \n  Color|purple|[Of course I have.]}} \n  Color|purple|[No, I haven't.]}} \n  Color|orange|[Historian Rhodes]}} \n Perfect- then you know that remnants of it are scattered about these isles... and I think that there may be something to unearth below our very feet! So, tell me: would you like to go on an adventure with me to find it? \n  Color|purple|[Count me in.]}} \n  Color|purple|[My quest compass is pretty full right now, so I'll come back later.]}} \n  Color|orange|[Historian Rhodes]}} \n Brilliant! We'd best get moving then. I'll need to gather some supplies, but you can get a head start by exploring the sewers for a way into the empire ruins. Izzy tells me a crewman of yours has been setting up camp down there; go check if he's seen anything.  \n&o  Search out Samwell in the sewers. Table  AlignDefault ColWidthDefault AlignDefault \n Samwell AlignDefault \n  Color|orange|[Samwell]}} \n Hi   RawInline   Color|purple|[Have you seen any hints of some old ruins down here?]}} \n  Color|orange|[Samwell]}} \n Ruins? In the sewers? Are you finally going on an adventure for treasure?! \n  Color|purple|[There will probably be treasure.]}} \n  Color|purple|[I don't think there will be any treasure.]}} \n  Color|orange|[Samwell]}} \n FINALLY! Yeah, I saw something suspicious down this tunnel: an odd sort of whirlpool that goes down into a lit room. If you're brave enough to jump in, I'll follow you.  \n&o  Head into the deeper parts of the sewers and search out an entrance to the old ruins. Table  AlignDefault ColWidthDefault AlignDefault \n Historian Rhodes AlignDefault \n  Color|orange|[Historian Rhodes]}} \n Well done finding this place! You've already proven your value on this team. That room over there looks packed to the brim with books and knowledge- we just need to get in.  \n Solve the puzzle to access the room. \n   :Puzzle Solutions Guide/The Lost Empire}} \n   Color|orange|[Historian Rhodes]}} \n This is amazing! Look at all of this knowledge collected in one place. We can learn so much about the Viridian Empire from it. \n  Color|orange|[Samwell]}} \n And look at all of this treasure! All of the gold. Finally; we'll be rich! \n  Color|orange|[Historian Rhodes]}} \n This chart here is quite interesting. It almost looks like... I think this is a map to the capital city of the empire! \n  Color|orange|[Samwell]}} \n More treaure you say? Well, might as well take as much as we can from here before we set off for the capital. \n  Color|gray|Samwell starts pocketing some of the treasures in the room.}} \n  Color|red|INTRUDERS DETECTED! BARRIERS REACTIVATED!}} \n  Color|orange|[Historian Rhodes]}} \n SAMWELL, WHAT DID YOU DO?! \n  Color|orange|[First Mate Jones]}} \n Arrgh finally someone 'as managed to open this thing. We were startin' to think we would 'ave to blow the whole town up to get in. \n  Color|orange|[Historian Rhodes]}} \n Blasted pirates. I should've known you would swoop in as soon as I found something. \n  Color|orange|[First Mate Jones]}} \n Well, from what I overheard earlier, it sounds like this is only the tip of the iceberg. I'll tell you what: we'll get you out of there if you bring us to this Viridian capital. Deal? \n  Color|orange|[Historian Rhodes]}} \n It's not like we have much of a choice. Deal. \n  Color|orange|[First Mate Jones]}} \n Xeno will love this. Speak with me by our little expedition vessel and we'll set sail for the treasure trove. Yarharharg! \n  Color|orange|[Samwell]}} \n This is beyond frustrating. I left my comfy life in Nyr with the promise of gold and riches, but every time we end up with nothing. We'd better find a way to make this next adventure worth it.  \n&o  Find First Mate Jones's ship and talk to Jones. Table  AlignDefault ColWidthDefault AlignDefault \n First Mate Jones AlignDefault \n  Color|orange|[First Mate Jones]}} \n Finally, ye 'ave shown up- I was about to send some men to bring ye here. Well, let's not dilly-dally- are ye ready to set sail to find a mountain of treasure? This ain't be a charity: ye will have to make your way back there yeself if you run away. \n  Color|purple|[Let's get this over with.]}} \n  Color|orange|[First Mate Jones]}} \n Arrgh. \n  Color|orange|[Captain Xeno]}} \n Ahoy   RawInline   Color|purple|[We gave you want you wanted. Let us go.]}} \n  Color|orange|[Captain Xeno]}} \n Let you go? Now why would I want to cut our partnership so short? \n  Color|purple|[Why would we be partners?]}} \n  Color|orange|[Captain Xeno]}} \n I happen to know that there is an ancient relic in the depths of this city- one which you are after. It is the Lime wool. \n  Color|purple|[How do you know there's a wool in there?]}} \n  Color|orange|[Captain Xeno]}} \n Let's just say I have my sources. But never mind that: I've come personally to offer it to you. \n  Color|purple|[What's the catch?]}} \n  Color|orange|[Captain Xeno]}} \n The catch? It's nothing major, I promise you. I simply ask that you pave the way through the city and leave some spoils to us. We're just here for the treasure, nothing more. \n  Color|purple|[That sounds fair. Deal.]}} \n  Color|orange|[Samwell]}} \n Seriously?! You're going to give up the treasure to him for some stupid wool? \n  Color|purple|[We have to. We need to retrieve the wool.]}} \n  Color|orange|[Samwell]}} \n Well if that's your decision, then I'm out. I came here to get rich, not to do what's right. Xeno, do you have any room on your crew for one more? \n  Color|orange|[Captain Xeno]}} \n There's always room for more.  \n Make your way down the Bastian to the dungeon entrance. Table  AlignDefault ColWidthDefault AlignDefault \n Second Mate Gary AlignDefault \n  Color|orange|[Second Mate Gary]}} \n Arrgh ze Captain sayz that ze are to clear ze way for usz in zis dungeon. Ze best take zis here gear and keep movin'.   AlignDefault \n THE LOST EMPIRE COMPLETE! SoftBreak  Awarded a   Link   Lime Salazar's_Folly wikilink Key, a   Link   Seadiver's Shell Seadiver's_Shell wikilink  , and Access to the   Link   Lime Dungeon Salazar's_Folly wikilink Trader.  \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *&3Salazar's Folly|Lime&r Key\n*&3Seadiver's Shell&r\n*Access to &3Salazar's Folly|Lime Dungeon&r Trader"}