{"name": "The Tomb of Time", "information": "prerequisites = * &3Borrowed Time&r\n NPC: Vargos Coords: -740 82 1337\n Celsian Isles Mistport\nDifficulty = Very Hard\nLength = Very Long\n", "dialogue": "}} \n&o  Travel to the cavern under the Silver Tower. Header start_of_quest  Start of Quest Table  AlignDefault ColWidthDefault AlignDefault \n Vargos \n  Coordinates: [-917, 91, -161] \n   &6[Vargos] \n Hello again [Player]. We've had some time to make plans. We all agree, even Bhairavi. Meeting the Crimson King is worth the risk. As long as you're still in.  \n  &5[I'm not yet.]  \n  &6[Vargos] \n Let me know if you change your mind. The Isles are at risk... \n  &5[I am.] \n  &6[Vargos] \n Then it's decided. We'll send an excavation team to the Silver Tower where you said the place collapsed when you found the Silver Knight... Goodness, those words seem wild to say.   RawInline  Color|teal|{...} \n  &6[Bhairavi] \n I'm a bit worried, but we're committed. Another excavation, at last. I think we can help. Zarek? Pten? Why don’t you two accompany [Player]? Pten oversaw our excavation of C'Zanil's tomb, and Zarek is a powerful mage in their own right who can easily help carve debris.   RawInline  Color|teal|{...} \n  &6[Pten] \n I would be honored.   RawInline  Color|teal|{...} \n  &6[Zarek] \n I'm in, ma'am! \n  &5[Alright, let's go see what we can dig up at the Silver Tower.]  \n&o  C: Travel to the collapsed cavern under the Silver Tower. \n After arriving in the cavern: \n&o  C: Talk to your allies. Table  AlignDefault ColWidthDefault AlignDefault \n The Crimson King (First enter cavern) AlignDefault \n  &6[The Crimson King] \nRawInline  color|red|Teal has definitely been here, some time ago. \n  &5[Oh, good. You're here. I wasn't sure if you'd wait for us.] \n  &6[Zarek] \n Whoa! You're more human than I thought you'd be! \n  &5[Hey, that's rude!] \n  &6[The Crimson King] \nRawInline  color|red|They are fine. Hello young human. I am passing as my herald, Jeremiah, at the moment. My true form is far different.   RawInline  Color|teal|{...} \n  &6[Zarek] \n Amazing. Why have you been keeping them from us, [Player]? \n  &5[I've not been, really. There's just been a lot going on.] \n  &6[Pten] \n Let's get moving. This situation makes me quite uncomfortable... \n  &5[Yes, let's. The Knight was up ahead.] \n  &6[The Crimson King] \nRawInline  color|red|Lead the way.  \n&o  C: Continue deeper into the cavern. \n After entering the deeper section: \n&o  C: Discuss the scene with your allies. Table  AlignDefault ColWidthDefault AlignDefault \n Zarek (Deeper cavern / ex-Lime Wool room) AlignDefault \n  &6[Zarek] \n Uh, mates... This doesn't look good at all... \n  &5[What did Teal do?!] \n  &6[The Crimson King] \nRawInline  color|red|This place is... untethered from time. Every way of hurting this Knight imaginable, left at the edge of the Veil itself. Give me a moment. Perhaps I can broker a deal that will set us on a path to justice. \n  &5[Do what you must.] \n  &6[Pten] \n This is horrifying. Such damage in such a beautifully different area. This place looks nothing like the Chillwind I recognize. Truly a much older work. Sorry, the archaeologist in me is coming out... \n  &5[I'm not sure who built it, just that it housed the Lime Wool for a time before Salazar claimed it.] \n  &6[Pten] \n From the limited encounter, this place seems populated by scavengers who claimed artifacts of these Silver Knights. I wonder if they knew what they had.   RawInline  Color|teal|{...} \n  &6[Zarek] \n Somehow, I doubt it. \n  &5[You guys are free to come back once this is all over.] \n  &6[The Crimson King] \nRawInline  color|red|I am sorry to interrupt, but I have reached a deal with Tuulen. She will not be passing through the Veil, even in her torment, but I will be able to help her reorient. In exchange, she has shared where you must go next. \n  &5[Are you not coming?] \n  &6[The Crimson King] \nRawInline  color|red|Not yet. The machine you activated was like a repair station for her, but the collapse left her fragile. Teal didn't help. You have finally given me a chance to find what I need, [Player]! A real Silver Knight. Alive. Perhaps this is it. Perhaps I can go home... but yes, the task at hand. \n  &5[What do we need to know?] \n  &6[The Crimson King] \nRawInline  color|red|The pedestal you seek is in the ruins of Isharist, below the firmament of the Isles. You would know of it. Yeigar was once its emperor. There is a way in, deep in the ocean. A remnant of a Temple that survived the reshaping of the land above. I will direct you there through your compass. It lies to the far south west of the Isles, following an underwater river that passes near the Shrine of Summer. If I am able, I will meet you there when I am finished here. My home is important, but the Malefactor needs to be contained. Perhaps my time with Tuulen will help both causes. \n  &5[Thank you.] \n  &6[The Crimson King] \nRawInline  color|red|Go. You need to end this.   RawInline  Color|teal|{...} \n  &6[Pten] \n Should we go back to Vargos and Bhairavi, or should we send word and head to this temple? \n  &5[No. We need to find this temple. Can you reach them from here?] \n  &6[Zarek] \n Absolutely. I’ll give them a buzz. Let’s get going.  \n&o  C: Leave the cavern. \n After leaving: \n&o  C: Enter the ruined temple the Crimson King sent you to. \n  Coordinates: [-1526 9 1696] \n  After entering the ruined temple: \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Talk to Pten and Zarek. Table  AlignDefault ColWidthDefault AlignDefault \n Zarek (Entrance of ruined temple) AlignDefault \n  &6[Pten] \n Looks like we've got some walking to do. Do we have enough supplies? \n  &5[I hope so.] \n  &6[Zarek] \n We should. Worst case, we conjure some in. \n  &5[You can do that?] \n  &6[Zarek] \n Gosh, I hope I can. I've done it before! \n  &5[Alright then, let's see what we can find.] \n  &6[Pten] \n Ready to go?  \n  &5[Nope.]  \n  &6[Pten] \n Then get ready. The way out seems to be northward. \n  &5[Yep.] \n  &6[Pten] \n Let's go see Isharist with our own eyes... The way forward seems to be southward.  \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Continue into the caves. \n After going further: \n&o  C [1/3]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/3]: Talk to Pten and Zarek. \n&o  C [3/3]: Investigate the Construct. Table  AlignDefault ColWidthDefault AlignDefault \n Zarek (Deeper in ruined temple) AlignDefault \n  &6[Pten] \n That's the most walking I've had to do in years... \n  &5[How long was that?] \n  &6[Pten] \n I think we've been at this for half a day at least. I'm not sure how far we've gone, but I'm really exhausted... Should we head through that doorway across the bridge and then set up some camp? \n  &5[Sure. I wanna poke around before we do too much else though. That statue seems interesting...] \n  &6[Pten] \n Be careful. We have no idea what kind of defenses the Isharistians would have established. Even if most of their territory has been long-destroyed, something could still be active.  Table  AlignDefault ColWidthDefault AlignDefault \n Defender Construct (Deeper in ruined temple) AlignDefault \n  &6[Defender Construct] \n (scrambled text)Unknown... Combatant Approaching... SCANNING...(scrambled text)   RawInline  Color|teal|{...} \n  &6[Zarek] \n Uh... boss. I think you should step back...   RawInline  Color|teal|{...} \n  &6[Defender Construct] \n POWERING UP. HOSTILE LIFEFORM. THE TOMB MUST BE PROTECTED.   RawInline  Color|teal|{...} \n  &6[Zarek] \n Oh gods, it's charging up. I've got you!  \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Talk to Pten and Zarek... and get ready to fight! Table  AlignDefault ColWidthDefault AlignDefault \n Zarek (Deeper in ruined temple) AlignDefault \n  &6[Zarek] \n I think we're going to have to fight... I think it has a shield around itself though? \n  &5[How do I break it?] \n  &6[Zarek] \n I can read the electricity this thing is building up. I don't think you can hurt it directly, but it'll give off energy for sure. Maybe you can take advantage there?  \n  &5[Give me a few to prepare.]  \n  &6[Zarek] \n You got it, boss. \n  &5[I'm ready to try.] \n  &6[Zarek] \n Let's send you in there!  \n  To defeat the boss you must kill 6(?) spark elementals (Floating seeded amethyst blocks with 90 hp each). LineBreak  The spark elementals will randomly spawn. LineBreak  The boss will constantly be outputting netherite blocks foot level that deal large amount of damage. The pattern changes from spiral to random. \n  After beating Defender Construct: \n  &6[Defender Construct] \n Powering... down... power levels... critical...   RawInline  Color|teal|{...} \n  &6[Zarek] \n We did it!   RawInline  Color|teal|{...} \n  &6[Pten] \n Alright, let's get through that gate and set up camp... This has been a long day. Maybe we can reach out to Bhairavi and Vargos and get some backup. \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Continue through the large door. \n After going through the large door: Header silver_knights_tomb  Silver Knight's Tomb \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Talk to your allies. Table  AlignDefault ColWidthDefault AlignDefault \n Zarek ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink lobby) AlignDefault \n  &6[Zarek] \n Looks like there's some sort of surviving city up ahead. Can't wait to go check it out!  Table  AlignDefault ColWidthDefault AlignDefault \n Pten ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink lobby) AlignDefault \n  &6[Pten] \n Your friend is back. I don't know how they caught up to us, but they're waiting for you.  Table  AlignDefault ColWidthDefault AlignDefault \n The Crimson King ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink lobby) AlignDefault \n  &6[The Crimson King] \nRawInline  color|red|Hello again [Player]. I followed you as swiftly as I could manage. My time with Tuulen was fruitful, but I have been sent here to assist you. \n  &5[What did you learn?] \n  &6[The Crimson King] \nRawInline  color|red|Much. I now have an understanding of how I might return home. She could not help me herself, but she gave me a way... I must come with you into the ruins. I need to help you find Teal. \n  &5[Then what?] \n  &6[The Crimson King] \nRawInline  color|red|Then I will do what I must. \n  &5[...Okay. Vague, but I trust you. So what now?] \n  &6[The Crimson King] \nRawInline  color|red|We enter the Tomb. \n  &5[The Tomb?] \n  &6[The Crimson King] \nRawInline  color|red|This place. In the ruins of Isharist, the Kingdom where I was once used alongside Teal by the Emperor Yeigar, the site of the Silver Knight's fury, there lies a tomb for the fallen. A Silver Knight still remains in the fallout. He is not dead, but not alive either. Not right now. \n  &5[And Teal's pedestal is with it?] \n  &6[The Crimson King] \nRawInline  color|red|Exactly. The Knights, Tuulen said, built a Tomb for the fallen Knight, who once carried myself and Teal before Yeigar captured and slaughtered him. It was their final act of revenge against the Emperor. Using the ruins of his Empire to protect the world. The Silver Knight's Tomb. Now we must enter and find what the Malefactor has done. Recontain him if we can. Destroy him if we can not. Are you prepared? \n  &5[I am.] \n  &6[The Crimson King] \nRawInline  color|red|Then take this key and let us go. Your allies are free to join if they wish, but only you and I are necessary. It is time to end things.  \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Enter the   Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink  . \n After entering: \n&o  C [1/2]: Find and close all four Time Rifts in the timetorn city. [The waypoint points to the center of the city.] \n&o  C [2/2]: Once all four Time Rifts are closed, approach the Silver Cathedral. Table  AlignDefault ColWidthDefault AlignDefault \n The Crimson King ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink Story mode) AlignDefault \n  &6[The Crimson King] \nRawInline  color|red|I can sense Time itself being distorted here. Not all of this place is from this time. Rifts are opening... Explore what lies before us and find the Rifts, [Player]. It might be our only way forward.}}  \n  Rift The Lyrata: 90 207 333 \n Rift Timetorn Legionary: 105 237 457 \n Rift Infernal Flame: 19 246 398 \n Rift Timesick Duo: 100 275 296 \n  After beating first rift: \n  color|gray|The time rift fades away as you land the finishing blow, and you find yourself back where you were.}} \n  &6[The Crimson King] \nRawInline  color|red|These beings have been ripped out of time... With them though, comes memories. Teal was here, exploring the past to find a way through to the Knight hiding deeper within. There was a guardian, called the Silver Construct. Teal destroyed it and scattered its pieces through these rifts to stop anyone following him into... whatever is next? Perhaps if we can find and close all of the Rifts, we can restore the Guardian and use it?}} \n After beating second rift: \n  color|gray|The time rift fades away as you land the finishing blow, and you find yourself back where you were.}} \n  &6[The Crimson King] \nRawInline  color|red|Another piece of the Silver Construct! I can feel it reforming in the present. I am not sure what it will do once we have completed it, but I can feel its power beginning to collect in the cathedral on the hill to the north. I can see a powerful memory of the mighty Knights of Lyrata attempting desperately to hold it off as other mighty heroes stood firm, prepared to turn it away. A duo of warriors, a master of forges, and something stranger still. Incredible.}} \n After beating third rift: \n  color|gray|The time rift fades away as you land the finishing blow, and you find yourself back where you were.}} \n  &6[The Crimson King] \nRawInline  color|red|Another rift, another part of the Construct. These guardians seem to be vital recollections of the elements of the Construct itself, each involved in its eventual destruction. We are getting closer to completing our task. I sense the place beyond the cathedral but I'm struggling to understand its purpose... The Forge?}} \n After beating fourth rift: \n  color|gray|The time rift fades away as you land the finishing blow, and you find yourself back where you were.}} \n  color|gray|A loud rumbling emanates from the Cathedral, echoing through the city as the final time rift collapses.}} \n  &6[The Crimson King] \nRawInline  color|red|Yes. The Forge. The Knights made... they made wool there. This is why I have been sent here, is it not? It is not just to help you capture Teal... It is to remake my Home. I understand now. I have found the last piece of the Construct as you battled, but something is strange. I tried to pull all of the memories together, much like I did the Monument in the Isles, but it did not work. My power is not working well here. ange. But the Construct still arrived. It has been waiting to be reforged... I do not think it will let us pass peacefully.}} \n After going through the Cathedral: \n&o  C: The Tomb of Time: Defeat the Silver Construct! \n  &6[Silver Construct] \n UNAUTHORIZED ENTITY DETECTED: IMPLEMENTING REMOVAL PROCEDURE. \n After getting to 50% health: \n  &6[Silver Construct] \n INTERNAL DAMAGE CRITICAL: REALIGNING CURRENT DIRECTIVE: DESTROY INTRUDERS. \n After beating the Imperial Construct: \n  &6[Silver Construct] \n PRIME DIRECTIVE FAILED: TOMB HAS BEEN BREACHED. ENABLING FORGE DEFENCES. Header the_forge  The Forge \n&o  C: Enter the Forge. Table  AlignDefault ColWidthDefault AlignDefault \n The Crimson King ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink Story mode Forge) AlignDefault \n  &6[The Crimson King] \nRawInline  color|red|We are here, at last, in the Forge of the Silver Knights. Let us enter the heart of these flames and craft a blank wool, like the Knights have done so many times before. If not at this Forge, then at another they have created.}} \n  &5[So the Silver Knights make the wool themselves?] \n  &6[The Crimson King] \nRawInline  color|red|In a way. Whenever a wool was needed, they would craft the prison, specialized for the being they sought to contain, but I do not know from what. We will need a specialized one to contain the Malefactor too. There will be guardians though. If we can defeat them, I can take from them the memories they hold and we can craft the wool ourselves. Together.}} \n  &5[Together. Should we craft a second wool for you?] \n  &6[The Crimson King] \nRawInline  color|red|Home is... so... close. But no. Not yet. We have to handle Teal first. You really held up your end of the contract, [Player], and I cannot thank you enough for it.}}  \n Defeat the mini bosses that spawn (Dialogue when mini boss spawns): \n  &6[The Crimson King] \nRawInline  color|red|Argentel... Your death shall grant me strength to shape the power.}} \n  &6[The Crimson King] \nRawInline  color|red|Fulgar... Your death shall grant me the heat of the forge.}} \n  &6[The Crimson King] \nRawInline  color|red|Procursus... Your death shall grant me the focus to finish this craft, the mightiest of wool, ready to hold firm.}} \n  &6[The Crimson King] \nRawInline  color|red|Medice... Your death shall grant me incantation to power this prison.}} \n  &6[The Crimson King] \nRawInline  color|red|Bothnys... Your death shall grant me accuracy to shape the form.}} \n After beating all 5 mini bosses: Table  AlignDefault ColWidthDefault AlignDefault \n The Crimson King ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink Story mode Forge Completion) AlignDefault \n  &6[The Crimson King] \nRawInline  color|red|It is done. Together we have crafted a new wool. It is blank now. Soon we shall grant it a color. It is time to enter the crypt itself, where the Silver Knight lies. Where the Malefactor himself waits for us. I need you to know I will not be of much help in this coming fight, however.}} \n  &5[Why? What happened?] \n  &6[The Crimson King] \nRawInline  color|red|The power it took to craft this wool and make manifest the knowledge to do so has left me drained. Something about this place has dampened my power significantly. Hopefully the same is true for Teal.}} \n  &5[I hope so.] \n  &6[The Crimson King] \nRawInline  color|red|If this is the end of our time together, our last peaceful moment, I thank you for all you have done. This has been something I will keep in my memory forever.}} \n  &5[Thank you. You’ve, surprisingly, been a true ally. Let’s finish this, Vaessini. Let’s get you Home.] \n  &6[The Crimson King] \nRawInline  color|red|Yes. It is time. Onward.}}  Header teal  Teal \n&o  C: Defeat the Teal Spirit! \n  &6[The Malefactor] \nRawInline  color|teal|so you chose to follow. no matter. i will lay waste to you here as well. this place is so curious, is it not? the thunderous power of the fall of an empire, leaving just this tiny slice, still humming with the energy of a million deaths. all to find us… you and i, vaessini.}} \n  &6[The Malefactor] \nRawInline  color|teal|i ask one last time. will you join with me? free our brethren? hunt down the remnants of the knights and their architect and grant us the freedoms as gods, as we so rightly deserve?}} \n  &6[The Crimson King] \nRawInline  color|red|No. We are here to put you away again, where you belong.}} \n  &6[The Malefactor] \nRawInline  color|teal|you cannot, fool. there is nothing left here. no knights to build you your prisons. i have damaged them. i have destroyed them. we both know no knight would willingly follow one of us.}} \n  &6[The Crimson King] \nRawInline  color|red|Yet their memories remain. No Knight built this wool. I did.}} \n  &6[The Malefactor] \nRawInline  color|teal|then i wish you luck trying. you can never stop me. it is far too late.}} \n Dialogue at start of fight: \n  color|teal|the full wrath of time itself will be upon you!}} \n Dialogue at 50% health: \n  color|teal|i call forth the echoes radiating from the edges of oblivion itself. rise, emperor!}} \n Dialogue once beaten: \n  color|teal|no, this cannot be! time... betrays me? why do the hands of time not turn? i... will... be... forever!}} \n After defeating the Teal Spirit: \n  &6[The Crimson King] \nRawInline  color|red|This is it, the final time rift. At its end, you will surely find the very core of Orasomn's being. If you can manage to collect it, our time here will draw to an end.}} \n&o  C: At last, recapture the Teal Spirit into a Wool. Table  AlignDefault ColWidthDefault AlignDefault \n The Crimson King ( Link   Silver Knight's Tomb Silver_Knight's_Tomb wikilink Story mode End) AlignDefault \n  &6[The Crimson King] \nRawInline  color|red|I offer you the blank wool. Take it. Use it.}} \n  &5[Right...] \n  &6[Orasomn Core] \nRawInline  color|teal|you cannot... no. all i have worked for. all i have done for freedom. you are not strong enough to contain me!}} \n  &5[You've threatened the safety of the entire world. There is no place for you here. It's time to go.] \n  &6[Orasomn Core] \nRawInline  color|teal|i have the power of the entire empire at my control. i will not be contained for long. there is nothing you can do to keep me locked away. your cheaply made wool is useless.}} \n  &6[The Crimson King] \nRawInline  color|red|But there is plenty I can do. I do not need to be within my own wool. My home is long-destroyed. But I can find solace here. The jailed becomes the jailer. I will go within the wool as well, and keep Teal quelled. This is what has always been meant for me, has it not? Teal and I have been forever entwined since the day the Knights captured him with my help. We shall thus be entwined forever more within one wool of power. Do it. Now. Before it is too late.}} \n  &5[Are you sure?] \n  &6[The Crimson King] \nRawInline  color|red|I have never been more sure of anything. Seal us away. The pedestal is nearby, I can feel it. Let me go home.}} \n  &5[Very well, then. Goodbye, Vaessini.] \n  &6[Orasomn Core] \nRawInline  color|teal|NO! YOU WILL NEVER CONTAIN ME!}}  Header completion  Completion \n After leaving the dungeon: \n&o  C [1/2]: Enter the ruined temple the Crimson King sent you to. \n&o  C [2/2]: Enter the large door to the side of the lobby. \n After entering the large door: \n&o  C: Speak to Silver Knight Sevvet. Table  AlignDefault ColWidthDefault AlignDefault \n Silver Knight Sevvet AlignDefault \n  &6[Silver Knight Sevvet] \n At last, my service may come to a close. At last, I can die. \n  &5[Wait, no. You're the Silver Knight that carried the Wools, right? The one Yeigar attacked?] \n  &6[Silver Knight Sevvet] \n The past is long buried by those who turn the world. It will always matter, but it will never turn back again. As the Veil falls, the Monuments must be made complete. There is no other way. The path that must be walked is tied to the one who started it all. \n  &5[And where is that?] \n  &6[Silver Knight Sevvet] \n Home. The Architect's Ring. The way is open now that the prison is placed. My eternal brothers will be forever grateful the Malefactor has been sealed and the Manumitted has returned. Stability has been restored. Go forth in peace. I will return to the great thread now... \n  color|gray|The Knight falls silent. Sevvet is gone.}}  \n  color|gray|THE TOMB OF TIME COMPLETE}} \nLineBreak RawInline  color|teal|Awarded access to a free key to the [[Silver Knight's Tomb]] raid modes, an [[Architect's Token]] and access to the [[Architect's Ring]]!}} \n After entering the portal further on: \n  &6[Distant Voice] \nRawInline  color|gray|Time, like memory, fades into the endless echoes...}}   RawInline  color|teal|{...}}  } \n  &6[Distant Voice] \nRawInline  color|gray|It drifts, like waves, aimless through unseen realities...}}   RawInline  color|teal|{...}}  } \n  &6[Distant Voice] \nRawInline  color|gray|And riding upon those waves, a stranger now stands upon my shores...}}   RawInline  color|teal|{...}}  } \n  &6[Distant Voice] \nRawInline  color|gray|And those that would follow him... I wonder...}}   RawInline  color|teal|{...}}  } \n  &6[Distant Voice] \nRawInline  color|gray|Will the Veil see a new dawn, or be cast forever into the twilight...}}   RawInline  color|teal|{...}}  } \n  &6[Distant Voice] \nRawInline  color|gray|I will...}}   RawInline  color|teal|{...}}  } \n  &6[Distant Voice] \nRawInline  color|gray|BE WATCHING...}} ", "reward": "rewards =*Free key to the &3Silver Knight's Tomb&r raid modes\n*&3Architect's Token&r\n*Access to the &3Architect's Ring&r!\n"}