{"name": "The Olive Branch (Quest)", "information": "prerequisites = &3Unmasked&r\n NPC: Bhairavi Coords: -543, 6, -528\n Celsian Isles &3Steelmeld&r\n", "dialogue": "}} \n  WorkInProgress|Missing a few compasses and coords}} \n&o  Venture into the Ruins of the Congress with Bhairavi's team. Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi \n  Coordinates: [-543, 6, -528] \n   Color|Orange|[Bhairavi]}} \nRawInline   Color|Purple|[You do?]}} \n  Color|Purple|[Can you help me understand what happened inside Isharist?]}}  \n  Color|Orange|[Bhairavi]}} \n I can try at least. You were not in Isharist. Not the majority of the time at least. For most of your time with Calder, you were in echoes of that empire's collapse, not reality. Until the end. You were travelling through echoes, searching for the source of the noise, so to say. Then, once you found the source, Calder silenced it. Now we have to clean up the screams. Now, about the spirit. \n  Color|Purple|[Yes! What have you found?]}} \n  Color|Orange|[Bhairavi]}} \n Vargos and I called a meeting of the Mage Council and began an intense magic search across the region. I called in a few of my assistants, and I believe we’ve found things. \n  Color|Purple|[Can I have another copy of your research?]}}  \n  Color|Orange|[Bhairavi]}} \n Um, I suppose, sure. \n  Color|Purple|[Like what?]}} \n  Color|Orange|[Bhairavi]}} \n Well, firstly, there’s a strange disturbance of magic going on under the town of Nightroost. Wexley said it was like… a song? Anyway, the spirit was absolutely involved, but is gone. \n  Color|Purple|[That's all? Want me to go check it out?]}} \n  Color|Orange|[Bhairavi]}} \n Oh, not at all. It's worse. The spirit has been active almost everywhere. We've been finding little time anomalies breaking through and creating some strangeness. But it's all been leading right to the center of the isles, to the ruins of the Congress. \n  Color|Purple|[Oh no. That can't be good.]}} \n  Color|Orange|[Bhairavi]}} \n No, it cannot. The Council is well aware of the Congress, you see. We've exchanged research with them before, and they were known to have the most extensive magical research on any topic, ever. Their exhibits were unrivaled. And according to Antigone, there's wool magic radiating from it like crazy. \n  Color|Purple|[So you want me to go inside again?]}} \n  Color|Orange|[Bhairavi]}} \n Yes I do. Into the real Congress, not just a collapsing room, as well. Also, we're coming with you. Are you in? \n  Color|Purple|[I'm in. Also what? You're coming with me? Bhairavi, it's dangerous.]}} \n  Color|Purple|[I'm not sure I'm ready for this right now.]}}  \n  Color|Orange|[Bhairavi]}} \n I... understand. We need you when you're ready. \n  Color|Orange|[Bhairavi]}} \n Of course it is. But I'm tired of sending you into danger alone. This is a unique situation   RawInline   Color|Orange|[Bhairavi]}} \n Head over to the Congress and see what you can find. I'll be sending Wexley to meet you this time. No more vagueness - that didn't go well before.  \n&o  Find Wexley at the Ruins of the Congress. Table  AlignDefault ColWidthDefault AlignDefault \n Wexley \n  Coordinates: [-622, 25, 557] \n   Color|Orange|[Wexley]}} \n Hello   RawInline   Color|Purple|[I see that. It looks... pristine here. So, do you have any idea how to get in? Or should we just go down the shaft in the center?]}} \n  Color|Orange|[Wexley]}} \n I've already checked out that other path and didn't see any way to get further yet. There's a weird misty barrier I can't pass, so this door seems to be our best bet. It looks very out of place! Maybe we can break it down? \n  Color|Purple|[I don't know about that.]}} \n  Color|Orange|[Wexley]}} \n Come on, you're strong! Brayllur says so! Give it a shot. \n  Color|Orange|[Wexley]}} \n Go on! Punch the door!  \n (Missing Compass) \n  Color|Grey|You punch the door. It doesn't seem to do much, other than hurt your hand.}} \n  Color|Orange|[Wexley]}} \n Hmm, that didn't work. Let me see if I can do this correctly... Once I'm done, quickly turn and hit the door. It won't last long. \n  Color|Grey|He speaks some... words. They make your brain hurt and you can't seem to remember them.}} \n  Color|Orange|[Wexley]}} \n Okay, try punching the door again. \n&o  Back to the door! Give it a whack! \n  Color|Grey|You punch the door again. It quivers, but remains in place.}} \n&o  Complain to Wexley. Table  AlignDefault ColWidthDefault AlignDefault \n Wexley \n  Coordinates: [-622, 25, 557] \n   Color|Orange|[Wexley]}} \n No, I think I did that a bit wrong... Let me try again. Once again, as soon as I cast this, quickly, hit the door. \n  Color|Purple|[You must be joking.]}} \n  Color|Grey|He speaks some noises more emphatically this time. They melt out of your head almost as quickly as you hear them.}}  \n&o  It'll definitely work this time. Break down the door! \n  Color|Grey|You punch the door again. It remains closed. Like it's taunting you.}} \n&o  Tell Wexley you've given up on breaking down doors. Table  AlignDefault ColWidthDefault AlignDefault \n Wexley \n  Coordinates: [-622, 25, 557] \n   Color|Orange|[Wexley]}} \n Well, so much for that. I hoped this strength spell would be more powerfu- \n  Color|Orange|[Unknown Voice]}} \n Hello? Is someone out there? \n  Color|Purple|[Um... yes?]}} \n  Color|Orange|[Unknown Voice]}} \n Did you knock? \n  Color|Purple|[...Yes, definitely! Can we uh... come in?]}} \n  Color|Orange|[Unknown Voice]}} \n What's the password? \n  Color|Orange|[Wexley]}} \n Oh, hey, I know this one. It's in the book in front of me. Check it out.  \n&o  Find the password in the nearby book. Table  AlignDefault ColWidthDefault AlignDefault \n Door \n  Coordinates: [-621, 25, 560] \n   Color|Orange|[Unknown Voice]}} \n What's the password? \n  Color|Purple|[Sorrows of Phyrrys]}}  \n  Color|Orange|[Unknown Voice]}} \n Mate that's ancient. No way. \n  Color|Purple|[The Last False Heart]}}  \n  Color|Orange|[Unknown Voice]}} \n That was last week's! \n  Color|Purple|[Branch of the Grand Olive Tree]}}  Plain  [Branch of the Grand Olive Tree]}} \n  Color|Orange|[Unknown Voice]}} \n Yeah, that's the one. Come on in.  \n&o  Talk to Hargraves, the man behind the door. Table  AlignDefault ColWidthDefault AlignDefault \n Hargraves \n  Coordinates: [-1021, 122, 2186] \n   Color|Orange|[Hargraves]}} \n Well hello. I don't recognize you. New to the Congress? \n  Color|Purple|[Let's say that.]}} \n  Color|Orange|[Hargraves]}} \n Excellent, always nice to have a new face around. Look, I'm supposed to organize the test tubes in the walls around us, but damn, it's proper tough this time. If you can do it for me, I'll send you off to the Forum to deliver the reports and you can have the rest of the day off. Sound good? \n  Color|Purple|[I'm in. How does this work?]}} \n  Color|Orange|[Hargraves]}} \n Okay, so in these eight tubes are a number of reagent blocks. You can take the top block, one at a time, and put them into any other tube. However, the block can only go into a tube if the next block down shares a color with it, or the tube is completely empty. Your goal is to get all seven colors into their own tubes, four blocks of a color per tube. \n  Color|Purple|[Sounds complicated. I'll give it a go.]}} \n  Color|Orange|[Hargraves]}} \n Great! Thank goodness, I wasn't looking forward to leaving my desk.  \n  Use the buttons with arrows to select a block. Group the blocks into same color groups, rinse and repeat and you're done. \n  Hargraves \n  Coordinates: [-1021, 122, 2186] \n   Color|Orange|[Hargraves]}} \n Hey! You did it! Let me write up a report real quick... Head back out this door and down the spiral staircase into the Labs. You should be able to get into the main Forum and deliver this to Professor Marin. Do you have an access pass? \n  Color|Purple|[Not yet. I was uh, supposed to get one though.]}} \n  Color|Orange|[Hargraves]}} \n That's fine, I'll cast it onto you. Here you go then and thanks for your help.  \n&o  Leave the reagents room with your report! \n&o  Deliver your report to Professor Marin. Table  AlignDefault ColWidthDefault AlignDefault \n Professor Martin \n  Coordinates: [???, ???, ???] \n   Color|Orange|[Professor Marin]}} \n Hello, who are you? \n  Color|Purple|[Um... hello. I'm <Player>. I've got a delivery for you, from Hargraves.]}} \n  Color|Orange|[Professor Marin]}} \n Oh wonderful. I've been waiting for these reagent logs all week. Here, take this key. It should get you further into the Forum. You can get some refreshments before you head back to work. \n  Color|Purple|[Thank you.]}} \n  Color|Orange|[Professor Marin]}} \n Anyway- \n  Color|Teal|you. i know you.<br>\nyou should not be here.<br>\ni am doing what i must.<br>\nleave. do not return.}}  \n&o  You have found the Fallen Forum. When ready, take a key and enter the dungeon. \n&o  Complete the Fallen Forum dungeon {Coordinates do not point to your next objective}. \n Upon dungeon completion: \n  Color|Orange|[Margaret]}} \n I think it’s done folks. \n  Color|Orange|[Aurielle]}} \n That’s it? That’s all the fanfare we get? \n  Color|Orange|[Margaret]}} \n Oh come on Auri, did you expect streamers and a party? We’ve just made a wool. This is massive. No longer do we need to worry about those ancient artifacts turning up and changing the course of history. We can change them ourselves. \n  Color|Orange|[Orcard]}} \n So what’s next? Do we use the Olive Wool to find the Tree of Life for real, and make more? \n  Color|Orange|[Margaret]}} \n For now, I think we test this one out, for real. I’m going to focus a lot of Malkus and Daath energy into this thing. \n  Color|Orange|[Bhairavi]}} \n Do you think that’s what Lyson meant by “Death” energy? Of course, it has to be. How else would the False Spirit have been active? This means it really was just an accident! \n  Color|Teal| you again. the watcher.}} \nLineBreak RawInline  Color|Gray|You feel as if the voice is speaking directly to you.}} LineBreak RawInline  Color|Teal| you may bear witness to what i must do, if you must. time must flow this way. i must see it does so we may be truly free.}} \n  Color|Orange|[Bhairavi]}} \n That was intense.   RawInline   Color|Purple|[We’re no closer to catching Teal though.]}} \n  Color|Orange|[Bhairavi]}} \n We’re not, but we know something now. The spirit is ensuring it is destroyed by Maxwell Calder. You heard what it said. It’s meddling with time now. How many events has it been playing with over the years? Is this the first, or just one of many? I must begin researching; this is a lot to take in. \n  Color|Purple|[Can I help?]}} \n  Color|Orange|[Bhairavi]}} \n As soon as I know more, you’ll be the first person I call. Incredible work in there. \n  Color|Cyan|THE OLIVE BRANCH COMPLETE!<br>\nAwarded access to [[The Fallen Forum]], its Delves (once R2 Monument is completed), Full Access to the Forum Lobby Trader, and [[The Olive Branch (item)|The Olive Branch]]!}} ", "reward": "rewards =\n* Access to &3The Fallen Forum&r dungeon and its Delves\n* &3The Olive Branch (item)|The Olive Branch&r\n"}