{"name": "The Plague", "information": "prerequisites = None NPC: Dr. Laurie King's Valleytown = Nyrstarting_npc_coordinates = -105 95 -115 NPC: Dr. Laurie King's Valleytown = Nyrstarting_npc_coordinates = -105 95 -115starting_npc_coordinates = -105 95 -115 King's Valleytown = Nyrstarting_npc_coordinates = -105 95 -115town = Nyrstarting_npc_coordinates = -105 95 -115", "dialogue": " Table\n Dr. Laurie\n  Color|orange|[Dr. Laurie]\n Oh no, please tell me you're not infected too?\n  Color|purple|[I'm fine. What's wrong with them?]\n  Color|orange|[Dr. Laurie]\n An out break of Marasmus Execratio, or the 'Blackroot Plague' as it's colloquially known. I won't go into the details, but it\nis both resoundingly unpleasant and fatal to two-thirds of the infected. Worst of all, none of my drugs work against it.\n  Color|purple| [Can anything be done?]\n  Color|orange|[Dr. Laurie]\n Some Tlaxani say their shamans could brew medicine that can cure it. It's a longshot, but there's four lives on the line. If\nyou can find a shaman who can make that medicine, bring me back five doses; four for them, and one more so I can learn how to\nmake it myself.\n  Color|purple|[Wow, that sounds nasty]\n  Color|orange|[Dr. Laurie]\n Extremely. Now, if you're done being flippant I have some lives to save.\n  Color|purple|[Yep, I'm dying *cough cough*]\n  &6[Dr. Laurie]\n Your pupils aren't even dilated and your eyes aren't oozing pus. Stop joking around, stop wasting my time.\n&o  Meet C'Taz in the jungle at 240, 78, 315 Table\n C'Taz\n  Color|orange|[C'Taz]\n The plague has come again. I can make the medicine you seek. First, we need twelve golden stones, darkened with fear. Twelve\ntreasures of winged foes, from their fortress of leaves and sky. Bring them to me. Behind me is a totem of sky. You may use it\nto come and go here freely, if your intentions are true. SoftBreak   Color|orange|[C'Taz] To make the medicine you seek, I need\ntwelve Dark Amber, plucked from a fortress of leaves and sky. This is the first step of three.\n&o  Dark Amber: Hawk Fortress 445, 124, 105\n  Color|orange|[C'Taz]\n Perfect. Dark Amber, to be ground into a powder as fine as the smoothest sand. Next, we need sixteen Spirit Flowers, plucked\nfrom an island deep in the jungle. Their ancient oils banish the foul spirits afflicting Nyr.\n  Color|orange|[C'Taz]\n Now, you must bring me sixteen Spirit Flowers, plucked from an island deep within the jungle. Their oils are essential for the\nmedicine.\n Spirit Flower &o  : Hallowed Pond 450, 71, 245\n  Color|orange|[C'Taz]\n Wonderful. Pungent and rich, these flowers will banish the evil spirits who have blighted Nyr. Their oils form the base of the\nmedicine. Finally, bring ten pieces of Haunted Earth, reclaimed from my people's ancient home to the North. Then they shall\nlive.\n&o  Haunted Earth: Ancient Ruins 320, 73, -75\n  Color|orange|[C'Taz]\n The ingredients are gathered. I shall invoke the spirits of earth and health and blood, and then the medicine will be yours.\n  Color|orange|[C'Taz]\n The medicine is done. There are four souls who must drink this, but I have more ingredients. I sense great hardship in your\nfuture, and can make you two powerful elixirs to aid you. Or, I can make another dose of medicine. Choose.\n&o  When presented the option to take some potions or an extra dose of medicine, its optimal to choose the extra medicine\notherwise you will need to re-gather the ingredients again in   Link   Roots of the Plague Roots_of_the_Plague wikilink\n&o  This ending dialog is from choosing to take potions instead of the extra medicine Table\n Dr. Laurie\n  Color|orange|[Dr. Laurie]\n You actually found that medicine? SoftBreak   Color|purple|[Yes, but only four doses]\n  Color|orange|[Dr. Laurie]\n Well I can't make my own, but that's still enough to save everyone. Let's see if this works...\n  Color|orange|[Dr. Laurie]\n &o  COMPLETED THE PLAGUE  Awarded 192 Enchanting Bottles and 3 Potions of Restoration!\n&o  This ending dialog is from choosing to take the extra medicine. Table\n Dr. Laurie\n  Color|orange|[Dr. Laurie]\n You actually found that medicine? SoftBreak   Color|purple|[Yes! All five doses]\n  Color|orange|[Dr. Laurie]\n Well, I'll set this one aside for later, and let's see if this works...\n  Color|orange|[Dr. Laurie]\n &o  THE PLAGUE COMPLETE!  Awarded 192 Enchanting Bottles and 3 Potions of Restoration! LineBreak\n", "reward": "rewards = *192 Enchanting Bottles\n*3 Potions of Restoration"}