{"name": "The Gem of Ishnir", "information": "prerequisites = &3The Lost Empire&r NPC: Siehaven Smith Celsian Islestown = Alnerastarting_npc_coordinates = 340, 42, 721rewards = *&3Valley of Forgotten PharaohsGray&r Key\n*&3Embalmer's Trophy&r\n*Access to &3Valley of Forgotten Pharaohs NPC: Siehaven Smith Celsian Islestown = Alnerastarting_npc_coordinates = 340, 42, 721rewards = *&3Valley of Forgotten PharaohsGray&r Key\n*&3Embalmer's Trophy&r\n*Access to &3Valley of Forgotten Pharaohsstarting_npc_coordinates = 340, 42, 721rewards = *&3Valley of Forgotten PharaohsGray&r Key\n*&3Embalmer's Trophy&r\n*Access to &3Valley of Forgotten Pharaohs Celsian Islestown = Alnerastarting_npc_coordinates = 340, 42, 721rewards = *&3Valley of Forgotten PharaohsGray&r Key\n*&3Embalmer's Trophy&r\n*Access to &3Valley of Forgotten Pharaohstown = Alnerastarting_npc_coordinates = 340, 42, 721rewards = *&3Valley of Forgotten PharaohsGray&r Key\n*&3Embalmer's Trophy&r\n*Access to &3Valley of Forgotten Pharaohs", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith AlignDefault \n&o  The man seems to be mumbling to himself while looking over a map. \n  Color|orange|[Sierhaven Smith]}} \n Just past the ruins of... No, that tomb was empty... \n  Color|purple|[Looking for something specific on that map?]}} \n  Color|orange|[Sierhaven Smith]}} \n Huh? Oh, my apologies- I didn't hear you come in. But yes, well, I'm a bit focused on my work at the moment. I don't believe we've met before- the name's Sierhaven Smith!  \n  Color|purple|[Your name is... Sierhaven?]}}  \n  &6[Sierhaven Smith] \n That it is, though I'm more often referred to as \"Siery\" for short. \n  Color|purple|[What is your work here?]}} \n  Color|orange|[Sierhaven Smith]}} \n I'm an... archaeologist, of sorts. I explore the lands in search of secrets left by our ancestors that have been long forgotten to time: tombs of lost pharaohs, sunken temples, you get the picture. But, right now, I'm in search of the desert's greatest treasure. \n  Color|purple|[Which would be what?]}} \n  Color|orange|[Sierhaven Smith]}} \n The Gem of Ishnir- a fabled diamond said to be so large that it dwarfs dunes in comparison. Myths say it was last in the possession of the Pharaoh Tehkma Ka, the second-to-last pharaoh of the Ka dynasty. \n  Color|orange|[Sierhaven Smith]}} \n Unfortunately, we have very little in the way of written records of that time- anything during that era is scarce to find information on. It's unknown why, exactly, but, for some reason, any accounts from then simply don't exist. \n  Color|purple|[So you don't actually know if it exists?]}} \n  Color|orange|[Sierhaven Smith]}} \n Technically, no, though I have a suspicion that it does; reason being that any questions on it that I ask the Pharaoh's advisors always lead to nervous sweats and short answers. Would you be interested in helping me settle this? \n  Color|purple|[Sure.]}} \n  Color|orange|[Sierhaven Smith]}} \n Fantastic! I suppose the first place for us to start is research into Tehkma Ka. If he really was the last one in possession of the Gem, following his tracks will be our best hope. I'll look over my information here- you go and speak to Nyra. She's the Royal Archivist to the Pharaoh. We have a... tangled past, so she won't speak much to me. Perhaps she'll give you some more information?  \n&o  Seek out Archivist Nyra in the Pharaoh's palace. Table  AlignDefault ColWidthDefault AlignDefault \n Archivist Nyra AlignDefault \n  Color|orange|[Archivist Nyra]}} \n Hello there. What brings you to the pharaoh's library today? \n  Color|purple|[Who are you?]}} \n  Color|purple|[The pharaoh's library is open to the public?]}} \n  Color|purple|[What can you tell me about Alnera?]}} \n  Color|purple|[Can you tell me anything about Pharaoh Tehkma Ka?]}} \n  Color|purple|[Can you tell me anything about the Gem of Ishnir?]}} \n  Color|orange|[Archivist Nyra]}} \n Let's see what we have on him here. Okay, Tehkma Ka, second to last pharaoh of the Ka dynasty. Born 169 CCE, died at the age of 70 in 239 CCE. Was supposedly laid to rest in the pyramid Jaldeshret, colloquially known as the Dehydrated Oasis, though no tomb has ever been found to corroborate those claims. Seems like that's all the information we have on him. \n  Color|purple|[His tomb has never been found?]}} \n  Color|orange|[Archivist Nyra]}} \n It's honestly not all that surprising- this was about 600 years ago, after all. This period of time also just so happens to fall into the 200 year \"blank\" period in our history: the years between 53 CCE to 248 CCE. We are lucky we have as much information on him as we do. \n  Color|gray|It doesn't seem like she has any more information she can give you on the subject. Best report back to Sierhaven Smith.}}  \n&o  Return to Sierhaven Smith with the information you learned from Nyra. Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith AlignDefault \n  Color|orange|[Sierhaven Smith]}} \n Welcome back. Did you get any information out of Nyra? \n  Color|purple|[It seems like all she knew was where he was supposedly buried: the Dehydrated Oasis.]}} \n  Color|orange|[Sierhaven Smith]}} \n Jaldeshret, huh? I've been there countless times- in fact, I'm the one who uncovered the entrance to the tunnels underneath the pyramid. I've never seen signs that there is a tomb anywhere in there, though. \n  Color|purple|[Perhaps I should go see if you missed anything?]}} \n  Color|orange|[Sierhaven Smith]}} \n A fair idea- some fresh eyes are never a bad thing. Leave no stone unpressed! While you're gone, I'm going to pull out my notes from that expedition, and see if there was anything I had logged but didn't take to relevance.  \n&o  Enter the Dehydrated Oasis and search out clues for Tehkma Ka's tomb. Leave no stone unpressed. Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|orange|[Tehkma Ka]}} \n You fool... What have you done...? \n  Color|gray|A mysterious force kicks you out of the tomb, and you find yourself back outside the pyramid.}}  \n&o  You stumbled on the tomb of Tehkma Ka. Report this back to Sierhaven Smith. Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith AlignDefault \n  Color|orange|[Sierhaven Smith]}} \n That was a quick trip. Find anything of note? \n  Color|purple|[I found the tomb of Tehkma Ka.]}} \n  Color|orange|[Sierhaven Smith]}} \n Really now?! What did you find? \n  Color|purple|[Tehkma Ka's journal and a locking device.]}} \n  Color|orange|[Sierhaven Smith]}} \n Mind if I see the book? \n  Color|gray|You hand Siery the book, and he reads through the pages slowly.}} \n  Color|orange|[Sierhaven Smith]}} \n I can't believe it! He actually mentions the Gem in here! The locking mechanism you mentioned, I assume this is the \"key\" he references. I assume you managed to get past it; what was it like? \n  Color|purple|[It looked like a stylized ankh, but something really bad seemed to happen when I activated it.]}} \n  Color|orange|[Sierhaven Smith]}} \n A stylized ankh? Wait... do you mean the symbol of the Lost Sands? What a fantastic lead,   RawInline   Color|purple|[Were you listening? I really don't think this is a good idea.]}} \n  Color|orange|[Sierhaven Smith]}} \n Oh, don't chicken out on me now! The discovery of a lifetime awaits us! You go on ahead over to the Lost Sands ruins. I'll meet you there.  \n&o  Meet Sierhaven Smith over in the Lost Sands City ruins. Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith AlignDefault \n  Color|orange|[Sierhaven Smith]}} \n Over here! This is the entrance to the underground. If we are to find anything, it will be here. \n  Color|orange|[Sierhaven Smith]}} \n Let's head in. I'll follow you through- you seem much more capable at taking out enemies.  \n&o  Enter the Lost Sands City undergrounds. Table  AlignDefault ColWidthDefault AlignDefault \n Sierhaven Smith AlignDefault \n  Color|orange|[Sierhaven Smith]}} \n I... I don't believe it. Is this... a city? The tales of the Gem, they must have been warped over time. How incredible: an entire city, lost to time, and right under our noses! I can't thank you enough for your help,   RawInline   Color|orange|[Sierhaven Smith]}} \n I can't thank you enough for all your help. All this time, and an ancient city was sitting right under our noses! I had my excavating crew set up a lobby for you to safely enter and exit, as the foundation is a bit unstable.   AlignDefault \n THE GEM OF ISHNIR COMPLETE! SoftBreak  Awarded a   Link   Gray Valley_of_Forgotten_Pharaohs wikilink Key, an   Link   Embalmer's Trophy Embalmer's_Trophy wikilink  , and access to the   Link   Gray Valley_of_Forgotten_Pharaohs wikilink Dungeon Teleporter.  \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *&3Valley of Forgotten Pharaohs|Gray&r Key\n*&3Embalmer's Trophy&r\n*Access to &3Valley of Forgotten Pharaohs|Gray&r Dungeon Teleporter"}