{"name": "The Salmon", "information": "prerequisites = None\n NPC: Dockmaster Coords: 691, 71, 458\n King's Valley Lowtide\nrelated_poi=&3Axtan Monastery&r\n", "dialogue": "  WorkInProgress|New end Dialogue Table\n Dockmaster\n  Coordinates: [691, 71, 458]\n   &6[Dockmaster]\n Welcome to Lowtide! Are you here for our shopping or for the fishing contest?\n  &5[Shopping!]\n  &6[Dockmaster]\n A fine choice! Our fine shovels and vibrant blue dyes are famous throughout the world.\n  &5[I'm here to parkour on your rooftops.]\n  &6[Dockmaster]\n I... um... Well, the town is not liable if you fall and break your neck.\n  &5[Fishing contest?]\n  &6[Dockmaster]\n Well, the contest isn't over, but you'll need to catch something amazing in order to win. Think you're up to it?\n  &5[Nah, not a big fishing fan.]\n  &6[Dockmaster]\n Then why did you ask about it in the first place?\n  &5[Absolutely.]\n  &6[Dockmaster]\n Haha, clad to hear it! At this point the only thing that can beat Roger's 58 inch trout is the legendary Regal Salmon. Quentin\nalways claims he knows how to find it, but never says anything specific. Might want to talk to him. He'll be in the cafe, like\nalways. Good luck!\n&o  Talk to Quentin in the cafe and convince him to tell you about the Regal Salmon. Table\n Quentin\n  Coordinates: [728, 68, 453]\n   &6[Quentin]\n Go away, I'm too sober to talk.\n  &5[What can you tell me about the Regal Salmon?]\n  &6[Quentin]\n Nothing you'd like to hear. Seeking the Salmon is not worth it. If you're stupid enough to really want to know, bring me an\nAxtan Ale. This stupid place only serves coffee. Coffee! After what I've fished up, I need a stiff drink, and those monks make\nthe best around!\n&o  [1/2]: Find an Axtan Ale in the   Link   Axtan Monastery Axtan_Monastery wikilink  's basement.\n&o  [2/2]: Once you have the Axtan Ale, bring it back to Quentin in Lowtide's cafe. He'll tell you the salmon's secret! Table\n Quentin\n&o\n  &6[Quentin]\n Ah! Thhat's the shtuff. Soo.. If you want to catch that shtupid fish you need to be reallllly unlucky. It'sh cursed, so it only\nshows when you're unlu*hic*cky. Then jusht go hang out near that big cat thing across the lake. But beware! It's curshed!\n&o  Quentin said you'll need to be unlucky and go hang out around a 'big cat thing' to find the Regal Salmon.\n  Purchase a Fisherman's Folly from the Alchemist at the Lowtide market.\n Travel to the nearby cat statue [613, 72, 358] and drink the Fisherman's Folly. Instantly 3 Vex's will spawn and the Regal\nSalmon will be in your inventory.\n  After summoning the Regal Salmon:\n  &6[Lemurian Knight]\n Poacher! Cur! Lemuria will not forget this theft of our glorious fish! Get them!\n After beating the Knights:\n&o  You feel the curse lifting from the Regal Salmon.\n&o  Bring the Regal Salmon to the dockmaster so you can win the contest! If you lose the Regal Salmon, the dockmaster might\nmanage to find it. Table\n Dockmaster\n  &6[Dockmaster]\n By the Gods, that's a Regal Salmon! well done, well done indeed! The contest is yours, enjoy the rewards and all that Lowtide\nhas to offer!\n THE SALMON COMPLETE! Awarded   Link   Fishing Trophy Fishing_Trophy wikilink  ,   Link   Crushing Depths Crushing_Depths\nwikilink  , and 64 Enchanting Bottles\n", "reward": "rewards =\n* &3Fishing Trophy&r\n* &3Crushing Depths&r\n* 64 Enchanting Bottles\n"}