{"name": "Time to Reflect", "information": "prerequisites = &3Tlaxan Troubles&r\n NPC: Barras Coords: 427, 196, -363\n King's Valley &3Ta'Eldim&r\n", "dialogue": " Table\n Barras\n  Coordinates: [427, 196, -363]\n   &6[Barras]\n I am shrinetender here for the fallen Shamans in this sacred place. Treat it with reverence, outsider.\n  &5[Are these for C'Shura, C'Axtal, and C'Zanil?]\n  &6[Barras]\n Curse be upon C'Zanil! He left us and betrayed our people. His name is not fit to be spoken here. This shrine is for C'Axtal\nand C'Shura. The dead and the missing.\n  &5[Will you tell me anything of C'Zanil?]\n  &6[Barras]\n Never. He is dead and gone, hidden away where none should find him.\n  &5[I actually found his tomb...]\n  &6[Barras]\n I hope you collapsed it. He deserves no such majesty.\n  &5[I understand.]\n  &6[Barras]\n Do you? Do you really understand the pain our people have felt thanks to that vile Shaman?\n  &5[Will you tell me anything of C'Shura and C'Axtal?]\n  &6[Barras]\n No. It is not my place to teach the ignorant and unworthy of their grand deeds. And despite the trust some of my brothers have\nfor you, I am not convinced of your merit.\n  &5[Can you tell me about C'Taz?]\n  &6[Barras]\n C'Taz is a fresh-faced Shaman. She is smart, but she is too eager to connect with the Narsens. It may be her downfall.\n  &5[What do you do here?]\n  &6[Barras]\n I keep the shrine and bear the reflections to maintain the sacred magic of this place. Very few can bear the load.\n  &5[It must take someone very special.]\n  &6[Barras]\n That is why I am here, outsider.\n  &5[I wonder if I could.]\n  &6[Barras]\n If you feel so cocky, then help me strengthen the magic here. Bear the load. Reflect or be rejected.\n  &5[I will.]\n  &6[Barras]\n Behind you is a door deeper into this shrine. Enter it. Prepare your mind. Challenges lie before you, and with them comes\nreflection.\n  &5[Maybe later...]\n  &6[Barras]\n I did not think you were ready. Go.\n&o  Enter the door in the shrine. Solve the puzzle within.\n  Puzzle 1:   Link   Puzzle Solutions Guide/Time to Reflect Puzzle_Solutions_Guide/Time_to_Reflect wikilink\n  After solving the Puzzle:\n&o  [1/2]: If you leave the trials of reflection for any reason you can continue where you left off by entering the door in the\nshrine room.\n&o  [2/2]: Hit the button. If the button is not there, open the chest in the room to make it appear. Then make your way through\nthe next room. Reflect on your journey.\n When you open the chest:\n&o   The Tlaxans fought for what they believed in - their home. The Narsens invaded their homes, stole their land, and went to\nwar. It all started with the Narsens. Is it their fault the Tlaxans turned to dark magic? What does that make the Empire?\n After hitting the button:\n&o\n  Puzzle 2:   Link   Puzzle Solutions Guide/Time to Reflect Puzzle_Solutions_Guide/Time_to_Reflect wikilink\n  After beating the parkour and opening the chest in the next room:\n&o   Even C'Zanil discovered regret. Yet decades later, after he is gone, his people he sacrificed it all for revile him. Barras\ncurses his name within this very temple. But he did it all for the Tlaxan way of life. Was it worth it for him to do what he\ndid?\n After entering the cage:\n&o  Find a way up the ladder. Reflect upon what it means to be an adventurer. Show your courage, but never rush in without\nthinking.\n  Puzzle 3:   Link   Puzzle Solutions Guide/Time to Reflect Puzzle_Solutions_Guide/Time_to_Reflect wikilink\n  After climbing the ladder and opening the chest:\n&o   What happened last though. The Plague... So many warnings to be safe. Was Bhairavi's recklessness due to her eagerness for\nknowledge? Or is it something more? She so desperately wants me to gather the wools... Is it wrong to doubt her motives, or is\nthat the very purpose of reflection?\n&o  Seek out the light of reflection to leave Velara then return to Barras. Table\n Barras\n  &6[Barras]\n You return. Have you reflected?\n  &5[I don't know.]\n  &6[Barras]\n Consider what you have seen. Then return to me.\n  &5[No.]\n  &6[Barras]\n Then return to me when you have. Do not disrespect this shrine.\n  &5[I... Have.]\n  &6[Barras]\n Indeed, you have. What have you learned?\n  &5[I have looked back on my adventures with the wools and begun to question...]\n  &6[Barras]\n And that is all I ask of you. I am impressed with you, outsider. Perhaps there is more to you than I expected. Keep those\nreflections with you. You have learned much today.\n  &5[Thank you.]\n  &6[Barras]\n Now with your reflection complete, the shrine will focus once again... Are you prepared?\n  &5[I am.]\n  &6[Barras]\n Texkei, amavoz, cin tekka.\n  &6[Barras]\n It is done. You have done better than I could ever imagine. Peace be upon you. You are one of us now.\n TIME TO REFLECT COMPLETE! Awarded a   Link   Sacred Herb Burner Sacred_Herb_Burner wikilink and the ability to teleport to and\nfrom   Link   Kaul's Arena Kaul wikilink using the statue near the   Link   Ta'Eldim Ta'Eldim wikilink Fountain.\n", "reward": "rewards =\n* &3Sacred Herb Burner&r\n* Usage of the teleporter between &3Ta'Eldim&r and &3Kaul|Kaul's Arena&r\n"}