{"name": "Treasure for the Future", "information": "prerequisites = * Completion of &3Salazar's Folly&r\n* &3Treasure of the Past&r\n* &3Xenophobia&r\n NPC: Zeroc Coords: -1475, 102, 932\n Celsian Isles Frostgate\nDifficulty = Medium\n", "dialogue": "}} \n  WorkInProgress}} \n&o  Travel to Mistport and seek out Zeroc's missing associate. Table  AlignDefault ColWidthDefault AlignDefault \n Zeroc \n  Coordinates: [-1475, 102, 932] \n   &6[Zeroc] \n I wonder if he found the right person already... \n  &5[Hi, are you Zeroc?] \n  &6[Zeroc] \n How do you know my name? Unless... Zulamar sent you here?  \n  &5[I have no idea who you're talking about.] \n  &6[Zeroc] \n Off you go then. \n  &5[That's right. He's a very interesting person, don't you think?] \n  &6[Zeroc] \n Yes, I suppose... However, you're not here to talk about him, right? \n  color|gray|He sighs. \n  &6[Zeroc] \n I suppose you have a lot of questions? Ask, I'll try to answer them.  \n  &5[Who are you?]  \n  &6[Zeroc] \n As you know already, my name is Zeroc. I'm a researcher from Steelmeld - an underwater complex that doesn't belong to the Ishnir desert or the Chillwind tundra. You should visit it some day, if you haven't already. \n  &5[Why did you decide to stay here, in Frostgate?]  \n  &6[Zeroc] \n I don't enjoy hot places, so I don't like being in Ishnir longer than I have to. Besides, Zulamar wanted to go there on his own. Wispervale is full of people that are a bit too curious for their own good, and Nightroost didn't have proper temporary housing due to their recent problems. Mistport on the other hand is too dangerous for extended visits. That left Frostgate as the best place for my research. \n  &5[Zulamar said you could tell me more about the remnants of the Viridian Empire.] \n  &6[Zeroc] \n In a sense. I sent an associate of mine to investigate the lead in Mistport, but I've since lost contact with them. If I had any other contacts in Mistport, this wouldn't be a problem, but alas. I do not. And traveling there myself presents its own danger, what with the unpredictability of those pirates.  \n  &5[That's a shame.] \n  &6[Zeroc] \n Indeed it is. \n  &5[Well, I'm the Captain of Mistport. I could go find your associate.] \n  &6[Zeroc] \n You're... the Captain of Mistport? Well, now, this changes things. This changes things quite a bit. If that's the case, I would greatly appreciate your help in retrieving this second artifact, just as with the first. I'll offer fair payment for your work, of course.  \n  &5[I'm not sure I have the time to help you.] \n  &6[Zeroc] \n Hm... Fine. You've certainly helped us enough already. We'll certainly be able to find a way past this roadblock ourselves. \n  &5[I suppose I have the time. I'll find this artifact for you.] \n  &6[Zeroc] \n Excellent. Your first step will be to locate my associate, and retrieve whatever information they managed to gather before we lost contact. Their name is Zyon, I trust you'll be able to find what happened.  \n&o  Search Mistport for any sign of Zeroc's missing associate, Zyon. Maybe someone knows what happened? \n  Boatswain Baxter \n  Coordinates: [-801, 81, 1339] \n   &5[Hello Boatswain. Would you happen to know the whereabouts of a person called Zyon?] \n  &6[Boatswain Baxter] \n Yarrg, can't say I do Cap'n. I just guard your boat.  Table  AlignDefault ColWidthDefault AlignDefault \n Drunk Pirate \n  Coordinates: [-830, 88, 1359] \n   &5[Hey. You. Do you know about someone called Zyon?] \n  &6[Drunk Pirate] \n *Hic* YaaaAArrr... *hic* ...Barteeender? \n  &5[Nevermind. I shouldn't have asked.] \n  &6[Drunk Pirate] \n *hic*  Table  AlignDefault ColWidthDefault AlignDefault \n Salty Bartender \n  Coordinates: [-829, 87, 1367] \n   &5[Bartender. Do you know anything about someone known as Zyon?] \n  &6[Salty Bartender] \n Zehahaha! I do, cap'n! That laddy waltzed on inter me pub, an' made a great ol' fool of 'emself! Got 'emself dragged off ter the brig, 'ey did! \n  &5[That's very helpful. Thanks for the information.] \n  &6[Salty Bartender] \n Zehahaha! A fine story costs me nothin', cap'n!  Table  AlignDefault ColWidthDefault AlignDefault \n Marcus \n  Coordinates: [-828, 82, 1307] \n   &5[Yes. Academy. Great. By the way, would you happen to know anything about a person called Zyon?] \n  &6[Marcus] \n I vaguely recall the name, but I can't remember where from. You'll have to ask elsewhere, I'm afraid.  Table  AlignDefault ColWidthDefault AlignDefault \n Alton \n  Coordinates: [-808, 81, 1308] \n   &5[Sorry to interrupt - but do you know anything about a person called Zyon?] \n  &6[Alton] \n Oooh... They were at the bar... I think...  \n  Prison Guard \n  Coordinates: [-809, 88, 1292] \n   &6[Prison Guard] \n Yar! Cap'n Xeno put me on duty fer' the prison, but now that he be gone, I guess I be watching it fer you now Cap'n [Player]. \n  &5[Is there a prisoner by the name of Zyon?] \n  &6[Prison Guard] \n Yar, so there be! Locked up by the First Mate his self, Cap'n! \n  &5[The First Mate? Did he give a reason?] \n  &6[Prison Guard] \n Under orders from Cap'n Xeno, he said! And ye know how Xeno was, Cap'n. Don't question him, or you be next in the brig!  \n  &5[I'll have to talk to First Mate Jones about this.] \n  &6[Prison Guard] \n Yar, good luck Cap'n! \n  &5[Can I speak to the prisoner?] \n  &6[Prison Guard] \n Of course, Cap'n [Player]!  Table  AlignDefault ColWidthDefault AlignDefault \n Zyon \n  Prison Cell \n   &6[Zyon] \n G-gah! What do you want now, pirates?! I don't have anything to tell you!  \n  &5[Arrgh! Yer set fer execution, prisoner!] \n  &6[Zyon] \n Ack! No, no, I can get out of this somehow... \n  &5[You're Zyon? Zeroc sent me to find you.] \n  &6[Zyon] \n He did?! That's- that's great news! Quick, get me out of here, I've been locked up in here for far too long!  \n  &5[You know, you could have just asked the chicken outside for help. Worked for me.] \n  &6[Zyon] \n Wh- Huh? What does that even mean? \n  &5[What did you do to get locked up in here?] \n  &6[Zyon] \n Well... I snuck aboard Captain Xeno's ship, searching for anything they might have known about the artifact! And I did find something! A document which mentioned something they found in Viridis. I went to the bar, the Salty Seaswindler, to celebrate. But then, who do I run into but the First Mate himself! \n  &5[So he locked up up for breaking into the captain's ship?] \n  &6[Zyon] \n What? Oh, no. I just... I made a bit of a fool of myself. How was I supposed to know that singing off key was enough to get someone locked up in prison?! It's ridiculous, really...  \n  &5[...Right. Well, thanks for the information. I'm going to go now.]  \n  &6[Zyon] \n Oh... You're just going to- Alright, sure, I'll just wait for you to get back I guess! \n  &5[Thanks for the information, I'll tell the guards to let you out.]  \n  &6[Zyon] \n Y-yes, of course! It's my job, after all! Just... I'm never coming to Mistport again.  Table  AlignDefault ColWidthDefault AlignDefault \n Prison Guard \n  Coordinates: [-809, 88, 1292] \n   &6[Prison Guard] \n Yar! Cap'n Xeno put me on duty fer' the prison, but now that he be gone, I guess I be watching it fer you now Cap'n [Player]. \n  &5[As Captain of Mistport, I order you to release the prisoner.] \n  &6[Prison Guard] \n Aye aye, Cap'n! Less work fer me to do!  \n&o  Speak to First Mate Jones to travel to the Viridian Vault. Table  AlignDefault ColWidthDefault AlignDefault \n First Mate Jones \n  Coordinates: [-761, 81, 1344] \n   &6[First Mate Jones] \n Ahoy Captain [Player]. Good job getting us into that city. We're lootin' good tonight. \n  &5[I hear you locked someone in the brig under Captain Xeno's orders.] \n  &6[First Mate Jones] \n So I did! Captain Xeno wanted any number o' people locked up, Captain. Ye can't truly expect me to remember every troublemaker we locked up, can ye? \n  &5[Does the name Zyon ring any bells?] \n  &6[First Mate Jones] \n Ah! So it does. They found somethin' we want to keep fer ourselves, ye hear? Treasure, Captain, for all of us! In the lost city, there be a vault, of sorts. It be heavily defended, ye must 'ave missed it when ye went through the city. Xeno thought it be too dangerous to loot then, and left it fer later. \n  &5[That vault may be what I'm looking for. Is there any way we could go there?] \n  &6[First Mate Jones] \n So ye think ye can handle it? If ye say so, Captain! I'll get the whole crew together, we'll make an event of it! Yarharharg!  \n  If you want to leave: Table  AlignDefault ColWidthDefault AlignDefault \n First Mate Jones (Vault) \n  Coordinates: [] \n   &6[First Mate Jones] \n Ahoy, Captain! Anythin' ye need from me? \n  &5[Can you take us back to Mistport?] \n  &6[First Mate Jones] \n Of course, Captain!  \n If you want to return: Table  AlignDefault ColWidthDefault AlignDefault \n First Mate Jones \n  Coordinates: [-809, 88, 1292] \n   &6[First Mate Jones] \n Ahoy Captain [Player]. The crew be set to return to the lost city! Are ye ready to go?  \n  &5[I need a moment to prepare.] \n  &6[First Mate Jones] \n Take yer time Captain. Wouldn't want ye to die tryin' to loot the vault, eh? \n  &5[I'm ready to go.] \n  &6[First Mate Jones] \n Arr! Let's get that treasure, Captain!  \n &o  Attempt to open the Viridian Vault. \n  &6[Second Mate Gary] \n Arrgh. Ze treasure is zis way, Cap'n. \n  &6[Third Mate Stevens] \n 'ello Cap'n. Pleasure to meet ya for th' first time. Let's go get this 'ere treasure, eh? \n Walking into the circular room: \n  &6[Echoing Voice] \n You again... One sacred relic claimed, now onto the second? Why do you seek these dangerous weapons...? \n  &6[Echoing Voice] \n Whatever your aim... Your quest is doomed to fail. No good will come of these relics, mortals... \n  &6[Echoing Voice] \n Another test may prove your will. Defeat the guardian... Unseal the vault... And this relic will be yours. \n After defeating the guardian: \n  &6[Echoing Voice] \n Very well... You have proven your strength, as you proved your will before. Come forth... Reclaim this sacred relic. \n&o  Speak to the spirit within the vault. Table  AlignDefault ColWidthDefault AlignDefault \n Izumur AlignDefault \n  &6[???] \n You are... [Player]. Yes, I remember your work in the city... So you have now claimed all three of Salazar's great treasures, then. \n  &5[Who are you?] \n  &6[Izumur] \n I am... Izumur. I have protected this empire... From its birth, to its fall, and yet beyond. And you... You must have a reason to reclaim these relics. To have traveled to find both... Tell me, what is it you seek? \n  &5[I have been told they can be used to restore the empire.] \n  &6[Izumur] \n Ah... I understand, now. You have been misled, I am afraid. The relics you have claimed... they can not be used for such means. \n  &5[What do you mean?] \n  &6[Izumur] \n These weapons you now hold... They were part of a mechanism, yes. But not one of Viridian origin. They do not belong in these ruins... And the danger they pose has kept me vigilant.  \n  &5[Danger?] \n  &6[Izumur] \n Hm... These relics... they hold great power, even in their damaged state. I fear the strength they would offer, in the wrong hands... \n  &5[They're not of Viridian origin? Where are they from?] \n  &6[Izumur] \n I am afraid I could not tell you. I have rested in my domain for many years, mortal... I know little of the world beyond. However... I can tell you of the man who brought them here. \n  &6[Izumur] \n He traveled here, with his Knowledge and these two weapons of silver sheen. He built his empire with their power... yet when he had no more use for such, he sealed them away. Even as he disappeared, his fear had kept him from wielding them anew.  Plain  (Either ends converstation) \n  &5[What should I do with them then?]  \n  &6[Izumur] \n Hm... These relics... they hold great power, even in their damaged state. I fear the strength they would offer, in the wrong hands... \n  &5[If they don't belong here, I can return them to their rightful place.]  \n  &6[Izumur] \n They are in your hands, now. Do what you will... But be away of the power they hold. I trust you will do what is right, mortal. Now, all I wish is to rest...  \n Dialogues after: \n  &6[Izumur] \n Hm... I see you have come with a crew. In truth, I do not mind the raiders. Their desire to claim the forgotten things of my domain... It comforts me, to know some may find value in such remnants. \n  &6[Second Mate Gary] \n Arrgh. Ze treasure is ourz now, Cap'n. \n  &6[Third Mate Stevens] \n Excellent work out there, Cap'n. Time to go get us our treasure, eh? \n&o  Speak to First Mate Jones to return to Mistport. Table  AlignDefault ColWidthDefault AlignDefault \n First Mate Jones (Vault) \n  Coordinates: [] \n   &6[First Mate Jones] \n Ahoy, Captain! I see ye've opened the vault! Excellent work. Are we set to get to lootin'? \n  &5[The treasure's all yours, Jones. I need to get back to Mistport.] \n  &6[First Mate Jones] \n Arr! I'll bring ye back, Captain. The crew will get goin' while yer gone!  \n&o  [1/2]: Return to Zeroc in Frostgate with the artifact. \n&o  [2/2]: If you lost the artifact, you can speak to First Mate Jones to return to the vault. Table  AlignDefault ColWidthDefault AlignDefault \n Zeroc \n  Coordinates: [-1475, 102, 932] \n   &6[Zeroc] \n Hm... \n  &5[Zeroc, I'm back.] \n  &6[Zeroc] \n Ah! There you are. I received a message from Zyon telling me you freed them. I suppose that means you've had luck with your search? \n  &5[I have! I've retrieved the second artifact.] \n  &6[Zeroc] \n You- you have? That's excellent news! Yes, We're getting rather close to achieving our goals! Soon, we'll have restored the Viridian Empire! Just think of the technology we'll be able to retrieve! \n  &5[But I learned that the artifacts can't actually restore the empire.] \n  &6[Zeroc] \n What? Where did you learn this information? \n  &5[Well, I met a genius loci at the resting place of this relic, and-] \n  &6[Zeroc] \n Bah. That's hardly a source of information at all! You'd have me discard years of research and abandon my goals because of a spirit we can't even be sure exists? \n  color|gray|He takes a moment to compose himself. \n  &6[Zeroc] \n Ahem... My apologies. I truly do appreciate your hlep, but we will continue on from here, regardless of what you may believe. \n  &5[Alright. I'll see this through.] \n  &6[Zeroc] \n Excellent. Now... We just need to discern where these artifacts can be used. I've been taking some time to decipher some of these texts which Zulumar has accessed from Alnera's archives, but we haven't quite gotten it yet. \n  &5[If it helps, I learned that King Salazar brought them with him before he founded his empire.] \n  &6[Zeroc] \n Interesting. Before the empire... I believe I have something just like that. Give me a moment... \n  color|gray|He rummages through a pile of documents. \n  &6[Zeroc] \n Aha! Here we are. From what I can gather, it's a section of a journal written by the King of his travels before he ruled Viridia. While you discern where we need to travel to use these artifacts, I'll attempt to contact Zulumar so we can meet you there.  \n&o  Find the location of the mechanism based on Salazar's journal. Zeroc can provide another copy if necessary. \n  The place the diary is referencing is   Link   Silver Tower Silver_Tower wikilink  's basement. \n  After entering: \n&o  Search the ruins beneath the Silver Tower for any signs of the mechanism. \n  &6[Zeroc] \n Now, this... This is remarkable. I would have never guessed that something this expansive could be hiding just beneath the surface! We're close, I can feel it. Table  AlignDefault ColWidthDefault AlignDefault \n Zulamar AlignDefault \n  &6[Zulamar] \n Yes, yes, hello again! I hear you got the second artifact all on your own, without my help! \n  &5[I got the first one mostly on my own as well.] \n  &6[Zulamar] \n Well... That's neither here nor there. Now- we're very close to achieving our goal! Are you excited? I'm excited. I can tell Zeroc is as well.  \n In the next area: Table  AlignDefault ColWidthDefault AlignDefault \n Zeroc AlignDefault \n  &6[Zeroc] \n Two statues... Yes, this is fascinating. The architecture doesn't mat what we've seen in other Viridian ruins... Though, I suppose that would match our timeline.  \n  &5[What should we do now?]  \n  &6[Zeroc] \n We keep searching. Zulamar went ahead, you can see if he's found anything. \n  &5[Can you give me the artifacts?] \n  &6[Zeroc] \n Ah. Yes, of course. You're best equipped to activate the mechanism, after all.  Table  AlignDefault ColWidthDefault AlignDefault \n Zulamar AlignDefault \n  &6[Zulamar] \n Yes, yes, there you are. Take a look at this. Seems something was held here before, yes?  \n  &5[It looks like it may have been a Wool.]  \n  &6[Zulamar] \n A wool? Are you certain? This seems a touch grand for something so mundane, yes? \n  &5[Nevermind. Have you found the mechanism yet?] \n  &6[Zulamar] \n Not yet, no. It must be further into this place, then. You can go on ahead, yes? I'd like to see if I can discern what was held here. \n  &5[Whatever it was, it's long gone now.]  \n  &6[Zulamar] \n So it is! Well, in any case, have you had any luck finding our mechanism?  \n  &5[I cam here to ask you the same thing.] \n  &5[No luck yet.] Plain  (Both answers lead to the same line) \n  &6[Zulamar] \n It must be further into this place, then. You can go on ahead, yes? I'd like to see if I can discern what was held here.  \n When you interact with the knight: \n  color|gray|It's a knight in silver armor. It doesn't stir as you approach. It's armor looks damaged, and there's no sign of life inside the helmet. \n After putting in both artifacts to each pedestal: \n  color|gray|The room begins to shake, as the glow from the artifacts fades...}} \n  color|gray|The exit slams shut behind you, and the chamber begins to flood with defenders. \n After beating the waves of defenders: \n  color|gray|You manage to break past the defenses, and escape the chamber. The passage collapses behind you. \n  color|gray|The cavern is still shaking... You need to find Zeroc and Zulamar and get out of this place, quickly. \n&o  Find Zeroc and Zulamar and escape the ruins. \n  &6[Zeroc] \n ...yes, Zulamar, I understand! But I can't get this open if you keep- \n  &6[Zulamar] \n There must be a reason the exit's shut! If we tried to search for a way to deactivate whatever caused it, we'd be able to- \n  &6[Zeroc] \n And as I told you before, we do not know how long we have, Zulamar! If we don't get this open quickly, we don't know what could happen! \n  &6[Zulamar] \n Oh, Zeroc, It's [Player]! What happened? You went off on your own, and then all the exits shut, and the cavern began to shake, yes? \n  &6[Zeroc] \n Hm... You went off on your own? Could that possibly mean you discovered the mechanism? Is that what has caused this? Did it not- \n  &6[Zulamar] \n Zeroc, we don't have time for such questions! We can discuss later, for now we have to... \n  &6[Zulamar] \n Aha! There we are! Now, let's get out of here before it's too late, yes? \n&o  Speak to Zeroc. Table  AlignDefault ColWidthDefault AlignDefault \n Zeroc AlignDefault \n  &6[Zeroc] \n What was that? That was the mechanism, yes? Did you place the relics properly? How could it have possibly failed? \n  &5[Yes, it was the mechanism, and I placed the relics correctly. I told you earlier, the mechanism-] \n  &6[Zulamar] \n Ah! Sorry to interrupt, but we should leave this place. It's far too cold and dark down here! We can regroup in Frostgate, yes? \n  &5[Zulamar's right. We can't stay here.] \n  &6[Zeroc] \n You're right... You're right, of course. Let us go.  \n&o  Speak to Zeroc in the Frostgate Inn. Table  AlignDefault ColWidthDefault AlignDefault \n Zeroc AlignDefault \n  &6[Zeroc] \n This expedition was a disaster... We've lost both relics, and the mechanism to restore the empire failed. \n  color|gray|He sighs. \n  &5[Zeroc, I told you the mechanism was never going to work.] \n  &6[Zulamar] \n So you did. I didn't list, of course, and it nearly got us killed. I'll have to do some thinking on this whole matter. And the structures down there.... If only we spent more time investigating them. \n  &5[Maybe someday you'll find another way to regain the lost knowledge you wanted.] \n  &6[Zeroc] \n Perhaps. Perhaps not. In any case, I suspect I'll have to return to Steelmeld soon. I'll have more resources at my disposal there. \n  &5[What about Zulamar?] \n  &6[Zeroc] \n Oh, we'll still work together for the time being. He seems as invested in this cause as I am, so we'll keep working towards it. \n  color|gray|He takes a moment to think. \n  &6[Zeroc] \n Yes, regarding your payment. I have these crystalline shards, of course... Ah, here we are. In the time you spent away, I asked Zulamar to create a replica of our second artifact. I'll give this to you as well. Will this be sufficient? \n  &5[Sounds good.] \n  &6[Zeroc] \n Excellent. No matter how it ended, I appreciate your assistance with this expedition.  \n  color|teal|'''TREASURE FOR THE FUTURE COMPLETE!'''<br>\nAwarded [[Blade of Exaltation]] and 64 Compressed Crystalline Shards! ", "reward": "rewards =\n* &3Blade of Exaltation&r\n* 64 Compressed Crystalline Shards\n"}