{"name": "Treasure of the Past", "information": "prerequisites = &3The Lost Empire&r\n NPC: Zulumar Coords: 391, 57, 730\n Celsian Isles Alnera\nrelated_poi=&3Sunken Tomb&r\n", "dialogue": "}} \n  WorkInProgress|Double check, fill out more}} Table  AlignDefault ColWidthDefault AlignDefault \n Zulumar \n  Coordinates: [391, 57, 730] \n   &6[Zulamar] \n Oh, you've finally come! It feels like I'd been waiting forever for you.  \n  &5[I should probably go... ]  \n  &6[Zulamar] \n You may leave now, but sooner or later you'll come back. Think about it! \n  &5[Who are you, and why were you waiting for me?] \n  &6[Zulamar] \n My name is Zulamar. But my name won't tell you much about me- I'm here to make a deal.  \n  &5[All of this looks very suspicious... I think I'll go...]  \n  &6[Zulamar] \n You may leave now, but sooner or later you'll come back here. Think about what you can achieve! \n  &5[A deal? I'm interested...] \n  &6[Zulamar] \n Good. You don't ask troublesome questions like the others, and you don't back down either.  \n  &5[Wait! I changed my mind... I think I'll refrain from your offer.]  \n  &6[Zulamar] \n You may leave now, but sooner or later you'll come back here. Think about what you can achieve! \n  &5[...] \n  &6[Zulamar] \n Well, let's get to the point. \n  &6[Zulamar] \n According to ancient legends, there used to be a prosperous empire with a king that was very greedy for knowledge. The only legacy left of this empire are ruins, proudly towering over the ocean. \n  &6[Zulamar] \n All kingdoms have their secrets, and the Viridian Empire was no exception. Ancient texts say that King Salazar had two cursed artifacts, yet he was afraid to use them.  \n  &5[Sounds like a fairy-tale. Wait, are you trying to make a fool of me?]  \n  &6[Zulamar] \n (Missing) \n  &5[Afraid? Why?]  \n  &6[Zulamar] \n That's none of your concern right now. But, I might tell you once you've helped me. \n  &6[Zulamar] \n I digress. As it turns out, one of those artifacts is hidden deep underground, under the Sunken Tomb to the northwest. I don't know what dangers lie within, but be careful! Once you're inside, seek out a hidden door; it should open up to a secret chamber that holds great treasure. Good luck!  \n C:   &o  Head to the   Link   Sunken Tomb Sunken_Tomb wikilink and search for a hidden chamber.  Plain  The hidden chamber can be entered by pressing a button on the back wall inside the tomb. There is a creeper spawner next to the button, so be wary that it may be destroyed by a creeper explosion. \n&o  You press the button. There is a loud banging sound right next to your ears. You start to lose consciousness. \n&o  Suddenly, you find yourself inside a large structure with a high ceiling. \n C:   &o  Find a way to retrieve the cursed artifact from the temple. \n&o  As you move inside the temple, you notice a large eye looking directly at you \n&o  A magical barrier blocks your way. Perhaps you should examine this room? \n  &6[???] \n Prove yourself worthy to possess this sacred relic or begone!  Plain  The button to progress is located under the bridge on the wall toward the entrance of the room. Plain  After pressing the button, a second button will appear inside the drain pipe in the back left corner of the room. Swim inside the pipe and press the button to remove the magic barrier. \n If you try to enter without removing the barrier: \n&o  A magical barrier restrains you from entering... \n&o  You hear a crackling sound \n&o  After a moment, a splash of water is heard at the other end of the room \n After pressing the button: \n&o  Echoes are heard all over the hall. It seems that barrier has been broken! \n  &6[Menacing Voice] \n You did it, mortal. Maybe you're not so hopeless... \n C:   &o  [1/2]: Return to Zulamar in Alnera. \n C:   &o  [2/2]: If you lose the artifact you can get it back from the hidden chamber. Table  AlignDefault ColWidthDefault AlignDefault \n Zulumar AlignDefault \n  &6[Zulamar] \n You got it? Well, show it to me, quickly! \n&o  He seems both a little bit nervous and excited at the same time.  \n  &5[I have it right here.]  \n  &6[Zulamar] \n Yes, just like he said! Legends don't lie, truly! Plain &o  He takes the artifact from your hands and you notice a gleam in his eyes. \n  &5[Excuse me- care to tell me what this is all for?] \n  &6[Zulamar] \n Well, I guess I can tell you. The artifact you retrieved from the sunken tomb is not a simple relic of the past, but is instead a part of a mechanism that potentially could be used to restore the Viridian Empire to its former glory. I can't tell you the details- I'm not sure of them myself- but my employer will surely be able to answer your questions. He should be in Frostgate. His name is Zeroc- I'll let him know you helped me here. Now, where was I... \n  &5[In a hurry? You look nervous...]  \n  &6[Zulamar] \n Huh? What? Why does it bother you so much? Plain &o  He looks away from you and tries to examine the artifact. \n  &5[You send me after a relic you aren't sure exists, refuse to tell me about yourself, and now you try to ignore me. I need answers.] \n  &6[Zulamar] \n FINE! Fine! Calm down! I'll tell you what you want to know, just- calm down. \n  &6[Zulamar] \n The artifact you retrieved from the sunken tomb is not a simple relic of the past, but is instead a part of a mechanism that can be used to restore the Viridian Empire to its former glory. I can't tell you the details- I'm not sure of them myself- but my employer will surely be able to answer your questions. He should be in Frostgate. His name is Zeroc- I'll let him know you helped me here. Now, where was I... \n  &5[I see. Let's talk about my reward now...] \n  &6[Zulamar] \n Ah, yes! Reward, indeed... You see, I have nothing but these shiny crystals- er, crystalline shards... \n&o  He frowns a bit and thinks for a second. \n  &6[Zulamar] \n Although... I can make a replica of this spear and imbue it with either the power of lightning, fire, or ice- whichever one you want. But choose wisely- once you pick one, there is no going back.  \n  &5[A little thunder and lightning never hurt anyone except my enemies.] \n  &5[Carving a flaming path of fire through my opposition. I like the sound of that.] \n  &5[A slow enemy is a vulnerable enemy. I think I'll freeze my targets with ice.] \n  &6[Zulamar] \n Here you are. Leave me be- I have an artifact to examine.  \n TREASURES OF THE PAST COMPLETE! SoftBreak  Awarded   Link   Apotheosis Spear Apotheosis_Spear wikilink  , 28 Compressed Crystalline Shards! ", "reward": "rewards =\n* &3Apotheosis Spear&r\n* 28 Compressed Crystalline Shards\n"}