{"name": "Unconventional Methods", "information": "prerequisites = * &3Unraveled&r\n* &3Mechs Machina&r\n* and completion of the &3Cradle of the Broken God&r dungeon.\n NPC: The High Priest Coords: -446 181 -86\n Architect's Ring New Antium\nDifficulty = Hard\nLength = Long\n", "dialogue": "&o  Meet with the High Priest and the Praetor to discuss destroying Shades for good. Table\n The High Priest\n  Coordinates: [-446 181 -86]\n   &6[The High Priest]\n The Architect's blessings upon you [Player]. What can I do for you?\n  &5[I've found Neo Antium and stopped the Machine God.]\n  &6[The High Priest]\n Praytell, you've done what?!\n  &5[* You tell the High Priest about your journey in the Cradle of the Broken God *]\n  &6[The High Priest]\n Amazing. So the Machine God was one of these wools? This is what Pelias was searching for, all those decades ago? And the\nShades were caused by him?\n  &5[Yes, to all of that. With the Wool under my protection, no more Machines should take over citizens.]\n  &6[The High Priest]\n The Architect will surely bless you. After all of these disasters, it is truly special to get such good news. Perhaps soon the\nShades will vanish? {...}\n  &6[The High Priest]\n I'll invite the Praetor here immediately to discuss this matter. Will you attend?\n  &5[Of course.]\n  &6[The High Priest]\n Excellent news. I'm sure he shan't be long. {...}\n  &6[The Praetor]\n Hello Grigor. Hello [Player]. Your messenger informed me you seek information in the conquest of Shades. I believe I need to be\na part of this mission, so here I am. {...}\n  &6[The Praetor]\n I must say though, I am shocked I’ve not burst into flames stepping foot in this chapel, for all the evil you claim I’ve done,\nfather. {...}\n  &6[The High Priest]\n It seems the Architect hasn't given up on you yet, Nacreus. We'll see how long that lasts. We have much to discuss. {...}\n  &6[The High Priest]\n [Player] has claimed the heart of the Machine, the very artifact Pelias sought before he vanished. The Brown Wool. {...}\n  &6[The High Priest]\n With it taken, the Machine creatures cannot be reformed, but the Shades still seem to carry on forever. We search for a way to\ndestroy them.\n  &5[How do we even go about that?]\n  &6[The Praetor]\n We use the Machine of course. The Brown Wool? You've claimed such a powerful relic; it only stands to reason to bring forth its\npower onto the monstrosities it created, yes?\n  &5[I'm not so sure that's a good idea...]\n  &6[Bhairavi]\n That's definitely not a good idea. {...}\n  &6[The High Priest]\n Excuse me? Who are you, barging into this closed meeting?\n  &5[Bhairavi! What are you doing here?]\n  &6[Bhairavi]\n I came to find you after hearing you went wool hunting without us again!\n  &5[Sorry. They just keep popping up unexpectedly.]\n  &6[Bhairavi]\n Just don't leave me out of the next one, okay? Anyway, hello. You must be the leaders of New Antium. {...}\n  &6[The High Priest]\n One of them, yes. The Praetor over there is the other. You know [Player] then?\n  &5[She's part of my team that helps seek out and contain wool and other threats. This is Bhairavi.]\n  &6[The Praetor]\n I welcome you to New Antium on behalf of the true leadership. Now, why can we not use the artifact? {...}\n  &6[Bhairavi]\n The short of it is that the wool are dangerous. Even with enough skill to direct their power, these wool have a mind of their\nown.\n  &5[Everyone we're aware of who have used wool don't end up well... Many died.]\n  &6[Bhairavi]\n We've yet to try using them ourselves. [Player] has gained magical power from collecting them, but if we can avoid it, it seems\nbest to keep them safe and unused.\n  &5[If the Brown Wool could create Neo Antium while contained, I don't want to take any risks.]\n  &6[The High Priest]\n What they say rings true to the Codex, Nacreus. These artifacts are dangerous and should never be touched. They were sealed\naway by the Architect's divine truth. Who are we to question God?\n  &5[Is there another way we could approach the Shades now that we have Brown ourselves?]\n  &6[The High Priest]\n I have one other thought. This isn't a guarantee, mind you, but as the High Priest of New Antium and the de facto head of the\nSilver Codex, I'm supposed to have access to the Silver Cathedral's knowledge. {...}\n  &6[The High Priest]\n Instead, a wealth of ancient texts and knowledge are lost, contained by the dangers of the Shades that lurk inside. Deep below,\nancient Emperors of the Silvari are honored in sacred tombs. {...}\n  &6[The High Priest]\n In my authority, I can request that one tomb be opened to seek their wisdom from generations past, in situations of great need.\n  &5[Any Emperor in particular I should seek, then?]\n  &6[The High Priest]\n The original. Uriddan, our Silver Protector. His body is not there, but there is said to be an honorary tomb for him, created\nafter he... ascended. I would not ask this of you if we were not desperate, but I think you should enter this place. {...}\n  &6[The High Priest]\n Search for something that might help. See if his holiness left something for future generations. Surely he knew of the wool you\nfound if he created the barrier that contained it.\n  &5[I'll get right on it.]\n  &6[Bhairavi]\n While you're gone [Player], I'll spend some time with the Praetor and the High Priest and discuss further plans for our\ninvolvement. {...}\n  &6[The Praetor]\n Be safe in your journey, [Player]. The Quelled Convent is a dangerous place. I've lost several Shade Hunters to the\nmonstrosities lurking within. The catacombs below are even worse. We believe in your will and your might.\n&o  C: Find Emperor Uriddan's tomb within the crypts of The Quelled Convent.\n  Coordinates: [-319, 146, -48]\n  Reaching the tomb:\n  Pray to the shrine?\n  &5[Yes.]\n  You feel a dark force pulling you in... Will you let it? You may not be able to return.\n  &5[Yes.]\n&o  C: Let the Darkness guide you. Table\n Darkness (First Tomb)\n  &6[Darkness]\n You intrude upon one of my emperor's tombs. {...}\n  &6[Darkness]\n I know why you are here. Only Emptiness can disrupt what Energy has wrought. {...}\n  &6[Darkness]\n You may take the Spear. You must find that Emptiness yourself. I have no time for foolish quests. Leave.\n&o  C: Return to the Praetor, the High Priest, and Bhairavi with the spear. Table\n The High Priest\n  Coordinates: [-446 181 -86]\n   &6[The Praetor]\n Our mightiest of warriors returns, living still, I presume? What did you find?\n  &5[I met some sort of... darkness? It spoke to me and gave me this spear. It also implied using Void can destroy Shades.]\n  &6[The High Priest]\n What is Void? {...}\n  &6[Bhairavi]\n Void is a by-product of the Veil being destroyed. It hangs, separate from the material protecting our world. If it ever touches\nreality again, it becomes a corrosive blackened goop. It's incredibly dangerous. {...}\n  &6[The High Priest]\n ... What is the Veil?\n  &5[Don't worry about it for now. We should find some Void goop that this spear might be able to channel. Do we have any left\nfrom the Congress, Bhairavi?]\n  &6[Bhairavi]\n None that we can transport across an ocean. It doesn't last long once you start messing with it.\n  &5[So we need to find some here. The Darkness wouldn't let me take any from the tomb, but suggested there was more. Do you\nhave any ideas, father?]\n  &6[The High Priest]\n I do not. {...}\n  &6[The Praetor]\n I'm not sure how a spear helps us kill shades. We do that all the time.\n  &5[No, like, for good. Void is a foundational material of the universe. It could end this.]\n  &6[The Praetor]\n Praytell, what does that mean for us then? How do we find it? {...}\n  &6[Bhairavi]\n Emptiness is associated with Void itself. Perhaps that emptiness would destroy these Shades for good?\n  &5[Have you or your Shade Hunters ever seen anything like that? Or maybe just any other tombs for Uriddan? The Darkness\nimplied there are others.]\n  &6[The Praetor]\n Other tombs? What possibly could Emperor Uriddan need with more tombs? We have no true evidence that he ever died in the first\nplace. {...}\n  &6[The High Priest]\n Surely he did not. These tombs are honorary. If there is another, it must be somewhere that felt the need to honor his legacy\nas well.\n  &5[Is there such a place?]\n  &6[The Praetor]\n There was once much more to that Dominion outside our walls. Before the furious grasp of the Coven took hold, it was once a\ngrand site of worship for the Architect and his Silver Knights. It's since been perverted into a ritual site for dark magics.\n{...}\n  &6[The Praetor]\n The Shade Hunters have never been able to delve into the deeper sections of that place. The Coven doesn't allow much travel\noutside our walls. Perhaps you can search there?\n  &5[That sounds perfect.]\n  &6[The Praetor]\n I'm not completely certain how you'd get deeper inside. Much of the place has collapsed. Searching through rubble might be your\nbest chance.\n&o  C: Search the Bewitched Dominion for deeper passages... Be sure to bring the spear, and be prepared to have to dig through\nsome rubble.\n  Dig through the gravel at Coordinates: [-757, 83, -136]\n  After reaching the tomb:\n&o  C: Explore the deeper Darkness. Table\n Darkness (Second Tomb)\n  &6[Darkness]\n Again, the hero rides forth, spear in hand, seeking promised Emptiness, defiling my Emperor's tombs yet again. {...}\n  &6[Darkness]\n Emptiness is a valuable commodity. Most of what is left belongs to me. {...}\n  &6[Darkness]\n You were told to find your own source.\n After beating Darkness: Table\n Darkness (Second Tomb)\n  &6[Darkness]\n I see. You seek to stand against this Darkness. Perhaps a proof of power is needed. Do not seek me again. {...}\n  &6[Darkness]\n Open your mind to Nihilo...\n  The spear in your inventory completely fills with Void.\n&o  C: Return to the Praetor, the High Priest, and Bhairavi with the Void-filled spear. Table\n The High Priest\n  Coordinates: [-446 181 -86]\n   &6[The Praetor]\n The hero returns once more. I sense a strange darkness clinging to you. What did you find?\n  &5[I found the Darkness again. It said Void is rare here, but filled my Spear to \"prove\" that it works. I don't think he'd\ntake kindly to us visiting him again.]\n  &6[Brayllur]\n Great see you again [Player]! We discuss with Praetor here. {...}\n  &6[The High Priest]\n To test this on a shade... Ah, I know. Not just any Shade... {...}\n  &6[The Praetor]\n Indeed. If we're going to permanently end a Shade, there is only one such being we should end. {...}\n  &6[The High Priest]\n Pelias.\n  &5[But I killed him in the Machine to get the Wool.]\n  &6[The High Priest]\n He reformed, as do all Shades. Your friend Brayllur here has said so. {...}\n  &6[Brayllur]\n Hail-hi little fighter. They say true, metal king reform in shiny city. I try fight but just clangs and bruising!\n  &5[Hi Brayllur! Sounds like Pelias is the perfect target then. Did he say anything?]\n  &6[Brayllur]\n No words, only standing. Seems not breakable.\n  &5[Oh. That's new.]\n  &6[Brayllur]\n I meet you friend down at city start, yes?\n  &5[That sounds like a plan. We'll be back once we have news.]\n  &6[The Praetor]\n Swift travels. {...}\n  &6[The High Priest]\n May the Architect bless you. {...}\n  &6[Bhairavi]\n I'll be eagerly waiting for the results of your experimentation!\n&o  C: Meet Brayllur in the Brown Dungeon lobby to travel back into Neo Antium. Be sure to bring the Void-filled spear. Table\n Brayllur (Brown Lobby)\n  &6[Brayllur]\n Greetings again puny-friend! You ready for going?\n  &5[I am!]\n  &6[Brayllur]\n Yes then go we do. Come come.\n ''C: Neo Antium is in lockdown! Work with Brayllur to break through security.'\n  The puzzles are randomized, but you use the maps to connect all the gears without any loose ends.\n  Brayllur (Puzzle Area 1)\n  &6[Brayllur]\n Humph! They want no Brayllur back to bang and clang, see. Lock!\n  &5[Any idea how to unlock it?]\n  &6[Brayllur]\n Found these nearby.  Table\n Brayllur (Puzzle Area 2)\n  &6[Brayllur]\n Guhh\n&o  C: Pelias stands before you. Take the spear and end him once and for all. Table\n Brayllur (Puzzle Area 3)\n  &6[Brayllur]\n More wires... GRUHH! Power up. After, take spear. Place into king man's heart. Emptiness. Nothingness...\n  &5[I need some wires, right?]\n  &6[Brayllur]\n Yuh, have here.\n If you try to hurt Pelias without the spear: LineBreak   Nothing happens. You need the Spear to damage him.\n If you try to hurt Pelias with the security system up: LineBreak   Nothing happens. The security system remains active.\n After taking the security system down:\n  The Void within the spear drains...\n  &6[Brayllur]\n Over. He gone. Do not like that feeling. Remind me of Congress... Now. Go back. I stay. I watch.\n&o  C: Leave Brayllur be and return to the church later to meet with the High Priest and others.\n After leaving:\n&o  C: Return to the Praetor, the High Priest, Bhairavi, and Brayllur. Table\n The High Priest\n  Coordinates: [-446 181 -86]\n   &6[Bhairavi]\n Thank you all for reconvening here. It's been about a week since [Player] went back into Neo Antium to test the Void Spear on\nPelias' Shade. {...}\n  &6[Bhairavi]\n My associate, Brayllur, has been standing guard for all this time and has wonderful news. Pelias is gone. The spear worked!\n{...}\n  &6[Brayllur]\n Yes yes. King-man-shade gone forever. Only nothing where he was.\n  &5[This is fantastic news!]\n  &6[Bhairavi]\n Thank you all for reconvening here. It's been about a week since [Player] went back into Neo Antium to test the Void Spear on\nPelias' Shade. {...}\n  &6[Bhairavi]\n My associate, Brayllur, has been standing guard for all this time and has wonderful news. Pelias is gone. The spear worked!\n{...}\n  &6[Brayllur]\n Yes yes. King-man-shade gone forever. Only nothing where he was.\n  &5[This is fantastic news!]\n  &6[The Praetor]\n I can barely believe it! How do we begin the process of gathering and spreading the Void matter so we can continue to finish\noff Shades? {...}\n  &6[Bhairavi]\n Right now, we're still not sure. I want to coordinate with you and the High Priest now that we know for sure Pelias is gone to\ntry and find another source of Void that we can use. {...}\n  &6[The High Priest]\n You mean we can't kill more yet?\n  &5[No. The spear emptied the moment I stabbed Pelias.]\n  &6[The High Priest]\n And you can't transport more from that Congress place Bhairavi mentioned? {...}\n  &6[Bhairavi]\n I don't think so. It doesn't take well to being moved, normally.\n  &5[We'll have to seek it out somewhere in the Ring.]\n  &6[Bhairavi]\n That's where you each come in. As you send out forces, seek out pockets of Void. We will leave the Spear with the Praetor, and\nonce you've located material, use the Spear to absorb it and then to destroy another Shade. This will not be a fast journey.\n  &5[Oh, yeah, I guess we can leave the spear here...]\n  &6[The Praetor]\n Yet this grants us real hope. A goal. An ending that leaves New Antium safe. I trust that this city can work together to truly\nmake us all safe at last. Now, we wish to- {...}\n  &6[New Antium Gate Sentinel]\n Excuse me, I'm sorry to interrupt. There's... there's someone at the gate wearing the armor of a Silver Knight. {...}\n  &6[The Praetor]\n That cannot possibly be. The Knights are long gone. {...}\n  &6[The High Priest]\n Benedictus sanctissimus... We've woken the Knights... This cannot be a good sign, brothers and sisters. There is power\nradiating from outside. We must go to them, lest they raze the city in their anger...\n&o  C: Go to New Antium's gate to confront the being in Silver Knight armor. Table\n Dialogue before you leave\n  &6[Brayllur]\n Knight? Exciting!\n  &6[The High Priest]\n O' Architect, ye who protect us mightily, grant us strength in what is to come...\n  &6[The Praetor]\n What nonsense. I won't believe a Knight could still walk amongst us until I see it with my own eyes, let's embark, [Player].\n  &6[Bhairavi]\n The Knights... Here...? I fear I'm out of the loop here [Player]. None of this is making any sense. Let's meet by the gate\nimmediately.\n  &6[New Antium Gate Sentinel]\n You must hurry at once, I speak no lies, see for yourself at the gates.  Table\n Silver Knight Tuulen\n  Coordinates: [-384, 157, -164]\n   &6[Silver Knight Tuulen]\n Stand firm, dost thou Antium? Such a shock in a search of Emperor Uriddan. Now... what be this? Hail [Player], I see thee\nthere. Ye walk clean much as I do now, with my thanks.\n  &5[Tuulen! What are you doing here? I wondered where you got to after the Crimson King was resealed. I couldn't get back into\nthe underground.]\n  &6[Silver Knight Tuulen]\n Journey has brought me home to the Ring itself. But I arrive seeking you. News comes from the land of Snowblossom, beyond the\nrootways and the wash of waves. {...}\n  &6[Silver Knight Tuulen]\n He of the Viridescent, once contained in the cell of Green, has been slain in single combat by the bearer of Black. The Dichen\nthat stood with it have been scattered. The land itself lies in devastation.\n  &5[The Green Wool? Or the Spirit inside?]\n  &6[Silver Knight Tuulen]\n That which was once contained, [Player]. He is dead, but word has spread that his attacker has been wounded greatly. I now\ntravel to the Serebrium Citadel, walking the path Uriddan once tread to find where he has gone. Things have changed much and\nonly he might set things right. A strange blight emanates from the stones beyond. {...}\n  &6[Silver Knight Tuulen]\n Thank you for granting me new purpose. I offer you this Helm as a mark of my gratitude. Perhaps I will stumble once more onto\nyour path should you walk the bridge I step toward. Farewell to you all. May the Architect guide thee.\n&o  C: Speak to your allies following Tuulen's revelations. Table\n The High Priest\n  Coordinates: [-384, 157, -166]\n   &6[Bhairavi]\n ... What. Just... happened?\n  &5[A lot... Calder is up to something, I think.]\n  &6[The Praetor]\n Impossible...\n  &6[The High Priest]\n ... I... need a moment... to compose my thoughts.\n  &6[Brayllur]\n Wow. A lot to take in.\n  &6[Bhairavi]\n ... What. Just... happened?\n  &5[A lot... Calder is up to something, I think.]\n  &6[The Praetor]\n That was... that was a real Silver Knight. They walk once more.... But she stepped through our humble city, without anger,\nwithout destruction? Perhaps they are mollified at last? Perhaps they do not seek retribution? {...}\n  &6[The High Priest]\n Beati sumus in hac die, indeed we are blessed. Perhaps our purge of the heretic has brought forth forgiveness? And one of the\nArchitect's hands walks again... {...}\n  &6[The High Priest]\n They knew you, did they not [Player]? Truly you are a chosen of the Architect as well. I knew it when we first spoke. Your\nholiness is true. This is why you are here to help.\n  &5[This isn't the first I've met. They're still very real. Something is happening out there.]\n  &6[Bhairavi]\n It never stops, does it?\n  &5[We'll need to be ready to follow then.]\n  &6[Bhairavi]\n Indeed we do. I'll set up here at the local lodging in the Gray Fox Tavern and begin preparations. Please visit if you need\nanything. {...}\n  &6[The Praetor]\n Thank you for what you've done. New Antium will not forget your help. We have much work ahead, and I feel you do too... I must\ngo grapple with meeting a God, if you don't mind. {...}\n  &6[The High Priest]\n Indeed. My clergy's prayers will be stronger on this day, truly. Nacreus, you and I should speak again soon. There is progress\nto be made in this city. This holy moment should be the first step to uniting our guidance of New Antium, I pray. {...}\n  &6[The High Priest]\n I will consider this offer. Something momentous has happened in this last month, and you, [Player], are the locus of that\nchange. Go forth with this city's gratitude eternal.\n  '''UNCONVENTIONAL METHODS COMPLETE!'''\nLineBreak   Awarded Uriddan's Legacy and 2 Hyperchromatic Archos Rings!\n", "reward": "rewards =\n*Awarded &3Uriddan's Legacy&r\n*2 Hyperchromatic Archos Rings\n"}