{"name": "Unmasked", "information": "prerequisites = &3Kingdom of Lies&r and &3R is for Reprisal&r\n NPC: Vargos Coords: -740, 83, 1337\n Celsian Isles Misport\n", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Vargos \n  Coordinates: [-740, 83, 1337] \n   &6[Vargos] \n It feels almost like dumb luck that we've routed Calder's Masked. You should be very proud of your work. We have more work left though... it will never end until we take down the man himself. \n  &5[What can I do to help?] \n  &6[Vargos] \n As you know, we've taken the former Holy Advisor, Ridnan, into custody. We've been trying to crack him and gather information. Would you care to join us?  \n  &5[Later, when I have the time.]  \n  &6[Vargos] \n Time is of the essence, you know. \n  &5[I've been looking forward to this.] \n  &6[Vargos] \n Then let us travel there post haste.  \n C:   &o  [1/2]: Talk to Vargos in the Jail. \n C:   &o  [2/2]: If you're not in the Jail, speak to Vargos to return to it. \n Other Jail Npc Dialogue: Table  AlignDefault ColWidthDefault AlignDefault \n Brandy (Jail) AlignDefault \n  &6[Brandy] \n Hello there [Player]. I've heard great things about you from Vargos and my daughter.  \n  &5[Your daughter?]  \n  &6[Brandy] \n Oh of course. Cinevra is my daughter. She's quite the powerful little arcmage! \n  &5[Well, it's nice to meet you Brandy. What have you gotten out of Ridnan so far?] \n  &5[Nice to meet you Brandy. What have you gotten out of Ridnan so far?] \n  &6[Brandy] \n Not much, he's been spouting out fanatical nonsense, but nothing that will help us find Calder. \n  &5[Can I try talking to him?] \n  &6[Brandy] \n Sure. I'll be monitoring him, so no need to be afraid.  Table  AlignDefault ColWidthDefault AlignDefault \n Aimos (Jail) AlignDefault \n  &6[Aimos] \n Ahoy Cap'n [Player]. \n  &5[Ahoy. Who are you?] \n  &6[Aimos] \n I'm Aimos. Yer mates pawned me off fer guard duty of this scum 'ere. If ye wanna know what he did, I wrote ya a log in ta chest over there. \n  &5[You can write?] \n  &6[Aimos] \n Jus' cuz I'm a pirate don't mean I ain't literate, mate.  Table  AlignDefault ColWidthDefault AlignDefault \n Levyn (Jail) AlignDefault \n  &6[Levyn] \n Ahoy [Player]! We get ta pick the brains o' some scum today, aye? \n  &5[Yes indeed.] \n  &6[Levyn] \n Let me at 'im! I'll learn all there be ta know!  Table  AlignDefault ColWidthDefault AlignDefault \n Ridan (Jail) AlignDefault \n  &6[Ridnan] \n [Player]... Have you come to gloat at your victory? Even if you get rid of me, there are many who share my sentiment. You mages are a scourge upon the earth. \n  &5[Do you hate mages that much?] \n  &6[Ridnan] \n Of course I do! They should never have existed at all! I was so close... I should have realized that working for a filthy mage like Calder would cause trouble. \n  &5[Why did Calder want you to work for him in the first place?] \n  &6[Ridnan] \n Hah... He never told me what exactly, but he said he was searching for the resting place of ancient power. \n  &5[Did you find it?] \n  &6[Ridnan] \n We didn't, but we found an old scripture that hinted to its location. \n  &5[Is this scripture in Calder's hands?] \n  &6[Ridnan] \n ... \n  &5[Is it?] \n  &6[Ridnan] \n ...  Table  AlignDefault ColWidthDefault AlignDefault \n Vargos (Jail) AlignDefault \n  &6[Brandy] \n Seems like he's decided not to talk anymore. Let me handle this. \n  &6[Vargos] \n Go ahead, talk to Ridnan. \n&o  A loud cracking noise reverberates around the room. \n  &6[Ridnan] \n GAHH! \n  &6[Brandy] \n Does Calder have the scriptures? \n  &6[Ridnan] \n ... \n  &6[Brandy] \n Why do you continue to stay silent? Do you believe someone will come for you? \n  &6[Ridnan] \n ... \n  &6[Brandy] \n Your country has forsaken you. Your followers have been detained. And your master? Calder? I've known him far longer than you've been alive, boy. He won't come for you. You've served your purpose. \n  &6[Ridnan] \n ... \n  &6[Brandy] \n Perhaps you need some more encouragement. You don't like magic, no? Let's see how much you like this. \n&o  Blades of air dance in the palm of Brandy's hand \n  &6[Ridnan] \n O-only some of them! We only managed to put together a few verses. He said it was enough. \n  &6[Brandy] \n Only some hmm? Well maybe some more prodding will let you remember what was on those scr- \n&o  An explosion rocks the room \n  &6[Vargos] \n What was that? \n  &6[Ridnan] \n I knew it! He would never forsake me! \n  &6[Brandy] \n That monster... Calder is far too bold. Go get him, [Player]. \n  &6[Vargos] \n After him! \n  &6[Izzy] \n Oh no... did we never seal the hole into the sewer? \n  &5[What hole?] \n  &6[Izzy] \n The one you escaped into, back when we made it to Mistport! Ridnan must have fled down it! \n  &5[I'll go after him.] \n  &6[Vargos] \n Be careful, I sense some seriously powerful magic afoot. Someone is down there with him. I fear the Masked aren't done with us yet. \n  &6[Levyn] \n Need any backup Cap'n? I can take 'im!  \n C:   &o  [1/2]: Follow Ridnan into the sewers. \n C:   &o  [2/2]: If you leave the sewers at any time, return through the sewer entrance. \n After you enter after Ridnan: \n  &6[Masked Figure] \n Don't follow us, [Player]. This won't end well. \n  &5[Who are you? Where are you taking Ridnan?] \n  &6[Masked Figure] \n This isn't your concern. Just let us leave and I won't be forced to hurt you. \n  &6[Masked Figure] \n Fine, I'll do this myself. I was hoping not to have to. Come here [Player]! \n C:   &o  Defeat the Masked Figure. \n After beating the Masked Figure: Table  AlignDefault ColWidthDefault AlignDefault \n Samwell (Sewer) AlignDefault \n  &6[Samwell] \n I told you not to follow me. \n  &5[Samwell? What are you doing here?] \n  &6[Samwell] \n I told you, I would be finding the highest bidder. It turns out the Masked offer quite the compensation. Power. \n  &5[After all we saw, you really joined Calder? Why?] \n  &6[Samwell] \n Of course I did, after all we saw. I'm throwing my hat in the ring with the winner. Lord Calder has power beyond your imagination. He is so close to having even more. The scriptures will be the way. I'm sure Ridnan, the little traitor, has already spilled the beans. \n  &5[Wouldn't you like to know.] \n  &6[Samwell] \n I don't really care. I'm not here to rescue Ridnan anyway. \n  &5[What?] \n  &6[Ridnan] \n No! I've served Lord Calder well! \n&o  Samwell spits. \n  &6[Samwell] \n As if. You failed his most delicate mission and have put pressure on him when he needed the most space. With the failures of you and the Pharaoh, he might not even get the wool in time, you fool. \n  &5[Wool?!] \n  &6[Samwell] \n Yes, what else would Ridnan's precious scriptures be pointing to?? Gods, you truly are hopeless. Goodbye [Player]. I hope I never have to see you again. \n  &6[Ridnan] \n NO! Listen to me! The scriptures speak of the lost Monument. The statues speak of the power of time! Go to - \n&o  Ridnan gasps as Samwell leaps forward, stabbing him in the throat. \n  &5[Samwell!] \n&o  Samwell leaps into the sewer tunnel, silently, leaving you alone, with a corpse. You choose to flee back to Mistport. You've seen enough.  \n C:   &o  Return to Vargos in Mistport to tell him what happened. Table  AlignDefault ColWidthDefault AlignDefault \n Vargos AlignDefault \n  &6[Vargos] \n You've returned. Good news, I hope. \n  &5[Ridnan is dead, killed by Samwell. He's joined Calder.] \n  &6[Vargos] \n Of course... Those who hunger for power are always drawn to those with it. It will be Samwell's downfall. He's made his choice, I suppose. \n  &5[I found something important out. Calder is after a Wool.] \n  &6[Vargos] \n A wool? The council didn't think there were any left in the Region. What do we know? \n  &5[I know that the Monument seems to be involved, and something about statues speaking of time?] \n  &6[Vargos] \n Fascinating! We need to move quickly. I'll send for Bhairavi immediately. She knows more about these wool than anyone else. I've been ensuring your discoveries with this region's wool made their way to her. Go meet her at the Steelmeld Monument immediately.  \n C:   &o  Meet Bhairavi at the Steelmeld Monument. Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi \n  Coordinates: [-542, 6, -527] \n   &6[Bhairavi] \n [Player]! You're here! \n  &5[It's been too long since the party at Mistport!] \n  &6[Bhairavi] \n It has indeed! Now, the research I've done in the Valley made me believe that the last wool in the Isles was the Purple Wool. Now I'm beginning to think that the Blue Wool is in play here as well. \n  &5[The Blue Wool? How do you know?] \n  &6[Bhairavi] \n Has nobody told you about the Council's experience with the Wools? It's quite a long story, but I can summarize if you'd like.  \n  &5[Please do (Short option).]  Plain  (MISSING)  \n  &5[I'm happy to listen (Long option).]   \n  &6[Bhairavi] \n After many adventures and discoveries, the Mage Council discovered how to enter the Monument in the King's Valley. It was there we were greeted by a vision... or a memory? Something. In it, we were shown sixteen wool of power. The ones you know, white, orange, magenta, and so on. \n  &5[What's left to find then?] \n  &6[Bhairavi] \n Next would be Blue, Brown, Green, and Red. We began to investigate back then, and determined that White through Yellow were in the Valley, and that they seemed to be in groups. We were fairly sure that Lime through Purple would be together, then Blue through Black would be grouped. We began to investigate a lead into what we thought would be a higher wool, far from the Valley. \n  &5[But Calder got it first?] \n  &6[Bhairavi] \n Exactly. He had been off searching with his partner, on Council orders. We have no idea how he found the wool, but on his return, he revealed it, and slaughtered the Council. His partner hasn't been seen since. She's likely dead as well, damn him. \n  &5[That's horrible.] \n  &6[Bhairavi] \n Isn't it? Calder really seems to have a gift for this sort of miracle though, finding Wool where they don't belong. If this is even the Blue Wool at all... \n  &5[So what do we know? Is there anywhere I can go to find him?] \n  &6[Bhairavi] \n I think so. I've had some notes on a wool with time powers for a few months now. I keep finding references to the \"Silver Knights\", all over the Isles. If that name sounds familiar, it's because we also found an ancient Hammer with ties to them in Highwatch. \n  &5[Fascinating. But what about them and this wool?] \n  &6[Bhairavi] \n Well, the researchers here in Steelmeld have found artifacts relating to them in this place. Additionally, I found the crumbling ruins of what seems to be a Silver Knight statue in Ishnir. Inside a hidden compartment, I found what seems to be a scripture. I've partially deciphered it, and it mentions an artifact of Time hidden to the \"West of the Monument\". If you can finish it, maybe it could tell us more... \n  &5[I'm on it.] \n  &6[Bhairavi] \n Fantastic. Here's a copy, then! Once you work out where it's sending you, I'll send an assistant to join you there. Just head there and maybe you can work out what Calder is doing with this wool... Gods, I hope you're fast enough.  \n C:   &o  Translate the notes to find out where to go next. Speak to Bhairavi if you need a replacement book. Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi AlignDefault \n  &6[Bhairavi] \n Once you've worked out what this says, I'll send an assistant to meet you at that spot! Just head there and maybe you can work out what Calder is doing with this wool... Gods, I hope you're fast enough. \n  &5[Can I have another copy of the book?] \n  &6[Bhairavi] \n Of course. I'm used to you losing my research by now. I found the crumbling ruins of what seems to be a Silver Knight statue in Ishnir. Inside a hidden compartment, I found what seems to be a scripture. I've partially deciphered it, and it mentions an artifact of Time hidden to the \"West of the Monument\". If you can finish it, maybe it could tell us more...  \n  Ancient Writings: \n soon all will feel the grim touch of time \n so forth went the knights \n where time was long lost \n westward bound \n sacrarium found \n Head to   Link   Sacrarium of Aeons Sacrarium_of_Aeons wikilink  . \n  When you try to go down the stairs: \n&o  Reality warps before you, time gets reversed and you find yourself moving backwards, stopping at the top of the staircase. Table  AlignDefault ColWidthDefault AlignDefault \n Max AlignDefault \n  &6[???] \n Hey, are you [Player]? You showed up at the perfect time, some masked guy attacked me as I got here but it seems your arrival scared him off. \n  &5[Who are you?] \n  &6[Max] \n I'm Max, I know Bhairavi. I have a fair idea on the current situation you're in, but I'd appreciate it if you filled me in. \n  &5[Sure.] \n You recount the past events and actions leading up to now. SoftBreak RawInline  &6[Max] ...I see. That's pretty rough. I've heard of this Calder guy but I didn't expect that I might be confronting him directly. \n  &5[He's dangerous, but we need to stop him.] \n  &6[Max] \n Thankfully, I'm not a wimp. Anyway, have you seen this gateway? This magical barrier is inlaid in the stone here, you can see the small scriptures on the border of the stonework. \n  &5[I never noticed that.] \n  &6[Max] \n It’s not something a lot of people notice, don’t worry. I do a lot of rune work so I tend to notice those things. Anyways! Iâ–’ve been sitting here reading it and I think I deciphered most of it. \n  &5[You can read this?] \n  &6[Max] \n Of course. It’s quite ancient, but I’m very good with old languages. This seems to predate the Ishnir and Chillwind societies, but I’ve not the foggiest what those people called themselves. They seem to mention this being a way to house their home, and a... Teal Wool? Can you step back for a bit? \n&o  Max mutters a few words under his breath, and you hear a shattering noise as the nearby crystal breaks. The runes glow a faint blue hue as the barrier around the stairs fade. \n  &6[Max] \n Excellent. The spell I crafted seemed to work. I’ll see you inside? \n  &5[Inside where?] \n  &6[Max] \n Whatever these ancient folks didn’t want us to see of course. I hope it’s as big as you say. Take this, by the way. You'll need it. See you down there!  \n C:   &o  [1/2]: Follow Max down the stairs... \n C:   &o  [2/2]: ...and enter the   Link   Echoes of Oblivion Echoes_of_Oblivion wikilink  . \n&o  Reality warps before you, time speeds up and you find youself moving faster than expected, stopping in a room somewhere below the Sacrarium. \n After beating   Link   Echoes of Oblivion Echoes_of_Oblivion wikilink  : \n C:   &o  Return to Bhairavi, defeated. Table  AlignDefault ColWidthDefault AlignDefault \n Bhairavi AlignDefault \n  &6[Bhairavi] \n Welcome back [Player]. I'm so happy to see you alive still. What happened? Did you see Calder? Did you get the wool? Was Barte any help? \n  &5[I don't think things could have gone worse.] \n  &6[Bhairavi] \n Um... \n  &5[I never met a Barte. I met a Max.] \n  &6[Bhairavi] \n Oh... no... \n  &5[We explored what was hidden below the Sacrarium of Aeons. A whole kingdom, warped through time.] \n  &6[Bhairavi] \n And the blue wool? \n  &5[The TEAL wool. Destroyed. By Maxwell Calder.] \n  &6[Bhairavi] \n But... how? \n  &5[The Black Wool. It gets worse though.] \n  &6[Bhairavi] \n What could be worse than the loss of a wool? \n  &5[The wool had something inside. A being. It destroyed the place around us.] \n  &6[Bhairavi] \n Why did Calder destroy the wool at all? \n  &5[He claims this has always been his goal.] \n  &6[Bhairavi] \n Insanity... \n  &5[What do we do, Bhairavi?] \n  &6[Bhairavi] \n I have no idea, [Player]. I'm sorry. I'll need to meet with the rest of the Council. We have far too much to discuss. Nothing we thought we knew seems to be true. New wool, destroyed? Calder's goals? This is disastrous... We need to locate the being that was inside that wool. We'll talk soon, okay? For now, take these, please.  \n UNMASKED COMPLETE! SoftBreak  Awarded access to the   Link   Echoes of Oblivion Echoes_of_Oblivion wikilink Dungeon and Delves and   Link   Calvarium Calvarium wikilink  . ", "reward": "rewards =\n* Access to the &3Echoes of Oblivion&r Dungeon and Delves\n* &3Calvarium&r\n"}