{"name": "Vital Needs", "information": " NPC: Dr. Qure Celsian Islestown = Mistportstarting_npc_coordinates = -758, 86, 1355starting_npc_coordinates = -758, 86, 1355 Celsian Islestown = Mistportstarting_npc_coordinates = -758, 86, 1355town = Mistportstarting_npc_coordinates = -758, 86, 1355", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Dr. Qure AlignDefault \n  Color|orange|[Dr. Qure]}} \n Hmm... Now where did I put that...? \n  Color|purple|[Hello?]}} \n  Color|gray|He's deep in thought while trying to find something in his office.}} \n  Color|orange|[Dr. Qure]}} \n Oh! I'm terribly sorry, I didn't notice you come in. What can I do for you? \n  Color|purple|[I was wondering more what I could do for you.]}} \n  Color|purple|[How about some medical jokes?]}} \n  Color|orange|[Dr. Qure]}} \n Oh, really now? Well I suppose there is this one thing... \n  Color|orange|[Dr. Qure]}} \n You see, I've lost the ingredients to make a special vitality remedy commonly used in these parts, quite a marvelous elixir! If you could fetch me some of those I could apply it to you for your travels too!  \n  Color|purple|[I'll pass for now. They might still be in your office anyway!]}}  \n  Color|orange|[Dr. Qure]}} \n You know what? You could be right! \n  Color|gray|He goes back to searching through his desk... \n  Color|purple|[I'm in. Where should I start?]}} \n  Color|orange|[Dr. Qure]}} \n Well, first of all, I require a Tenebre Mushroom from some fungal caves in the nearby islands.  \n&o  1/2 - Travel to   Link   Fungus Thorn Cave Fungus_Thorn_Cave wikilink in order to obtain a Tenebre Mushroom \n&o  2/2 - Once you have a Tenebre Mushroom return to Dr. Qure Table  AlignDefault ColWidthDefault AlignDefault \n Dr. Qure AlignDefault \n  Color|orange|[Dr. Qure]}} \n Ah perfect! You found one!  \n  Color|gray|The Doctor chucks some of the mushroom into a mortar and begins to grind it into a fine paste.}} \n  Color|purple|[Alright then, what's next?]}} \n  Color|orange|[Dr. Qure]}} \n Hmm, a fresh Saragundi Sapling from a nearby forest. I'd say the Feyrune Forest would have an ample supply.  \n&o  1/2 - Travel to   Link   Feyrune Forest Feyrune_Forest wikilink and retrieve a Saragundi Sapling \n&o  2/2 - Once you have a Saragundi Sapling, return to Dr. Qure Table  AlignDefault ColWidthDefault AlignDefault \n Dr. Qure AlignDefault \n  Color|orange|[Dr. Qure]}} \n Fantastic, it looks to be in perfect health! \n  Color|gray|The Doctor throws some leaves of the sapling into the mortar.}} \n  Color|purple|[What's the final ingredient?]}} \n  Color|orange|[Dr. Qure]}} \n So, finally, I require a bottle of Kelp Oil. Unfortunately, some pirates had stolen the last bottle I had from me... I believe they've gone back to their base camp in the Spiral Island. \n  Color|purple|[Lovely...]}} \n  Color|orange|[Dr. Qure]}} \n Yes, well I suppose it shouldn't be too much harder than fetching the other supplies.  \n&o  1/2 - Travel to   Link   Spiral Island Spiral_Island wikilink to retrieve some Kelp Oil \n&o  2/2 - Once you have some Kelp Oil, return to Dr. Qure Table  AlignDefault ColWidthDefault AlignDefault \n Dr. Qure AlignDefault \n  Color|orange|[Dr. Qure]}} \n Great work! That's the final ingredient! \n  Color|gray|He pours a drop of the oil into the mortar, and then puts the mixture into a vial.}} \n  Color|purple|[So, does the medicine work?]}} \n  Color|orange|[Dr. Qure]}} \n Of course it does! Applying it should give the person great vitality for a good while! With this fresh supply, I should have enough for weeks! Take this for your troubles.   AlignDefault \n VITAL NEEDS COMPLETE! \n Awarded 28 Crystalline Shards and access to Dr. Qure's healing remedy!  \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *28 Crystalline Shards\n*Access to Dr. Qure's Remedy"}