{"name": "Xenophobia", "information": "prerequisites = &3The Lost Empire&r NPC: Izzy Celsian Islestown = Mistportstarting_npc_coordinates = -738, 83, 1334 NPC: Izzy Celsian Islestown = Mistportstarting_npc_coordinates = -738, 83, 1334starting_npc_coordinates = -738, 83, 1334 Celsian Islestown = Mistportstarting_npc_coordinates = -738, 83, 1334town = Mistportstarting_npc_coordinates = -738, 83, 1334", "dialogue": "}} Table  AlignDefault ColWidthDefault AlignDefault \n Izzy AlignDefault \n  Color|orange|[Izzy]}} \n Hello again   RawInline   Color|purple|[Well, I found the Lime wool, but Samwell... he's joined Xeno.]}} \n  Color|orange|[Izzy]}} \n Samwell abandoned us? That money-grubbing swine. And Xeno... he just continues to pose more and more of a threat. Thankfully, we might finally have a breakthrough. \n  Color|purple|[You got the crystal to work?]}} \n  Color|orange|[Izzy]}} \n I believe so. I've managed to get it to emit the same energy that it did the first time we used it. I believe it might actually be able to take us somewhere again. Let me know when you are ready; we need to hurry and discover what Xeno's plans are.  \n&o  1/2 - Speak to Izzy when you're ready. Table  AlignDefault ColWidthDefault AlignDefault \n Izzy AlignDefault \n  Color|orange|[Izzy]}} \n Are you ready to go? We need to find out where this crystal is going to take us. \n  Color|purple|[I'm ready]}} \n  Color|orange|[Izzy]}} \n Good. Let's hope for the best. \n  Color|orange|[Izzy]}} \n I wonder where we are now? This is definitely not the cove we saw before. \n  Color|orange|[Izzy]}} \n Regardless, it took us here, so that mean that this place is one Xeno finds important. We must search around and seek for clues.  \n&o  2/2 - Search out clues in the hideout. \n ong  Clue 1: (garden in main room) The clue is in the main room. LineBreak  There is a stone button at (-738, 39, 1398) which opens the green_stained_glass floor in center of room at (-734, 35, 1392) which has the chest with the clue (-735, 27, 1395). LineBreak  To exit use the button on the west wall (-737, 28, 1391) LineBreak ong  Clue 2: (coal ore in left room) Unpower the right lever (-730, 36, 1403) and power the left lever (-730, 36, 1408). LineBreak  The chest is under the coal ore (-730, 35, 1406) LineBreak ong  Clue 3: (iron ore cache in main room) Iron cache by east wall chest located under wooden trapdoors (-722, 35, 1391) LineBreak ong  Clue 4: (chest in support structure in right room) Parkour up to the top of the noteblocks and open spurce trapdoors above you. LineBreak  The chest is located inside (-744, 44, 1408) \n  Izzy AlignDefault \n  Color|orange|[Izzy]}} \n Find anything of interest? \n  Color|purple|[This is definitely one of Xeno's hideouts, and he plans to meet with the man who attacked us again.]}} \n  Color|orange|[Izzy]}} \n I figured such a thing was inevitable- they seem to be working quite closely together. Any idea where they might be meeting? \n  Color|purple|[In the south west slime ocean. They must have a meeting location there.]}} \n  Color|orange|[Izzy]}} \n Interesting... I seem to remember that portion of the ocean being particularly islandless, if the maps are correct. I can't imagine where they could be meeting. That said, we should probably get our crew into full order before barging in. Are you ready to head back to Mistport? \n  Color|purple|[Let's go.]}} \n  Color|purple|[No, I want to look around a little longer.]}} \n  Color|orange|[Izzy]}} \n Alright, switching the crystal to return mode.  \n&o  Speak to Captain Indigo Table  AlignDefault ColWidthDefault AlignDefault \n Captain Indigo AlignDefault \n  Color|orange|[Captain Indigo]}} \n Hello   RawInline   Color|purple|[Izzy and I found some information on Xeno and the man who attacked us. ]}} \n  Color|orange|[Captain Indigo]}} \n Oh? Well that is news. Is there any action we can take? \n  Color|purple|[We need to sail into the south western region of the ocean, they are meeting there.]}} \n  Color|orange|[Captain Indigo]}} \n I see, I'll make the necessary preparations, then. But what of Samwell and Levyn? I've not heard from them in some time. \n  Color|purple|[Samwell left the crew to join Xeno. Last I saw Levyn, he was down and believed he's not fit to be a pirate.]}} \n  Color|orange|[Captain Indigo]}} \n *sigh* We picked a real crew there, didn't we. I suppose we can forget about Samwell then, but we need Levyn, especially if you aren't entirely sure where we are heading in the south west. If there's anyone who can get information out of pirates, it's him. While I prep the ship, try to go talk some sense into him.  \n&o  Speak with Levyn in the bar Table  AlignDefault ColWidthDefault AlignDefault \n Levyn AlignDefault \n  Color|orange|[Levyn]}} \n *hic* Well, if it ittn ma ol' frin   RawInline   Color|purple|[Levyn, please tell me you aren't drunk.]}} \n  Color|orange|[Salty Bartender]}} \n Zehahaha! He be drinkin' too much o' me booze. Lubber can't even keep 'is 'ead up. Though this be better than when he were wallerin in ze corner like er child. \n  Color|orange|[Levyn]}} \n *hic* No I'm... I'm totally sob- *hic* sober! \n  Color|purple|[Levyn, snap out of it!]}} \n  Color|orange|[Levyn]}} \n Lissen... lissen *hic* I was juss about to get info on the Xeno dude from my bess friend here *hic* he's a good guy, ya know, even though he tric- *hic* tricked us. He was juss mentionin deliverin some swill to the south *hic* southwest. \n  Color|orange|[Salty Bartender]}} \n Zehahaha! Overhearin' me buserness dealins, eh boy? That be some fine ears ye got over teh buzz. \n  Color|purple|[Southwest? You know where Xeno is heading!]}} \n  Color|orange|[Salty Bartender]}} \n Zehahaha! It be possible, laddy. But ye'll never get teh infer out o me. I be loyal to Cap'in Xeno til me death. \n  Color|orange|[Levyn]}} \n *hic* What about... about a drinking contest? You and *hic* you and me. Whoever loses their gut first *hic* loses the contest. \n  Color|purple|[Levyn, hold on-]}} \n  Color|orange|[Salty Bartender]}} \n That be mighty high talk ferm a man who already half legged in teh bucket, if ye catch mer drift. \n  Color|orange|[Levyn]}} \n If I win *hic* if I win, you give us the location. \n  Color|orange|[Salty Bartender]}} \n And iffer I win? I don't be seeing the upside fer me. \n  Color|orange|[Levyn]}} \n I'll join *hic* I'll join... Xeno's crew with you... make your beer for him *hic* or whatever... \n  Color|orange|[Salty Bartender]}} \n Zehahaha! Well, that be er deal I can't be passing up! Ye gotcher self a pirate deal, lubber. \n  Color|purple|[How is a drinking contest fair? He's already drunk!]}} \n  Color|orange|[Levyn]}} \n [Salty Bartender] Zehahaha! That hardly be me problem, laddy. A pirate deal be a pirate deal. Ye can't cross us now.  \n&o  Help Levyn win the drinking contest. Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|orange|[Salty Bartender]}} \n I er... I call... \n  Color|orange|[Levyn]}} \n Arrrghhh! And that's how a pirate drinks! \n  Color|purple|[I... can't believe it. Levyn, you actually did it.]}} \n  Color|orange|[Levyn]}} \n Arrgh! I feel the pirate spirit returning to me! I can do this! \n  Color|purple|[Now, for the information.]}} \n  Color|orange|[Salty Bartender]}} \n I er... I can't... Cap'in Xeno will 'ave me 'ead. \n  Color|orange|[Levyn]}} \n Arrgh! You will, or the beer you drank won't be the only thing lose. \n  Color|orange|[Salty Bartender]}} \n Bah... he be 'eading 324 notches south, 125 notches west... please don't tell 'im I told ye... I beg o' ye... \n  Color|purple|[Let's go Levyn. Indigo is waiting on us.]}} \n [Levyn] ARRGH!  \n&o  1/2 - Speak to Captain Indigo Table  AlignDefault ColWidthDefault AlignDefault \n Captain Indigo AlignDefault \n  Color|orange|[Captain Indigo]}} \n I'm going to take Levyn losing his lunch over the side of the dock just now as a good sign. \n  Color|purple|[He seems to be back in working order, and we got some exact coordinates.]}} \n  Color|orange|[Captain Indigo]}} \n Fantastic! Where are we heading? \n  Color|purple|[324 notches south, 125 notches west]}} \n  Color|orange|[Captain Indigo]}} \n That sounds doable. I'm all prepared and Izzy is communicating with someone below deck using some magic doohickey. That said, we should be all set and can voyage out as soon as you are ready. \n  Color|purple|[Let's go!]}} \n  Color|orange|[I'm not quite ready.]}} \n  Color|orange|[Captain Indigo]}} \n As I figured, nothing seems to be around here. If Xeno really is here, they likely have an underwater base somewhere. It's probably best for you to scout ahead   RawInline &o  2/2 - Search out Xeno's underwater hideout Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|orange|[Captain Xeno]}} \n Now there, what seems to have gotten you in such a fuss? \n  Color|orange|[Masked Saboteur]}} \n You are well aware of the issue. We gave you the information on the city so that you could find the Wool, not sell it out to that wretch,   RawInline   Color|orange|[Captain Xeno]}} \n Oh come now, you've known since the start of our business agreement that I've only ever been out for wealth. That is the only true power in this world- opportunity. Your balls of sheep hair mean nothing to me. \n  Color|orange|[Masked Saboteur]}} \n You ignorant fool, you have no idea of the repercussions of your act- \n  Color|orange|[Masked Saboteur]}} \n You! I thought I would have to hunt you down like the vermin you are, but you've just come right to me. This time, I'm going to finish you off! \n  Color|orange|[Indigo]}} \nRawInline &o  Defeat the Masked Saboteur Table  AlignDefault ColWidthDefault AlignDefault AlignDefault \n  Color|orange|[Captain Xeno]}} \n Well, I seem to be trapped now, don't I? I suppose you'll have to take me in, hold me hostage. \n  Color|purple|[You aren't leaving here without us.]}} \n  Color|orange|[Captain Xeno]}} \n Oh, I'm sure of that. But tell me,   RawInline   Color|purple|[We'll figure something out. We can--]}} \n  Color|orange|[Mysterious Man]}} \n Oh, I'm sure you probably could. You are a constant pain, after all. \n  Color|purple|[Who are...]}} \n  Color|orange|[Mysterious Man]}} \n Xeno, I believe we had a deal, didn't we? \n  Color|orange|[Captain Xeno]}} \n I... No, you can't be... You're... \n  Color|orange|[Mysterious Man]}} \n There's nothing I hate more than those who betray me. \n  Color|orange|[Captain Xeno]}} \n No, wait... please- AAGH! \n  Color|orange|[Mysterious Man]}} \n And now there's you. I can't allow you to get in my way, I have too much at stake. Give Xeno my regards,   RawInline   Color|orange|[Voice from Above]}} \n I've got you,   RawInline   Color|orange|[Vargos]}} \n Well, that was a close one. If Izzy hadn't have contacted me, you guys would have been goners for sure. \n  Color|purple|[Vargos?!]}} \n  Color|orange|[Vargos]}} \n It's good to see you again,   RawInline   Color|purple|[What just happened?]}} \n  Color|orange|[Vargos]}} \n You were about to be killed, that's what. He's finally made his move. I knew he was here in the Isles somewhere, but finding him was almost impossible. Especially after he had my apprentice killed. \n  Color|purple|[Wait, so that man... He was...]}} \n  Color|orange|[Vargos]}} \n Yes; the man you saw- that was Calder. He's the one Xeno has been working with. And, from what Izzy told me, he was attempting to get the kingdoms into a political war with the Valley. \n  Color|purple|[What do we do now?]}} \n  Color|orange|[Vargos]}} \n Honestly, I'm not entirely sure. Calder is calculating and cunning- it will be hard to predict his next move. For now, I suppose we wait. \n  Color|purple|[I suppose so.]}} \n  Color|orange|[Vargos]}} \n In the meantime, your pirate friend Levyn went screaming into the bar. You might wanna go check that he's okay.  \n&o  Speak with Levyn in the bar Table  AlignDefault ColWidthDefault AlignDefault \n Levyn AlignDefault \n  Color|orange|[Levyn]}} \n Arrgh!   RawInline   Color|purple|[What can we do about it?]}} \n  Color|orange|[Salty Bartender]}} \n Zehahaha! What can ye do abert it, ye say? Any crew be in an uproar when ther cap'in be gone. A new cap'in need to rise in to fill teh slot. \n  Color|orange|[Levyn]}} \n Arrgh! The town needs a new captain.   RawInline   Color|purple|[Why me?]}} \n  Color|orange|[Levyn]}} \n Arrgh! Because you're the best pirate that ever sailed! You took care of that masked guy, twice! Let me spread the word for you! I can talk these pirates into it. \n  Color|orange|[Salty Bartender]}} \n Zehahaha! And while we be startin' on the wrong foot back wit me booze machine, ye did a wonderful job makin' it. Me swill 'as been the best booze I ever did drink. Ye also 'ad me back after I ratted Xeno. I er ye one. I 'ave yer back as well. And since I be a high rankin' pirate in Xeno's crew, ther'll listen to me sayins on ye. \n  Color|purple|[Okay then, I'm on board.]}} \n  Color|orange|[Levyn and Salty Bartender]}} \n Aye aye, cap'in!   AlignDefault \n XENOPHOBIA COMPLETE! SoftBreak  Awarded 2   Link   Salty Swills Salty_Swills wikilink  , 32 CCS,   Link   Xeno's Pirate Hat Xeno's_Pirate_Hat wikilink  , Access to the Mistport Black Market, and a crew of Mistport pirates!  \nLink   Category:Quests Category:Quests wikilink ", "reward": "rewards = *2 &3Salty Swills&r\n*32 Compressed Crystalline Shards\n*&3Xeno's Pirate Hat&r\n*Access to the Mistport Black Market\n*Crew of Mistport pirates"}